{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lmRa6LCCeGcPlGPnzM8Oiw", "review_id": "1re-ICv52DGIGntWWAVGrg", "stars": 4, "date": "2011-01-06", "text": "Great fish fry.  The fish is fresh and comes in a great portion size.  Service is good.  Having left the area, I really miss this place.", "type": "review", "business_id": "gekPL0Kc7w9zLDT3EulvxQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MoTcMUoiq1woloAFSPt4Zw", "review_id": "AuZwSosEEyAFflVA0Uw2Lg", "stars": 4, "date": "2012-03-23", "text": "Crowded and awesome. Just imagine TGI's food, better prepared with a cold microbrew.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PoAc1N3GaOeWdBVSFsleig", "review_id": "hpqlcwKHaGu0p_ppqwOtDQ", "stars": 5, "date": "2012-09-27", "text": "Best customer service, and they have everything.", "type": "review", "business_id": "5BM0cmJvxaFlFuh0L-b4Ow"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "DVlwMOMHi5gCpSLVPByJBw", "review_id": "FfyveDJC1Pc6r9V-XQUtiQ", "stars": 5, "date": "2007-10-02", "text": "i was hesitant about giving a car dealership 5 stars but really, i have had a fantastic experience here. i would most certainly recommend anyone to come here for a car (if they wanted a mazda or a vw)\n\nhere is how it went: my jag broke the rear driver's side ball joint. again. the friday before last. so mis and i went car shopping as i finally reached the point of not liking pouring money into a car more than i loved driving a car. \n\nwe went to Northway Toyota first, our sales rep was nice and not too pushy but after trying the rav4 (didn't like it. the car was boring.) and sitting in the uber-cool FJ cruiser. (way too boxy, much less cool on the inside than on the out) and wanting to try the bug, it wouldn't start, battery was dead. so we went on...\n\ni had searched online for a vehicle and found a really good deal at Martin Neemer for a honda element so we decided to go there next to try it out. turns out the owner took it home with him. the rep was apologetic about it but still, a car they listed online was not on the lot. i was irritated.\n\nnext we went to keeler, the mini dealership they didn't even acknowledge us until we went and said hello. i loved the mini but they didn't have any very good deals so we went to the honda part. there i tried an element (orange) and it was fine but the rep was really over the top and off-putting. so we decided to call it a day.\n\nmissy's husband adam had looked online and found some good deals on bugs at Cooley in East Greenbush tho so we decided to swing by on our way back. \n\nthey were closed when we got there but we still walked around looking for the green one he had found online. out back we found it, it was unlocked so we got in and checked it out. i was instantly in love.  as we were walking back to the car, a young man came out and asked if he could help us. he was willing to go over information even tho it was a friday and they had closed 30 minutes earlier. i let him off the hook and said that i was interested but would come back monday.\n\nto make this long story short, they gave me a great deal on it, less than the listed price on bluebook.com, they gave me money for the tradein on the jag, they gave me a loaner until the bug (that they had just gotten in) was ready for me. and they were Very friendly and helpful the entire time. \n\nthis is the place to go for good service.\n\nto", "type": "review", "business_id": "deMySa63_mE3Jy2lWMU1Dg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yexPXtqaRWuBMurl5tvDdQ", "review_id": "CYiH_1BOOjTL5xoHZnst8g", "stars": 4, "date": "2012-03-04", "text": "Excellent, excellent, excellent! Service is wonderful and so friendly, the food is fresh and very tasty and it comes out fresh and hot. Nothing is overspiced to be overdone and it is well seasoned. Everything goes perfectly with a mango milkshake.\n\nHighly suggest the lamb madras...if you like coconut and nuts mixed into a cream sauce, it's perfect. It's the right blend of tangy meets spicey. That with some rice and side of naan and a potato samosa to start and you could have a happy stomach!", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "gLee0eghjc50_BhzPGlQJw", "stars": 4, "date": "2009-10-09", "text": "I really like Karavalli. Fresh, deliciously spiced food, the only down side is the price tag. If it were a few dollars cheaper I could bump them up to five, but then again I'm sure their quality would suffer. \n\nEven their buffets are amazing. Not just leftovers or generic food. I've tried so many dishes I've never even seen on the menus of other places on the lunch buffet at Karavalli.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QEq_NdZePer4HOCZSR7Oug", "review_id": "q4m7saMa85zGHbskZlVcEg", "stars": 3, "date": "2011-12-21", "text": "The pizza is the best in Troy, period.  Don't give me any nonsense about how much you like the Buffalo Chicken at I Love Pizza of Troy.  \n\nI will begin by saying that I am extremely picky about my pizza.  I have noticed that people from other parts of the world different from New Haven county in CT have no idea what good pizza is.  DeFazio's is not that great, but the best in Troy.  \n\nI judge pizza on two main areas: crust and sauce.  If you hold toppings and cheese constant (RPI student here), the sauce and crust determines the quality of the pizza.  The crust is not that good.  It could be much thinner and have much more flavor.  A good Extra Virgin Olive Oil and a little more salt on the crust before the sauce and toppings could solve this problem.  \n\nThe sauce is really, really good.  It is a rustic sauce, not sweet just full of flavor.  They make their own delicious sausage.  They use high quality pepperoni.  They love food there and it shows.  They take pride in their family heritage and are very welcoming.  Plan on take-out.  There are only four small tables in the restaurant.  My friend went there only a few times to pick up pizza and they already knew his name.  \n\nI really like this place, but the pizza could in fact be better.  I never had anything but pizza so I cannot comment on the remaining menu items.", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eLocyu86Ej-C8ati2vofcA", "review_id": "g55h0gisOjrPcpNPksMtOg", "stars": 1, "date": "2009-08-26", "text": "Stopped in for a beer.  Sat on the patio and had an insipid porter and a bland IPA.  The wafting stench from something that must have been dead and rotting on the river bank below didn't help.  Beer reminded me of what you'd get at a \"brewpub\" run by AB or CoorsMolson.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Mei9VKFUzPEqGzLHWis4kg", "review_id": "9QxYpZOSmAVe6nlHa6_wLw", "stars": 5, "date": "2012-08-31", "text": "I'm not one who easily throws out five stars.  And I'm not about to say that my lunch at The Flying Chicken was perfect.  But here we are, a few days later, and I still can't get the thought of the chicken and waffles at The Flying Chicken out of my head.  \n\nThe chicken and waffles comes with a plump waffle and two boneless, fried chicken breasts.  I also got a generous side of real maple syrup for a dollar extra, bringing the total for the meal to a grand $8.  It's always a risk getting boneless white meat at a fried chicken place; will it be as juicy as the dark meat?  \n\nThe Flying Chicken got it spot-on.  The chicken was moist and succulent on the inside.  The breading was crispy, drained properly, and filled with salt, pepper, and other spices that gave it a good kick.  K had a couple pieces of dark meat, and those were also done just right.  (I also wanted to steal her whole biscuit--there was something delectable, a touch of cheese, maybe, about it.)\n\nI don't know how much one can say about a waffle, but this one deserves to be talked about.  Firm on the outside, and so fluffy and almost creamy inside.  It was excellent on its own with the maple syrup, but when you ate all three things in tandem, every bite was luxurious--sweet and rich and salty, crispy and fluffy all at the same time.\n\nNow, I will say that K's collard greens didn't stack up to others I've had in the past.  They're made without meat, and so they were missing some richness and smokiness.  That could work, but I think the tang from the vinegar would need to be increased.  And the kitchen-sink cookie, while very enticing with marshmallow and pieces of bacon involved, didn't taste all that fresh.\n\nNo matter.  I'm still floating on their waffle while daydreaming about the fried chicken, so it's pretty much all happy thoughts over here.", "type": "review", "business_id": "tGJTMrSWb6wufN3m_yGOvA"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "jbme6UoDggF7NtkItZZyhA", "review_id": "j0szHBph7HYKBOgVH09F1w", "stars": 4, "date": "2009-04-29", "text": "Clean, the people are nice, and the meat prices are less expensive. Compared to Price Chopper's prices, they're a little cheaper.", "type": "review", "business_id": "UZFBK4pU-VcEt1N4IoYCRA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YN9hBSEEeT0BaZXSMs2XMQ", "review_id": "7VIG1Yig2j7QGRvnrFOyKg", "stars": 1, "date": "2012-04-14", "text": "Not good very thick crust tasteless red sauce no atmosphere would not recamend", "type": "review", "business_id": "gYdx3POVviEoVSFXgIYElg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tAD2rxH0SGeHl_mtBxUnwQ", "review_id": "4ZAdTSVqmnaijT66to6Y4w", "stars": 1, "date": "2012-04-23", "text": "They are one of the businesses out there that makes money on shipping. I order some touch up bottles from them. I ship all the time so I know UPS charges them about $11 to ship it. They charged me $28.07. Also they will not tell you the status of your order, if it's been shipped, or if there's any problem until you contact them. Absolutely poor customer service. They sell the bottles that I need. I've been looking and nobody else has them for sale. I wish there was another option because I hate ordering from these people.", "type": "review", "business_id": "juuN71EcoKNZ-tFSzYE9mQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vIHxU9swUNKiuXUiQhulZw", "review_id": "sPfrUgZXwIV1tnaRdLBD9A", "stars": 3, "date": "2012-02-17", "text": "When you are born and raised in Albany, Price Chopper and Hannaford are the only two grocery stores that really come to mind. A few years ago when Fresh Market announced they were making an entrance into the capital district I couldn't believe it.\n\nHaving shopped at Trader Joes a few times out of state, I was hoping Fresh Market could bring some of the same qualities and selections. The store is quite small, compared to others, but contains almost everything most stores have. \n\nOne of the main reasons I shop at Fresh Market is for fresh beef. Fresh Market carries Hereford beef which is known for being leaner and more flavorful compared to most beef. The full service butcher counter carries it all from filet to chimichurri skirt steak to premade gourmet burgers and much more. Every time I have purchased beef here it has been amazing and tasty.\n\nFresh Market also has very good prepared foods. I have recently fallen in love with the curry chicken salad (thanks for the recommendation ;-)) and the baked potato salad is very good as well. They offer many other prepared foods such as fried and grilled chicken cutlets, meatballs, salads, and twice baked potatoes which I have heard are good. \n\nOther unique features are that you can grind your own fresh peanut butter as well as create your own 6 packs of beer, which is nice.\n\nFresh Market can be a little more expensive than other places but if you are looking for quality items and don't mind the increase then this is the place to shop.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "MQjLtfzu6YuF5uf_3xUAHw", "review_id": "rvWMNBCQvmXPijfoZqNJ8A", "stars": 4, "date": "2009-10-23", "text": "This is a very nice place. If you like crowd and noise, downstair by the bar is the place for you. On the other hand, second floor in the Trojan room is surprisingly quiet. Food is the usual, but good portion for the price. Beer is cheap too if you're from NYC. \n\nIf you'll be there during daylight, river view is great too. The place is between the main 2 bridges of Troy.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yB5wtLfcxtboFlq1AvZ0xg", "review_id": "N41ZMAssuMFBwOgJOz-0xA", "stars": 2, "date": "2010-10-31", "text": "When I first found Lee Lin i thought their food was amazing, but I think it was really was just because it wasn't as horrible as most other chinese places. After having some real chinese food, I still think the food is ok, (for delivery at least). I like the sesame chicken has a real sesame taste to it, and that you can order mild, medium, hot, etc. \n\nThe problem I have and was reminded of it tonight is the insanely inconsistent delivery. At first there would be times they would come in 15 minutes and I didn't even know how they could have cooked the food that fast. I would give solid tips, i am always a real solid tipper, i would tip 10 bucks on a 30 dollar bill if it came in 15 minutes.\n\nThe last 2 times i have ordered the food has taken 1.5 hours to 2 hours to arrive and i have had to call both times. Today I called 1.5 hours after ordering and was told the driver had just left. After I had given specific directions for the driver he still had to call. \n\nI feel bad for the driver, I know it probably wasnt his fault. But I want to send a message so I tipped nothing, and told him, \"I had a better tip for you 2 hours ago sorry\".\n\nSo if you guys ever do happen to read this, if your driver is coming back pissed off that he got no tip, or  you consistently are getting so busy that you cant deliver food within 2 hours, then it is time for you to shell out some cash and get an extra driver.  \n\nOr at least have the experience to tell us it is going to be a while, or call us back. Don't tell me it is going to be a half hour and set my expectations high by being good some times and then be the complete opposite the next time.", "type": "review", "business_id": "kPRhhVfGK_rIQFG6iAWBdA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c3uMuPGDLLLB2qUtptlv8w", "review_id": "wJpMSE1a08AnfQNqk84DmQ", "stars": 5, "date": "2011-02-22", "text": "The beer here was GREAT!  Try the whiskey porter...it is fabulous!  \n\nI enjoyed the house burger and my mother had the grilled chicken sandwich.  The BBQ sauce on the chicken sandwich was great.  It was marinated in the cherry raspberry beer.  \n\nThe service was great and the atmosphere was even better.  Try out this beer!", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p5ESn4fQTdODdVpdgpvZgA", "review_id": "IBSpbFmM0zZRGAfKr-GN9w", "stars": 1, "date": "2012-01-23", "text": "Information about products on their website is incorrect.  They shipped the product but it wasn't what was listed on their website.  Customer service refuses to refund even when the error was made by them.  Poor customer service!", "type": "review", "business_id": "juuN71EcoKNZ-tFSzYE9mQ"}
{"votes": {"funny": 5, "useful": 6, "cool": 1}, "user_id": "Q6-oT1z6o-pUR3TO0gfTFg", "review_id": "Q2LmuX0QfDB2eJ3HIaRoJg", "stars": 4, "date": "2011-03-13", "text": "Now that my puppy love stage with The Fresh Market is over I feel that it's fair to review it.\n\nWe'll start with what sent me in to my blissful denial stage. \n\nWhen you walk in, the smell of fresh flowers and the classical music immediately put you in a great mood.\nIt's a fantastic way to start off a shopping trip. (not so good for my wallet) \nEverything is beautifully laid out and merchandised wonderfully. \n\nYou sometimes you forget you're in Latham.\n\n(Although the zen like shopping trip are null and void when you go on a Saturday)  \n\nThe merchandise-  \n\nThe orange juice is super delicious but pretty pricey.   They used to have a sample area for it but that has since disappeared.\n\nI heart the coffee and all of the coffee choices. My favorite is the chocolate cherry.   It's actually cheaper than the Green Mountain that I usually buy. \nI also love that I can get a little sample of coffee to have while shopping.\n\nSpices!  I love the little spice bags I can pick up for 1-3 bucks on average.   I can fill up my spice collection without breaking the bank.\n\nNotable mentions-The ginormous olive bar, the fact that they carry hearts of palm (although none from Brazil)  and the set price for the you pick 6 beers.\nThe sun dried tomato and asaigo cheese bread.\n\nExcuse me for a second.\nahhhhhhhhhhhhhhh mmmmmmmmmm\n\nOkay, I'm back. \n\nNow onto the reality stage of the relationship.\n\nBesides the already mentioned poor cheese selection, the bread selection is probably worse.\n\nSince they don't seem to carry the Ezekiel bread I usually buy, I was going to treat myself to regular old wheat bread but after scouring the small bread section I couldn't find anything that wasn't filled with gross ingredients.  \nAlso, I don't think they carry almond milk.\n\nNow for the embarrassing part.   \nIn a moment of starved weakness I purchased a spicy trio sushi platter.  It was pretty gross all around but what do you expect?  However, it gets worse.  As I was stuffing a piece in my mouth I looked over and and staring back at me was a piece of shrimp that was not de-turded.  (I'm no seafood expert but I have seen Tommy Boy a number of times.)\nLet me say, I didn't finish my mouthful.  \n\nThat was hard for me to admit but I felt it was necessary to save someone else from making my mistake. \n\nI still love The Fresh Market as a fun little excursion and a place to get coffee but not as my regular shopping place.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "7BITmL3qiV7f9UPf8IYVhw", "review_id": "cqTDRUfomWDi2o2QXkoGkg", "stars": 5, "date": "2011-02-10", "text": "Another reviewer said \"cute retro-vibe\" and I'm reminded of the 75+ year old lady who told me, as she slowly ate her burger and fries, how she had been coming to Jack's ever since she was a little girl....  Retro, indeed.\n\nRetro is when you make something now that reflects something from the past.  Jack's, in my opinion, -is- the past.  Let me explain....\n\nI'm vegan now and wouldn't actually eat at Jack's today, but I ate there on and off for decades.  I still crave these burgers and fries, and I haven't had them since the Summer of 2008.  That's a long time for a craving to stick around.  There has to be a reason....\n\n1)  I'm pretty sure I started eating at Jack's when I was in diapers, and although I can't remember what I had for lunch today, I can tell you that Jack's food simply hasn't changed.  Consistency.  You aren't going to Jack's for something modern, off-the-wall, different - it's an establishment where, unlike many others, you know exactly what you're going to get each and every time you order.  You also know that if you come back the next day, or the next year, there's a pretty good chance you won't be saying \"this used to be different\" or \"they changed something, I can't quite put my finger on it!\"  In a world where things are constantly being watered-down, and change is the only constant, Jack's is an oasis of...well, tasty-tasty grease.\n\n2)  The menu is simple: You've got your basic hamburger with a grilled bun and grilled onions.  I love caramelized onions, and whenever I make them at home, I pray that I will eventually hit the jackpot and figure out their secret.  Yes, grease from hamburger -might- help, but it hadn't in the past, and as a vegan, I'm only going to get so close now.  Hot dogs are probably good but...they're hot dogs.  You've got your fries, which are pretty tasty, although best eaten hot with ketchup (if you're into that).  They have milk, milkshakes, and soft drinks (fizzy and not).  I used to get two or three burgers, a large fry and a Hawaiian Punch.  Pretty sure I slept the drive home each and every time.  \n\n3)  No-frills.  You pull up, park - plenty of parking - and wait in line.  You order, and they fill your order quickly.  The menu is so small, it's not that hard to choose, and they don't really have to spend a lot of time making different things.  You want a burger or hot dog?  Fries with that?  Maybe a drink?  Done.  You take your order on the red tray over to the picnic tables and pray that your napkins or food don't blow away if the wind is high.  That's what the drink is for anyway - to keep the napkins down, and to wash things down.\n\n4)  Alfresco!  How often do we actually eat outside, on a picnic table, under beautiful trees filtering the sunlight?  I'd say for most of us staring at our computer monitors reading this review, not often enough.  Leave your technological gadgets in the car and have a meal the way it used to be.  It's really pretty, even when it's warm in the summer, because of the huge...HUGE shade trees.\n\nA few things to keep in mind:\n\n* This place is easy to miss.  You turn a corner, from either direction, and you're like \"whoa!\"  If you have a GPS, and it takes kindly to the lack of sky visibility, or if you have directions pre-printed, you're golden.  If you pass it, turn around - it's worth it. \n\n* Go hungry.  I mean, seriously, you want to eat at least one burger and a basket of fries.  If you go, and you're not hungry, you will be sad.\n\n* Don't compare.  This place has been around longer than most of the people writing reviews on Yelp.  It's older than the Internet and, heck, it's most likely older than TV.  It's nice to see a good business sticking around for what must seem like forever in this economy and, if you think about it, Jack's has survived a lot worse. If anything, Jack's is a living testament  to what you can do, and what you can keep going, with a good, simple business strategy, and people wiling to come to work every day.  This is not a fancy restaurant, and the prices are reasonable.  I think a lot of the ingredients we see in foods these days weren't even invented when Jack's first opened up, so keep things in perspective.\n\n* Bring a friend.  Hey, someone has to drive your sleepy butt home, right?  Or at least talk to you to keep you awake while you drive.\n\nAlso, I have seen many times where people have stated that it's a cash-only establishment.  Do yourself a favor and call ahead. If they do take credit cards, you can save yourself a trip to the ATM. Or just go retro and pay cash - it's fun.\n\nSummary: I don't believe you can get this burger experience anywhere else, and I've tried.\n\nJacks: I can feel my arteries hardening just thinking about it!", "type": "review", "business_id": "Yjm7Lw8_PLPBRwDlaCHvsQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BYtz8iBtJKVCqysMrWFn2w", "review_id": "xg0l7O-5J1I23qR16UpS1A", "stars": 4, "date": "2010-03-28", "text": "Great sliders with a unique taste! I go here for lunch at least once a month", "type": "review", "business_id": "Yjm7Lw8_PLPBRwDlaCHvsQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DVlwMOMHi5gCpSLVPByJBw", "review_id": "5hhbdlMI1NxgI99FjulsLQ", "stars": 3, "date": "2007-09-11", "text": "yes, i know it is a chain. but it is a good chain. \n\nthere is a ton of seating, the service is friendly and good and they have a Very nice salad bar that comes with the meals. the SB has such things as oriental cabbage salads, lentil sprouts, tons of veggies including peas and some good dressings (i like the house, it is a sort of dillish type.) and they have extras to put on top like soy nuts, granola, wasabi peas, almonds, raisins and those asian noodles my daughter likes so much.\n\nthey serve a delicious brown bread to start you with (there is fresh french for kids if you ask for it tho it takes them time, as they have to make that individually). there drinks are reasonalby priced and sized and they have a good selection of top shelf liquors (for our martinis). their steak is always good. butter knife cut good. one of the things that irritates me however is that you only get a starch with your meal. you cannot ask for veggies instead. but whatever, you can get a nice size side of fresh steamed asparagus or broccoli so i just suck it up.\n\nthe decor is typical of a chain steak house, with fake deer heads and stuffed bears along with the somewhat Western motif.\n\nthis is one of my daughter's favorite places and never fails to satisfy (that is as long as you stay away from the Non steak items. the shrimp was awful and so was the trout. i suppose the lobster is fine as they proudly show them on the left when you come in.)", "type": "review", "business_id": "9tHSgPt0_icRH9VNJqG-QA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OzoDORrK8U3wd3nBU3jDoA", "review_id": "6JMxj4-un4daeDx3-0KoPQ", "stars": 4, "date": "2011-04-26", "text": "Pros:\n* The food is great!\n   * Dosas\n   * Bhel poori\n   * Biryani \n   * Saag paneer\n* The restaurant is generally clean with good dinnerware, etc.\n\nCons:\n* The service is thoroughly inept. \n    * Expect to ask several times for items.\n    * And make EXTRA certain they understood you.\n    * Chances are they'll still get it wrong.\n\nAs an apparent law of nature, all central Asian restaurants have abysmal service, but this one at least is clean, uses real dishware, and really does serve excellent dinner.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "M781gUfqguo-kdIKDG0wqg", "review_id": "QkrJMasj5l8VAq31sPOBqA", "stars": 5, "date": "2012-06-02", "text": "Went to the Ilium Cafe in Troy tonight. Everything about it was fantastic, especially the waitstaff. From the hostess to the waiter, great customer service. I had the talapia, wow excellent! My daughter had the filet mignon and she loved it!  My wife had the shrimp and angel hair, yummy. The Bailey cheesecake, OMG, to die for. Marla and her staff have a very creative and tasty menu, and I will return very soon. Thanks Marla", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0Sw9sDJy9beVwPX6EfOKeg", "review_id": "ukhxzmcth4BRlGV63fY0tA", "stars": 5, "date": "2012-10-01", "text": "The best Indian in the area- and it's really not close- for not only the quality of the food but the variety.  \n\nThis isn't just a slather it in curry Americanized northern Indian place; they specialize in southern Indian cuisine.  \n\nI can't recommend this enough- go there and experiment  try something you've haven't before- it will be good. The brunch buffet is always a delicious treat.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "4ujDwiek_48n2Q4NzJb6zA", "review_id": "0IAlwrw7ZrbWE2Lk7MI_IA", "stars": 5, "date": "2011-02-12", "text": "Wow, this place has everything you need. It also employes people who know exactly what almost all the beers taste like and how they are made. I have no idea what half the words they say mean, but they usually can pick out a great beer. They have lots of good beers to try, and all of the usual and classic favorites for a good price.\n\nThis has to be my most favorite beer store in the world.", "type": "review", "business_id": "02AT15PDQTbiSoiXtNgMDg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8CpzsxSv77dhzTimJ78DoQ", "review_id": "3PjpSsl_sv2hmRFAAHePew", "stars": 5, "date": "2010-04-12", "text": "I LOVE this place.  The staff is very friendly and they do great nails.  I love the atmosphere.  Stephen and Nikki are great people and they have created a very friendly atmosphere.", "type": "review", "business_id": "z6Ut4WINzV8aK83c3lZPtw"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "vEWlSdEihyvP3oYyAEBS2A", "review_id": "P5bh5ufePeXFcmDudDxfZw", "stars": 5, "date": "2010-06-26", "text": "Frosty Magoo's is easily the worst name ever for a bar, but this is one of the best and most eccentric nightspots in the area. Good luck finding this place, though. They have no web presence, there's no identifying signage other than a chalkboard panel at the door, they're on a street that Google's street view doesn't cover, and I'm not even sure if they advertise. Just wander around River Street near First and ask around.\n\nFM's in a former bank. There's a small plaque on the building stating it was built in 1811. The high-ceilinged interior of the main bar is decorated with junk salvaged from the alley behind the building. Overall, the design feel is \"That looks good enough, fuck it, I'm done.\"  The walk-in safe is carpeted with astroturf, and people seem to use the room as a putting green. There's an alcove for darts, a back patio full of people making out, some dead space with mismatched tables, and a small stage adjoining a kitchen. The waitresses have to carry their orders though the bands as they perform.\n\nClientele is a stew of Trojans. Everyone's drunk, and everyone is having fun.", "type": "review", "business_id": "R5tjtiq1YeSAS4MZmjNnWw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HZn-bjDaz2gpQtZCdyl75A", "review_id": "VGNBpYEhDoE-ST_D14pOWw", "stars": 5, "date": "2012-08-10", "text": "I love this place. Their pizza and other food is always really good and cooked on time. They have great service and I love the online deals and rewards club. I have gotten 5 or more free pizzas from them in the last couple years because of winning them as prizes or using my rewards points. The only bad thing is that they don't deliver to my house, even though I only live 5 miles away.", "type": "review", "business_id": "KjMloHECqYkQEJslek8v_A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c3uMuPGDLLLB2qUtptlv8w", "review_id": "CxplIdO7lzMKG-tFH9Z7TA", "stars": 5, "date": "2011-03-02", "text": "Great pizza at a great price!  It is an average pizza place but the prices are so reasonable!  \n\nI give it 5 stars because it is fast, cheap and delicious!  YUMMY!", "type": "review", "business_id": "hhjYGhB_Le97qh6rFynOQw"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "1aU0r7X2luo9P8hfSpq6ng", "review_id": "QaSUOfy8CwBQVr9pWqC1Xw", "stars": 4, "date": "2008-06-11", "text": "I bought  a car from them 2 years ago. They were pretty good and the sales person understood that I knew what I want.  He didn't try to sell me anything I wasn't interested in.  i even got some free Mazda schwag.\n\nToday I got a birthday card from them.  2 years and a new state later and they still bothered to send me a happy birthday note.\nThat deserves a review!", "type": "review", "business_id": "deMySa63_mE3Jy2lWMU1Dg"}
{"votes": {"funny": 3, "useful": 2, "cool": 1}, "user_id": "VTLRv5RsJR-NU17JP9vhZg", "review_id": "EuLVjHXNHH3S57OCcM3WEQ", "stars": 1, "date": "2012-09-12", "text": "Do not trust the hype, fellow RPI students. I firmly believe that you have to be 100% hammered to be able to enjoy this \"food.\" \n\nBella is some of the worst food you will ever be tricked into paying money for. It is awful. It's greasy as all hell, the crust is flavorless and stale, and the toppings are legitimately disgusting. They are all either super salty or just gross in general. The sausage in particular forced me to throw out like 80% of my slice, which is something I would never do to a slice of pizza under other circumstances.\n\nThe only reason this place is popular is that it's open stupidly late and it's really cheap. But do yourself a favor and order Domino's to eat a little later so you don't have to subject yourself to this nest of mediocrity.\n\nI've had better food from Commons. I've had better food for 50 shillings in a rural village in Kenya. Do not eat here. I'd rather starve.", "type": "review", "business_id": "y0J2PrJh2LIDHHtT6DzkJw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "jbme6UoDggF7NtkItZZyhA", "review_id": "BFMVyd21KGTi0BlWphJxwg", "stars": 4, "date": "2010-05-11", "text": "Their 8 cut is considered a large and cost only $10.95 and it's huge. \nApparently their the 1st place winner at the Watervliet Wing War, but I haven't tried their wings yet.\nThey have soup of the day, salads, cold and hot subs, pastas, burgers. They also Cater.", "type": "review", "business_id": "bLdLMuRRXPNAOhyGrLPXUw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XS7JVZuVasTHToAXkK2BVw", "review_id": "BKI9MpwbbWfr8ukxORR--A", "stars": 5, "date": "2010-12-30", "text": "Absolutely delicious! I've eaten here many times and it's a favorite for lunch takeout in our office. The food is always fresh, always tasty, and the service is great too. I appreciate that the menu options range from the staples to more interesting and adventurous foods. Their falafel are some of the best I've ever had. My husband said their gyros rival Anton's and that's certainly a compliment. I've never been disappointed and will continue to head to the Garlic Lovers regularly!", "type": "review", "business_id": "hluBhGYt7BOKhCP4M0qDDQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "b88UypNThcm7GmqXeFHoyA", "review_id": "HyaAocp9iZ-vqS0PcHX2-A", "stars": 2, "date": "2011-01-05", "text": "I was meeting a friend and Browns happened to be convenient. I got there and there was ample parking (a huge relief after the snow storm) and went right inside. I had been looking at the menu earlier in the day... because I do indeed research my food options beforehand, and was disappointed with what was listed. Considering Browns is mostly restaurant and only 1/8 of the space is actually bar you'd think their menu would reflect that. I wasn't in the mood for a burger (this is indeed very rare... no pun intended) and everything else just looked eh. \n\nI ended up just choosing the Southwest wrap because it was the least offensive and I thought that it'd be difficult to screw up a wrap... I was wrong. I asked for no cheese, which they did properly, but the wrap was kind of empty and open on each end (huge pet peeve) so everything was falling out and I had dressing all down my arm. Real attractive when you're eating with another human being. I ended up not even attempting the other half, and crunched on the over-fried fries. \n\nIf I weren't driving home, then perhaps a draft would have made everything ok, but if you're going to serve food, make sure it's good. Browns, I will not be back.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "VKNIr0wf6u5526MjlE99tw", "review_id": "aWUFc4N1X-KA7DLhTzdfFA", "stars": 5, "date": "2007-12-21", "text": "This is definitely my favorite local music venue. It's spacious with wood floors, high ceilings, two levels and a large stage. And - you get the added bonus of it being right next door to Brown's Brew Pub so they serve Brown's awesome beers. \n\nThe last show I saw here was Ted Leo and the Pharmacists with Georgie James. The sound was great and you could actually move around a little without feeling completely claustrophobia. Parking is easy too, because there's a municipal lot next door.  \n\nThey sometimes hold the post-Troy Night Out music events here and those are always a lot of fun too. \n\nIt also seems like the music schedule is getting a lot more - it used to be mainly just jam band and blues-types of stuff, but now they seem to really be mixing it up.", "type": "review", "business_id": "9R5M8pvADCjM_0rfZTwb4A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rK0zUFr0dFHZFfchqSDWAQ", "review_id": "vXWrNTTFV6ubppGkkrDEHg", "stars": 3, "date": "2012-01-17", "text": "Browns is very solid. Came here for my friend's 21st birthday dinner (she went to RPI) in August of 2010.\n\nI can't remember what beer I got -- it was either Oatmeal Stout or Cherry Raspberry (a friend got one and I got the other and I think we split them). Both were excellent and I've heard great things about the other brews as well.\n\nChicken wings were great -- deep-fried, super crispy. I normally prefer non-breaded wings but these were so good I didn't mind. I split a dozen with a friend and we also tried chicken spiedies, which were good.\n\nOverall, I'd come back. I think I'd have to come here more than once to give it more stars.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 2, "useful": 11, "cool": 5}, "user_id": "XXsKHHyzJWW5KWw63lug-w", "review_id": "7DLATvIVBlPje3BKueoyhQ", "stars": 4, "date": "2008-08-07", "text": "I discovered this place through my father. Every Thursday he heads over to 'Golden for \"Polish Night\" and brings plenty of things from there to nibble on. I'm not sure if Thursday is the only night they have the Polish food, but that's the night that's been dubbed Polish Night.\n\nThe food? Uum, pretty tasty :) We're Ukrainians(I'm half.. papa and gram are full).. not in fact Polish but I guess we all kinda share the same food so I've grown up on it ,and think I'm a fair judge of  the \"Slavic\" eats lol. \n\nThe Golumpkies(stuffed cabbage) are very good... like very, very good.  I myself don't eat the cabbage part.. tried it once when I was like 5 or 6 and once was enough. Even as an adult, I still have a childish palate towards the veggies. That's why you'll find veg in vitamin form in my medicine cabinet! Anyhow, if you're like me and you ever have these and just eat the stuffing.. the stuffing is veddy, veddy good. Two thumbs up! Or if you're all brave and adult about it. and dig the cabbage you'll probably really enjoy the whole package. My father and grammy do and they're good judges on it.. it's def grammy approved.\n\nThe Kiebasi? I don't eat it but my father and grammy enjoy it.\n\nThe Pyrohy(pierogis)? They're tasty. Not Ukrainian Hall Bazzar style good(I'm biased).. but still quite tasty. There's a little more of a sauerkraut taste to them(it's just a hint I swear), which we like in our family. Funny, but this is the only time I like that stuff and didn't even know what it was when I tried these \"what's the taste?\" .. I was surprised I enjoyed it. Had I know what it was I probably wouldn't have tried it. Something about the potatoes, I think the fact they're not as thick of a texture as the ones I'm used to, keeps me from *loving* them.. but I do enjoy them plenty.  \n\nIf you were to go on a Thursday, you would see a ton of old-timers and plenty of \"youngin's\"  leaving with bags of stuff. That to me, says this place knows what they're doing :)\n\nI guess this place used to be in Cohoes as the Golden Krust Bakery but they relocated here and downsized after a fire. They now have a smaller seating section(according to my dad it was much bigger in Cohoes) for dining in, and focus on Bagels and sandwiches most days. I'm not sure of prices, but I'm going to guess they're on the cheap eats side seeing it's got a large takeout base.", "type": "review", "business_id": "oYg8-g5mD1HPJSfj5U69BQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "01jWqNHBaACJEjLeIZ8yTg", "review_id": "sBCYHfrewcSXCcrBDl9rZg", "stars": 3, "date": "2010-06-19", "text": "Stopped in mid-week for pizza. Ordered the garlic bread & the Kennedy pizza (can't remember its name). I didn't fall in love with the food--dry garlic bread, alright pizza, but it was a comfortable place to hang out. Low key, non-pretentious.", "type": "review", "business_id": "cnSXX4gGaEGy75BElLiSDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fwd_rUQ9aFjlPw2RwcKCag", "review_id": "k0KSHHhpa6Vl6BV0HvGirg", "stars": 4, "date": "2009-12-01", "text": "Well as everyone says, the bar area is packed beyond belief, especially if a live band is in the house - so opt for a table if you've got it.\n\nThe service can be weird though. We kept pointing to beers on the back of the regular menu only to hear that they were sold out (it was Friday night around 9pm...so that's weird). But eventually we settled on a few beers and (when given the right menu) got most of the beers on the menu. The beers are all flavorful and surprising, packing decent punches and spices, enough to satisfy a wide range of micro-beer lovers.\n\nThe food is also fantastic. I especially dig the pretzel and hot wings. The pretzel is served hot and fresh, with a delicious dipping mustard. The hot wings (went with the cherry ale finish) were sweet and salty, meaty, crisp, and served with delicious blue cheese.\n\nOverall, outside of some shotty service, and some above average prices, I'd say this is a great spot to hang out with friends and catch up, drink a few great beers, and snack. Good stuff.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "PoAc1N3GaOeWdBVSFsleig", "review_id": "0awLhhzsHs5n7ARaodc4mw", "stars": 4, "date": "2010-02-21", "text": "I've been shopping at the Homebrew Emporium in Cambridge for a few months now, and decided to stop by to the Rensselaer location while I was in town to pick up a few things. \n\nThe store is SO HUGE compared to the one in Cambridge, but this comes as no surprise considering the cost of real estate in both locations. While the Rensselaer location has the disadvantage of being in a weird strip mall on a heavily trafficked road (it's hard to take a left turn into this place), that all doesn't matter once you step inside.\n\nThe selection of stock on the shelves is huge, there's almost an entire room dedicated to wine kits, unlike the single shelf at Cambridge. You could easily lose yourself browsing around at bottles, wine kits, corkers, presses, beer brewing ingredients, books, and miscellaneous accessories.\n\nThe employees were very helpful and were able to find me the things I needed very quickly, and they were also quite friendly. I was in and out quick because I was in a rush, but in the future I'd like to spend more time checking this place out.", "type": "review", "business_id": "_1ocatc2jqyIgizF7FWr0Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Alo2cjxtqZwMVxJeRwT_5Q", "review_id": "ARbCnEQX2R49OpRhFlIJSQ", "stars": 5, "date": "2010-09-02", "text": "I will start by saying that I was born in Poland so I had very high expectations of this place. And luckily when I walked in I was pleasantly surprised by the the notes of my spoken native language. This place is authentic as it gets because the family who runs it are actually Polish. \n\nI do not agree that the decor was ugly like some review it was surprisingly classy for a Polish eatery lol. \n\nThe perogi were properly overstuffed and prepared with the fried onion bits like my Grandma and Ma used to make. And the potato pancakes were crunchy and perfect! They could have also been out of my Moms kitchen. The fried Nutela and banana crepes were also delicious even after transport (because we could not eat them there, we were so full, we took them home). DELICIOUS.\n\nThe people who sat next to us also looked like they had lovely food, it smelled amazing. Some kind of meat and pot pan stack that I need to come back and try.\n\nThe only thing which wasn't up to par was the spinach crepe which was overcooked, tasted ok. And they could have had more Polish beer varieties, but I'm hoping they do since they recently opened a beer garden.\n\nThe waitress was also lovely. She was very friendly. All my senses were telling me I was at home and well satisfied. As I walked out I thanked the lady of the house (in Polish) and told her we sure would be back.\n\nOnly regret is that it took me this long living in the capitol district to discover this place. A must to check out especially if you have a soft spot for perogi.\n\nAnd no there is no S on the end !!! Perogi is both singular and plural. Enjoy!", "type": "review", "business_id": "U_wLGkq86qyd8yzpKyFswg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "62xleOvA8A9Zba9RSTA8KQ", "review_id": "ZfqjnClDfoMZ2K45-LcOjw", "stars": 4, "date": "2011-10-22", "text": "After moving to Cohoes I was told Mick's was the best thing there and I had to try it. I don't know why I waited so long. I wasn't in the mood for regular pizza and they have a variety of specialty pies so I tried the Shrimp Scampi pizza. The white pizza is very good complete with a garlic seasoned crust but the shrimp were really tiny. Not that I expected anything a whole lot bigger because its just a pizza topping. No one else was interested in it so I just got a small for myself. It only takes about 2 slices to fill you up so I had plenty left over. This is the only reason I wouldn't try the Shrimp Scampi pizza again. I have to be in a certain mood to be craving it and shrimp isn't quite as good reheated. The wings were also surprisingly tasty. I ordered medium for myself which weren't hot but had great flavor instead. But I found myself getting addicted to the honey bbq wings my gf ordered. I thought the prices were very reasonable also. Good value for the money.", "type": "review", "business_id": "f0NbIT50Kqqfh9b7T2Zo5Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VueUF8zrJwAt4ZToeHqdWw", "review_id": "IjFFkYFRXEljQ1-oTYyn0A", "stars": 2, "date": "2012-05-06", "text": "Call me old fashioned but when I order a pasta dish with something it in, I expect more than a trace. Such was the case with the pasta and smoked salmon dish. The such was good but the salmon was nearly invisible and the peas were missing.\nMy friend enjoyed her veggies lasagna and said it was delicious but I noted that it was brined around the edges. My other friend asked for a piece of salmon with her salad and it was over cooked and dry. For the total cost I was disappointed. Service was great but getting old looking match sticks of veggies in the salad plate and being skimpy with the pasta ingredients is inexcusable considering the price. No dish should ever come to the table overlooked or burned.", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "1tRhFdJgkcVtLg2lpMlN_Q", "review_id": "Y3NsLOjiECc0h2AnuuMRCw", "stars": 4, "date": "2012-06-02", "text": "Pretzels, pretzels, pretzels!!!! They are fantastic here. The mustard sauce that comes with them is especially good. The burgers are also good, as is the Thai shrimp wrap. I'm not a beer connoisseur, so I can't speak to their brewing prowess. But, they have a serviceable wine list.\n\nAlso, Monday night trivia is very fun here.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YnsEIg7M93fmYBfjbeP8GQ", "review_id": "1Cr7EtPHMpAZ5IbMOE6Vwg", "stars": 1, "date": "2010-07-22", "text": "Umm. I have no idea how this place is related to Lee Lin (a 5 * in my book). Food looked aweful and was barely edible. And for $30 for 2 people it's a complete rip off.", "type": "review", "business_id": "3uUfb4kLIGC4Vn2ztUxrJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MoTcMUoiq1woloAFSPt4Zw", "review_id": "vCSW9ad0HDhPITGstkbW-g", "stars": 3, "date": "2012-03-23", "text": "Portions are large and prices are fair. My favorite slice is the cheesesteak pizza, lots of tasty meat and onions.", "type": "review", "business_id": "y0J2PrJh2LIDHHtT6DzkJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kin2sO4sZvIpW_hqQ3wDtg", "review_id": "4eDyKPOPfW2Qx39-qUlc7w", "stars": 4, "date": "2012-04-28", "text": "my bf get my a gift card for 90 min massage here and i went there this morning. i feel soo relax from daily research. ya i m a super nerdy phd!\n\nthe room is super small which surprise but the lady is pretty nice and i enjoyed it a lot! i am looking forward to come back. \n\nit is kind of my first massage experience in the US and i 'd like try other places.", "type": "review", "business_id": "38GVFKqsaX1RjJGWpjVpqQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hdx7fR_YOV74bjCGkA8hEg", "review_id": "uaMForsMKqJoiKPGut_5uQ", "stars": 1, "date": "2011-10-04", "text": "Terrible service.  I ordered two gyros for take-out today.  I arrived and he said they only prepared one for me.  He said that he would make another one (without apologizing) and that it would take ten minutes.  I needed to get to work, so I was short on time.  About five minutes later, I asked how long it would be and he said ten minutes again.  I told him that I was in a rush and I would not be able to purchase them still.  He said 'So you're canceling?' and walked away.", "type": "review", "business_id": "hluBhGYt7BOKhCP4M0qDDQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "CqOAc1CD3BzFivECpGBxrw", "review_id": "Gpfly5vROc49siTFxozfhA", "stars": 1, "date": "2011-11-23", "text": "Pre-ordered our Thanksgiving meal on Sunday.  Called early today to confirm our order.  My husband just went to pick it up, and they are \"out\" of gravy......How the hell does that happen?  And for such an essential part of a holiday meal?  Apparently we have a different interpretation of the word \"order\" than the Fresh Market does. For us, \"order\" means, \"set aside for our exclusive purchase,\" not, \"hey dude, if we happen to have it around, you can like, totally buy it.\" Not acceptable.  Mind blown.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "57afbu27Kwm2CgQN8B7tfQ", "review_id": "nlVkGXxv8DxUdJ4D1HzRtQ", "stars": 4, "date": "2012-02-19", "text": "Great service. Great food options. Adequate seating. Closes in the afternoon (boo!).", "type": "review", "business_id": "AZqsal3nzTkwQqxUol_UjA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KKvXggjiP59lQIkM3a5Bbg", "review_id": "W0_zOEYVIahpXzzOxdbQoA", "stars": 5, "date": "2012-07-11", "text": "Been here a bunch of times and I have never been disappointed.", "type": "review", "business_id": "4VdGntX6dKc-xQ_nFlpdVQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MHenhwRTCOIFK3CC68OL0Q", "review_id": "hbDL2PgayagodlUw8YQbNg", "stars": 1, "date": "2008-07-18", "text": "My husband and I were married on a Saturday afternoon and were looking for a \"post-wedding\" hangout for our friends and family. My husband's family went here on the suggestion of our hotel and were settled in upstairs when we arrived with a few friends.\n\nWhen we asked if we could sit with our family upstairs, we were told that \"service was closed\" on the top floor. We explained politely that we knew our family was up there, as we had just spoken with them.\n\nThe hostess (middle-aged, curly hair, black dress) got very snippy with us and looked aghast that we would even SUGGEST that there were people being seated up there. \"I don't know what you're talking about, it's not my problem\". We even tried explaining that we were just married and wanted to see our family. No-go, we weren't allowed up.\n\nFine, we said we could then sit downstairs on our own, which was EMPTY. There were 8 of us, and they could have easily put two tables together to accommodate us. Apparently, that was too difficult, so we left and went down the street to the Irish-Mexican place that was great and very friendly.\n\nAs a girl from upstate New York hosting visitors from Long Island and New York City, I was hoping that I could show them some \"Upstate hospitality\", and not be treated snootily with such scorn. Sadly, Browns Brewing could not provide this.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "szWXrX1aWox8AI-xbBnGMw", "review_id": "3k2PY-kfTQMLqTxNCehvTQ", "stars": 5, "date": "2011-02-23", "text": "Our family stopped by on our way home from skiing in Vermont. It was a great little side trip and while it didn't take very long to get there once off the beaten path (about 5 minutes) I was sure glad we had a GPS to help us get there.  The seating is very limited but luckily we got there and all the tables were open, but the advice of reserving a seat is probably a good one.\n\nWe had the pizza which was very good, but since I saw that they made their own sausage prominently displayed in the window, I made sure that I got a side dish of that as well. This is quite simply some of the best sweet Italian sausage that I have ever had. I was really glad that they had a grocery right next door so I could take some home. \n\nThe pizza was very good and the sauce was fantastic and you can tell that they use very fresh ingredients. My only beef is one of personal tastes, as I prefer a thin crust and their pizzas are more on the medium thickness range. \n\nThe owner and his son were both very friendly to me and my family and made us feel welcome.", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 0, "useful": 3, "cool": 4}, "user_id": "1IPak6pw80RX853Fsj4FAg", "review_id": "PxgU8pUrEmIZ-UZnl8EaPg", "stars": 4, "date": "2011-02-27", "text": "I came here last night with my husband and some friends from work who raved about this place.  They were not joking, this pizza is awesome.  What I like the most is that you can substitute any of their pizzas with whole wheat crust.  I would highly recommend spending the extra dollar or two to do so.  The whole wheat crust adds a nice heartiness to the pizza, and hey, it's healthier!\n\nWe shared the puttanesca pizza, but we substituted pesto for the tomato sauce.  We also got the chicken and red roasted peppers pizza, and added some goat cheese to the top. Both pizzas were amazing.  And again, the whole wheat crust is so hearty that I felt like I was going to burst after having two slices.\n\nOh, and it's BYOB, so feel free to sit back with a glass of wine while enjoying this amazing pizza.  I'll be back!", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "vOMSNQLv0uJ9JlGE-IPi-g", "review_id": "usYGTWdoUKdRCfiVhED2Xg", "stars": 5, "date": "2011-06-04", "text": "I'm going to give it a 5 but say it s more of a 4.5 (I'm feeling generous and the bar tender did put the Yankees game on for us). \n\nThe decor is of the variety of two wrongs make a right. Its dark and has all sorts of weird signage which makes it seem like its going for a dive feel, but then it has these cute little light fixtures and adorable CLEAN bathrooms with vintage magazine ad wall paper and a chalk board with an inspirational message, which say I'm a friendly neighborhood bar. But then they have 25 cent skee ball and I think I saw a Foosball table in one of the back rooms, which made me think is this \"Dave & Busters\". (ya see the place has a large L shaped main room with a raised platform and then 3 or 4 little rooms off the bottom part of the \"L\" for games like Ms. Pacman, Skeeball, and darts. I now know what to do on weekends when I'm bored: get a roll of quarters and work on mastering skee ball. \n\nMy friend and I were actually drinking wine at FM's (we started with dinner around the corner and decided not to risk mixing). The wine was $5 a glass, CHEAP, but not cheap wine. I didn't see the label of what they were pouring (and by pouring I mean filling the glass to the brim) but it wasn't Yellow Tail or Little Penguin which seem to be the main labels I find in non-wine bars. \n\nThe crowd was a little younger (than me). Mostly in their mid-twenties, so I felt a little old. It was a mix of RPI dorks, Sage girls, and a few dudes wearing MMA shirts. Nothing hostile or uninviting and even thought I felt like an old lady, I'll be back.", "type": "review", "business_id": "R5tjtiq1YeSAS4MZmjNnWw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "c3uMuPGDLLLB2qUtptlv8w", "review_id": "4WoyTIAI_uRe_eqrJMD1kQ", "stars": 5, "date": "2011-08-06", "text": "Loved the soft ice cream here!  I love going to drive-ins!  In Florida we do not have drive-ins like these.  The service was a little slow but i didn't mind because it was nice outside.  Have not had the food but I can say the ice cream was yummy!", "type": "review", "business_id": "45iw_QhKunotF2o6RTBEqg"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "YnsEIg7M93fmYBfjbeP8GQ", "review_id": "_IwhWwbXafL-kTQOAJPt3w", "stars": 4, "date": "2010-09-07", "text": "Please don't come here.  I want to keep it a secret.....", "type": "review", "business_id": "R5tjtiq1YeSAS4MZmjNnWw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3SX5W86Fhv5kQW_eoYMpng", "review_id": "oV733sD3pG8F5RuU8Iq2Yg", "stars": 5, "date": "2010-09-01", "text": "5 staars because as it says, this is about as good as your going to get around here. Yes Cordonas is unbeatable but thats more itialian specialty, this is the closest thing we will probably ever see to a whole foods in this area. Down to the products, the crab dip is top notch, breads all nice and fresh, filet is actually good for supermarket standards. Cheese is a little pricey but well worth it if your a cheese head. Deserts are well priced and great. Fruits and flowers both very fresh. Somewhat of a suprise, the pre packaged sushi is actually pretty fresh. That's covers everything I have bought from here so far, will update Im sure.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "Vw02Rut7665Sge3ea7yV5w", "review_id": "-3oSnB0Ps7JzBIHWcmthGQ", "stars": 2, "date": "2011-06-24", "text": "Anyone who knows me knows I like my BBQ. So when I heard about Mustang in my new hometown, I had to try it out. I headed over there and the space is quite large, well kept, with lots of seating. Mustang's sign outside broadcasts BBQ and Fried Chicken. Now, they were already up against a powerhouse in Pig Pit BBQ just down the road, which I LOVE. But the fried chicken got me interested. I went in and ordered and half rack meal with sweet potato fries and corn bread, and two pieces of chicken; a breast and a leg. I got all this to go but made a point to try the fries as soon as I got out to my vehicle as the trip can sometimes make them soggy. I was sorely disappointed that the wide cut fries were not crisp, nor taste terribly fresh. I got home and set down to work...er, eat. I started right into the leg of fried chicken. It was good, but I was hoping for something that stood out. I'd rather go to Kennedy's or even Popeye's (yes, I said it) until I find someplace that knows how to do real fried chicken. Then came the ribs. This were pork baby backs and I thought them to be too saucy and too over cooked. the meat did fall off the bone, but I want a rib where the sauce is the icing on the cake, not the putty on the car. They do have plenty of sandwiches on the menu, and I may well go back to try a couple of other things on their menu, but they are going to have a hard time luring me from Pit Pit a second time.", "type": "review", "business_id": "Idx8xKpOpz7llQS_5qSBbA"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "vetI1F4btXdQAe5G2A2ciA", "review_id": "OuIB478G-nsa_OPg1Bk7iA", "stars": 4, "date": "2005-08-23", "text": "Went here on a Sunday with some friends for a game of mini-golf. It's your typical well-landscaped course design, with a miniature mountain. Some holes of note are the one with three levels (hint: hit the ball into the middle hole on the top level and it will come rocketing out at the bottom level, skipping the second level entirely) and one with you have to hit the ball into a stream, which throws it onto another green. 19 holes altogether for $6.00. Good deal. Some holes are in the woods, so there's a lot of shade to relax in. And even on a Sunday afternoon, there was hardly anyone around to catch up behind us. They also have bumper boats, but those always have standing water in them, and you'll probably get typhoid fever if you sit in it.", "type": "review", "business_id": "hdV5ZSDO1otDVMLJoTXrfQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hN3mhLfIwWCRUVjehy8Exg", "review_id": "YLKyoEcI1EHw0JV8NFR5nQ", "stars": 5, "date": "2011-08-01", "text": "We just went for the first time on Sunday afternoon and it was GREAT!!! Reasonable family fun; my 3 1/2 year old daughter loves the rides that you would see at the fair or on the boardwalk and this place has all of them (for a reasonable price).  The place is clean and friendly and I can't wait to go back.", "type": "review", "business_id": "VcuMtj_cGyjaa_O1E2xMIA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VRhik5aD2TsJDLJtoYldhA", "review_id": "F9PkszbSsrGr2o2pMDCNjA", "stars": 5, "date": "2011-06-23", "text": "the best indian food in the US ( I grew up in the SFO bay area , spent time in CT/NY and lived a while in India too ) !!!!", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "F3trnEVjMO64sD_No-cYvQ", "review_id": "hAtkq2tzuNn-s5evS_xTjw", "stars": 4, "date": "2009-01-26", "text": "I went to brown's Taproom with my girlfriend last night and it was one of the best experiences I have had a restaurant in a while. What really stuck out were the wings. Our waitress helped us decide on what kind we should get and she suggested the BBQ that are kind of a fruit sounding sauce, the wings are dipped in mild sauce first. Wow! is all I can say. They were so good, probably the best wings I've ever had including my own and I consider my own wings to be top notch. They had great beer, not extraordinary but very good. The burgers were great and the staff was excellent. I left a hefty tip in kind but to be honest we wanted to kiss the waitress for the wings they were so good. Excellent meal I will be going back this week before I head back to Iraq. That's a meal I want to remember.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "1KJFhUFt3xabVdZc1InxDQ", "review_id": "3pJ6-dmh9ldN2dcIO8MDEw", "stars": 4, "date": "2007-03-06", "text": "I have never eaten a thing at Browns Brewing Company but I gave it four stars anyway for one reason, the Whiskey Porter.  Oh my god this is one of the most delicious beers I have ever had.  Its dark, rich and strong... REAL strong.\n\nThe menu sounds kind of good and they have a few vegan options so one of these days I might go back and eat something.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_oF29z-f80aus3sBX7XZmQ", "review_id": "ZGXsW1X4W7jPjDR8MzLFqQ", "stars": 4, "date": "2010-05-20", "text": "This place is great and the staff is excellent.  Chatted with my friend and me about Midwestern breweries and gave us an honest assessment of local capital district brews.  They even have a few beers on tap which he let us try.  The only hang up was that I was looking for a sour flemish ale or something similar and they didn't have anything, but they do have a nice selection of European beers otherwise.", "type": "review", "business_id": "02AT15PDQTbiSoiXtNgMDg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xewaLj90EFPRyeg0uSgrMA", "review_id": "UkKTYykIkBcBVvZ1bNlrZQ", "stars": 2, "date": "2012-02-18", "text": "Based on the many great reviews of this restaurant my wife, son and I ventured across the Husdon to check it out.  Our experience was mixed.  We started with crab cakes and the soup special (red lentil).  The soup was excellent but the crab cakes were inconsistent.  The crab cakes were presented with a nice sauce, but one of the two cakes was significantly less crispy (under done) than the second one.  Next up were good salads with a nice house dressing.  For our main meal, I had the special that featured seafood ravioli.  My meal was excellent.  My wife had the scallop dish which was well prepared, but had a slight \"fishy\" taste.  Not the hallmark of excellent shellfish.  My son had the kid's cheeseburger.  The server didn't ask how he had wanted the burger and I guess the default was very well done.  Our server mentioned pita would be on the way, but it didn't show up until much later in the meal after we asked about it.  All in all an ok meal, but I can't imagine making the 1/2 hour drive anytime soon.", "type": "review", "business_id": "hluBhGYt7BOKhCP4M0qDDQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "vOMSNQLv0uJ9JlGE-IPi-g", "review_id": "ImhMUNtjMzP4JCCSSWXbPw", "stars": 3, "date": "2012-10-08", "text": "$35 for a french pedicure.  It was okay.  The massage chair was nice but had a mind of its own.  I didn't really chat much with the fella doing my pedicure, but he seemed really focused.  He spent a lot of time making sure the white lines were even on both feet.  All in all it was a satisfactory job and I'd go back for a quick pedicure again (but not a pampering pedicure).  \n\nApparently this is the go to place for lots of Troy High girls.", "type": "review", "business_id": "yEq4WDMn6dLyGTbLkw2HZA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6kMHm5j3rwuc2zLqDyMtpA", "review_id": "GPmX99rlpkfDUL4hx3GQuw", "stars": 4, "date": "2011-12-03", "text": "Great Food!  Great Prices!  Best Pan Fried Dumplings I have ever eaten", "type": "review", "business_id": "2ubKfUIPF_mWcF5k8KLs-Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "ZEywVDEDc6NROqsIzC-v3g", "stars": 5, "date": "2009-11-13", "text": "Sadly, this place closed over the summer of 2009. RIP porky goodness.", "type": "review", "business_id": "kXdh23ZRCrwpQyMT_Ok09w"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "DkciH3HAjs_aDp_qBDcC6g", "stars": 3, "date": "2010-11-17", "text": "Java ++ is more like 2 stars, but I'll bump them up a star for the deliciously free wifi.\n\nThe coffees are coffee shop priced (on the expensive side for anything that's not just a regular cup of joe). The food's overpriced and nothing to write home about or get excited over. \n\nPros are that there are lots of outlets to plug your laptop into, and they take credit cards. Service is pretty friendly if a little chatty at times.\n\nCons are that it's not really that quiet. There's a large TV in the store, and when people turn it up it can get loud. Bring headphones and it's not that big of a problem, just an annoyance if you're doing something that requires concentration. This is more of a socializing place than a studying kind of place.\n\nI'm bummed they're only open until about 7 pm most nights, though! I thought since they were by RPI they'd be open late, but for me 7 pm is an early closing time. If I want a later coffee shop to hit up in Troy, it's Flavor's downtown, unfortch. Because of this, I probably won't be back just because I'm only there for about 45 minutes before it's time to head out. Not much of an incentive to choose this over a library or just staying at home for me.", "type": "review", "business_id": "s4IKGtwCOFf65FXER7p2Hg"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "VKNIr0wf6u5526MjlE99tw", "review_id": "QRBoaS5-WOvH6sEKIsXEtg", "stars": 2, "date": "2008-10-04", "text": "I had gotten a gift certificate here for Christmas but never used it until tonight.\n\nI had the pan bronzed halibut, which was nicely cooked. It was served with a small portion of fava beans and some lobster risotto, along with a few \"frizzled\" grape tomatoes (they tasted poached to me.) The risotto was tasty if a bit salty, and only one chunk of lobster meat. I wish there'd been a few more fava beans and tomatoes. Why are high end restaurants so skimpy on the veggies? I love vegetables so come on, stop being so stingy. It was a good dish, but not great, and the portion was on the small side. I forgotten what the sauce was, as it was very light and barely noticeable. That dish was 32 dollars.\n\nMy boy wasn't into his delmonico buffalo ribeye steak with roquefort mashed potatoes, grilled veggies and Newcastle beer-battered onion rings. In fact, he didn't like any of it. He says the potatoes were bland, the meat was grisly and the onion rings were flavorless. \n\nThe service however, was really great and they took that dinner off our bill without asking. I had the basmati rice pudding for dessert, which was very tasty and was more like a thick custard than a pudding. Did I mention the service was great and very professional? There was also a live pianist, making for a nice touch. \n\nThe decor's nice for the most part, sort of upscale Mediterranean-style. \nI might give it another shot, but would avoid the buffalo special next time. My main issue is that for the prices here - at a restaurant in downtown Troy - I think the food should have been much better than it was... my halibut dish wasn't bad, but for $38, I think it should have been much better. I was also pretty hungry soon after and had to eat something soon after. My boy's dish was $42, and as described before, it was pretty disappointing.\n\nI'm giving it two stars because the ambiance and service were so good, even if the food was grossly underwhelming.", "type": "review", "business_id": "-4wyQhCgMdR4LE-Dd1YH_g"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "IvjmctqL3ckGub0yviLJog", "review_id": "mMZ-fvFgpxuBZu0x-X9zLw", "stars": 5, "date": "2010-07-03", "text": "I would absolutely recommend the Franklin Plaza to anyone looking to make their special occasion PERFECT. When my husband and I were looking for wedding venues in the Capital District, we were referred to The Franklin Plaza by a relative who had recently been to someone else's wedding there. He boasted about the food and how pretty the reception room was, so we decided to check it out (knowing that we had basically decided on another venue already). \n\nSince we live in NYC, we made a quick call to see if there was a way we would be able to come see the space that weekend. We spoke with Joe, who came in for a special appointment on a Sunday morning with us. We were floored the second we walked into the space. An old federal savings bank, this place has the rich history and grandeur you would imagine, but with a charm and beauty that look my breath away. Joe was incredible - walking us through every detail of the way the ceremony would be set up, the HOUR-AND-A-HALF cocktail hour upstairs with 15 passed hors d'oeuvres, 4 stationary tables, and open bar, and then the reception downstairs with a four-course dinner, including dessert course and more open bar. And, their hotel is right across the street - none of our guests would have to drive anywhere. We were sold. Especially when we found out that they were actually cheaper than some of the other places we had been looking at previously. \n\nOur wedding day was PERFECTION. I work as an event planner, so I am used to managing every detail of event days myself. The folks at the Franklin Plaza took care of absolutely everything. There was never a question in my mind that our wedding would be anything less than exquisite. The head waiters and site managers were incredible, and we had everything we needed taken care of for us all night. I didn't have to lift a finger. The food was incredible. You could really tell that Michael's catering (through the Franklin Plaza) was truly a chef and caterer, not just your run-of-the-mill event venue cranking out the typical steak, chicken, fish. They did every single meal to order, served every one of my 180 guests in record time, and kept everyone happy - and FULL - all night long. \n\nThere is honestly not a bad thing I could possibly say about this venue. I would suggest that anyone looking for a terrific venue for their wedding, bar Mitzi, anniversary party, ANYTHING visit the Franklin Plaza. If you ever get an invitation for an event at the Franklin Plaza, go! Even if you don't even like the person inviting you. Go anyway to check out this incredible place and have an amazing experience like I had. It's that good.", "type": "review", "business_id": "YVDfVKznxZpDDkk_Lor-1w"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "susQSdboEprornwLzHSvVA", "stars": 2, "date": "2009-04-16", "text": "I like this place for the cute retro-vibe of the cooks and staff wearing  whites. It's a little shack type place where you walk up, order, and receive your food shortly afterward. \n\nAfter hearing all of this buzz about Jack's, I decided to give it a whirl. \n\nOn the whole, the food was just not there. The burger didn't really have much flavor - it was just a thin patty cooked well with some onions on top. I didn't think it was too greasy, though.\nThe fries were soggy and I think they could have used longer in the fryer to crisp them up a bit. A bit undercooked, perhaps?\nI took a bite or two, but ended up not eating the food for the most part - nothing particularly off putting, but nothing really making me want to go back for more.", "type": "review", "business_id": "Yjm7Lw8_PLPBRwDlaCHvsQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kAuD_yPTZnoPSMQnyIiueg", "review_id": "JCBU3soBRSETXXjCM7yZdw", "stars": 4, "date": "2012-04-01", "text": "Stayed on 3/31/12. The room was clean and neat. Didn't see any trash out back in the parking area, and the breakfast was fine. All in all it's everything you would expect from a mid-level motel. Nothing outstanding, just a decent quiet place to spend the night then grab a little breakfast before heading out the next day. We would stay again.", "type": "review", "business_id": "hYLmZXLQP2xOSaopGVzyKw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w0hOaaJbfYiqHhktS9CLjg", "review_id": "jHJrY248K-jtxO2QM_aQGA", "stars": 4, "date": "2010-01-17", "text": "A very nice old-fashioned diner. Portions are large, if you care. The food is good and very greasy spoony in a comfort food kind of way. A quiet local crowd mornings and a raucous college crowd late at night.", "type": "review", "business_id": "VIeqbFdw0gm_hwoL_2NXTg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0v5-uXAd5-vVSTSq24yJ8A", "review_id": "PtGge-4yY5vaoIoK8kBK-A", "stars": 4, "date": "2011-10-16", "text": "Very very good South Indian food. Not the absolute best I've eaten but pretty close. Lively but polite service. They can be very busy on the weekends so it's best to make a reservation. We had a reservation and were half an hour late, yet they held the table for us and received us with a smile. Only real negative (minor one albeit) was the restroom could have been better. \nWould definitely visit again.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "62xleOvA8A9Zba9RSTA8KQ", "review_id": "xQUiEl4K2fcdMkjuvLEI-Q", "stars": 3, "date": "2010-11-28", "text": "Good local place to have a no frills dinner. Pizza is good. wings are alright. If you order hot, make sure you like em hot. They are usually drenched in sauce. Sauce is good on all the italian dishes. And they have amazing Italian dressing. I was really disappointed in the cheesecake tho. I asked for cherries and they put marachino cherries on. Its a good thing for them I got it to go, because I took one bite and had to throw it out. It just tasted old and freezer burnt. Hopefully next time I'll have a better experience, as I usually love the place.", "type": "review", "business_id": "7H9wF_UHLgWPpRCKu8TlJg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bg7TpjkkHhsahIUMbgeBDA", "review_id": "26bjsYMVNvpVdLRmuN2M-g", "stars": 5, "date": "2012-07-31", "text": "Wow! So glad I went here. VERY good ice cream, unique flavors, lots of cone options. Very patiently allow you to try samples of flavors. I only wish I could try them all in one sitting!", "type": "review", "business_id": "CPkUO2F9VENCaLXf4zj5UA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "jDKYDTgt27iyHvGBp9slkw", "review_id": "8mg3yfqC_33wJ883nuA7EQ", "stars": 5, "date": "2010-04-09", "text": "we miss defazio's!   true,  the atmosphere isn't much, but after discovering defazio's chicken fra diavolo, we were addicted.  for years it was our regular pizza fix.   we had to move away from the area in 2000, and have since lived in other parts of new york and in four other states.  but we still talk about defazio's!  it's the best pizza we've had and we've tried dozens of other places.  just know how lucky you are if you live near by...  some day we'll come back to the area for a visit and defazio's will be our first stop.", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dbqwzNAIseUSYnmusg-D5A", "review_id": "xDVqIJreQpPpqZruSiGwxA", "stars": 4, "date": "2011-09-06", "text": "My wife and I were discussing all of our friends weddings we had attended in the past couple of years.\n\nOutside of our own (duh), our absolute favorite was held at Franklin Plaza. The inside is comfy and pretty if not a shade dated. The food was somewhere between decent and excellent depending on the item. The staff were super nice and helpful. The inside setup for the ceremony was beautifully done.\n\nOverall I would definitely recommend this as a potential location for anyone looking to get married in the area.", "type": "review", "business_id": "YVDfVKznxZpDDkk_Lor-1w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DxkImzkyTK5EpXXsO_4vZQ", "review_id": "pGUbuUuuUoI-8DwToqSZZw", "stars": 5, "date": "2010-07-05", "text": "Not your grandpa's deli! \nI love it as a deli, bakery, middle-eastern/Israeli and an Eastern European deli. Great selection of salads, smoked meats and fish, baked goods - check out the unique Hungarian dessert. Sandwiches are huge, I always take half of it home. Much better ambiance than Gershon;s in Schenectady, quieter, lighter, airier. Interesting selection of of dry mixes (rice, pasta_ to take home. Great breads too.", "type": "review", "business_id": "iOYrrlk8yOelEaXDsbJIVQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "GwlrUwkULm4ZLN-Kum5nag", "review_id": "m5YL7Pwo10z4g6m23Rugjw", "stars": 4, "date": "2008-06-24", "text": "The Purple Pub is an institution and is always very busy when I've been here for dinner and team pizza parties, as a kid. The pizza is very good and the prices are reasonable. However, the place is very crowded and noisy and the parking lot can get full. The last time my group tried to eat here, we had to wait over an hour for a table and we ended up hanging out in the bar instead.", "type": "review", "business_id": "7H9wF_UHLgWPpRCKu8TlJg"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "2yGL0e3rV-Ip4U670JNO8g", "review_id": "d1a2jaRJbnOQ2biXHuZpBA", "stars": 5, "date": "2010-03-01", "text": "I first read about Karavalli a few years ago when they were reviewed in a local paper.  We had just moved from the San Francisco Bay Area to Albany, NY and was desperate to find \"ethnic\" cuisines that we were so used to finding in the San Francisco metro area.  I poured over the local dining guides in search of something else than \"pizza\", meat and potatoes, pasta, and typical Mall fare (well, you get the idea) -- and fortunately, found the review on Karavalli.  \n\nWe visited Karavalli in Latham 6 months after they had just opened.  We met with their Chef/Owner since he had plenty of time to talk to people because his restaurant was just \"new\" and they were still in search of customers.  We have returned many times since and the Chef/Owner would always stop by our table to say \"hello\".  We appreciated those small gestures and have returned the favor by giving him more business.  \n\nFast forward several years later, we have returned to the San Francisco Bay Area and I felt a fair review of Karavalli was in the works.  Honestly, I give it 5-stars.  The food is good, well made, no compromising of taste, and practically consistent.  If a dish is supposed to be \"spicy\" then so be it because that's the way it's supposed to be.  Anything less is like asking McDonald's to go vegetarian or Starbucks to use Folgers.  \n\nWe love their buffet lunch.  Not a lot of choices compared to Indian restaurants in Silicon Valley where they have huge vats of stuff and over 20 choices, but what you get at Karavalli is what they do best -- offer you delicious Indian cuisine.  No more, no less.  \n\nIf we are in the Albany area again, we will certainly stop by Karavalli to have authentic South Indian cuisine.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1mtXXF8yoAR9nTM6LG0HNQ", "review_id": "3Sm_f9x2jDsCkC-U9zGPIA", "stars": 5, "date": "2012-10-09", "text": "So far, the best pierogis and golumpkies  in the area.  Great flavor and well made. They're as good as mine!", "type": "review", "business_id": "aoGjCDs2-_-pejJmv4Ss7Q"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "AS2bAG-npVEnH0_6WBtgow", "review_id": "OSfmKqBnKXJJJUkPKHtU1Q", "stars": 4, "date": "2011-09-17", "text": "Owner/chef Marla had the food quality nailed from the moment she opened her doors -- front of house? Not so much. Through most of her first year of operation, lets just say service was homey and extremely casual.\n\nDon't know what happened, but recently, her waitstaff turned over almost 100%, and the new team is much faster, more efficient, and on the ball. Perhaps still not a match for the amazing standards Marla sets in the kitchen, but a huge improvement nevertheless.\n\nI give the Illium extra points for savvy ingredient purchasing that lets them keep the prices lower than you would expect for such good food.\n\nDon't miss this place - it's a treasure.", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Bchgh1l6l_qRiRc1M5eIHw", "review_id": "RE3zhBCQrQUahhfx3acAew", "stars": 3, "date": "2011-03-07", "text": "My parents drag me here every time I come home for a visit.  They call it \"their place.\" (Cute, but kind of lame).\n\nTheir beer deserves 5 stars, with the stouts and pale ales being the best.\n\nThe menu sometimes makes me laugh and I still have yet to have a satisfying meal here.  The bar food is obviously good, but order anything else from the rest of the menu and it's pretty hit or miss.  And for some dang reason, I'm always in the mood for fish when I come, and I stupidly order fish thinking \"oh, maybe this time it will be good.\" It never is. The worst menu item of all is the bbq pork chops.  Thin slices of pork with a stingy portion of bbq sauce.  Probably one of the worst meals I've ever had, ever.\n\nThe one thing the entrees have going for them is the red cabbage side dish.  \n\nLong story short, this is clearly a pub.  If you just stick with ordering from the appetizers menu or anything else that can be labled as \"pub food\" (i.e, anything that comes fried or in sandwich form) you won't be disappointed.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "zh8yKWN_3LdNvH7Ir5xO6Q", "review_id": "JlQCfczCabhmHTZJPGE4Hw", "stars": 5, "date": "2007-12-25", "text": "Stewart's has the best ice cream by far. However, and I usually don't like cake, but nothing beats Carvel. Nothing.\n\nThe way they do the vanilla/chocolate crumbs/chocolate is tried and true, and I used to eat entire cakes by myself when I was little. This store is mostly take out of course, it's blank white with a Shaker or Siena student working the register.\n\nTake your pick: there's cakes of all sizes lined up for your liking, and I remember I got one for my dad's birthday and just put, \"You're getting older\". What an asshole I was haha.\n\nThe chocolate crumb-y middle of the cake is definitely worth it, it's the munch to the soft ice cream surrounding and brings me back so well. And it's cheap too. When you scarf down an entire small cake for like 8 bucks, I say it's worth it.\n\nThis particular location is 5 minutes away from me in Loudonville when I'm home for the holidays and such. Newton Plaza really does have it all.", "type": "review", "business_id": "etnsoP9A55sKckLtC1MMLA"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "fTNJ8Nu-mMz3FXi-CPqLYA", "review_id": "rjbTgV3vOJDnycjzlO8U4A", "stars": 2, "date": "2012-03-16", "text": "The beer at Brown's is as good as ever, but since they changed chefs a few months ago the food is terrible and overpriced. I've been to Brown's several times since the new chef, and the food is consistently bad. As an example, last night I went with a few others and we got the nachos to share: a middling-sized plate of tri-color chips with cheap nacho cheese sauce, olive slices, a few jalapeno slices, a few chunks of mushy tomato, salsa and sour cream. Those nachos cost $12.49. Absurd.\nI love Brown's beer, and that's the only reason they get two stars. For the food, I award them no points, and may God have mercy on their souls.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "GwlrUwkULm4ZLN-Kum5nag", "review_id": "BIczLALCzZSgUWOVHfDGww", "stars": 4, "date": "2011-05-30", "text": "Welcome to Moe's!\n\nJava ++ is being converted into a Moe's Southwest Grill (open to the public) and should be open by August 2011.", "type": "review", "business_id": "s4IKGtwCOFf65FXER7p2Hg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "62xleOvA8A9Zba9RSTA8KQ", "review_id": "O_IQLnbo_bINXAtdMsiEsg", "stars": 3, "date": "2012-07-21", "text": "Stopped in for a sundae. The prices are very reasonable and the portions are alot more manageable then other ice cream stands where you end up throwing away half of it. The soft serve is creamy and they have hot caramel. (Although I didn't care for it.) Tasted burnt to me. \n\nCASH ONLY", "type": "review", "business_id": "45iw_QhKunotF2o6RTBEqg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NEVI5zuXTfGi2VP3krtJvQ", "review_id": "HstsmKT4GPPh0Td4SA5MuA", "stars": 5, "date": "2012-06-13", "text": "DeFazio's is hands-down the best pizza in the capital region. I have yet to find a place with the quality, atmosphere, and friendly attitude. It's a true Italian establishment where you really are \"treated like family\".\n\nEvery pizza, regardless of the preparation and topping choices, is created with quality and technique that is unmatched at any other Italian eatery you'll find nearby. The vegetables are fresh, the meats are tasty, and the sauce is perfection. Any pie is more expensive than it would be at an average pizza joint, but if quality and taste is what you seek, fork over the extra $7 and pick up any of their delicious options. \n\nI have seen two reviews dissing the crust. Apparently, some people don't find it crispy enough. I have never felt like the crust wasn't to my liking and/or a single slice felt soggy, but maybe that's just my opinion. \n\nBesides pizza, their other options are also amazing. Calzones are equally delicious (and are huge, by the way). Salads are fantastic. I recommend any of their appetizers, especially if you're dining in for pizza as the main course. Each of their pies is treated like a work of art, and therefore take a little while to come out. Sidenote: if you're ordering pizza from here for delivery, be prepared for it to take a while, for the same reason. \n\nStaff is super friendly and accommodating, but the restaurant is not huge. I usually get takeout or delivery, but if it's not a busy night, dining in is also an excellent option. Reservations are welcomed. Overall, a great place, and fantastic pizza in Troy's Little Italy neighborhood.", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2rkf5UvfC-MpmwYHfyDmLA", "review_id": "GYe9jFrJcHRIC_1FLZzkyw", "stars": 4, "date": "2010-12-24", "text": "Really decent pizza, large pie's with great price.  Delivery always seems to be from 45min to a hour, so we usually pick-up from the location.  But it's the best pizza we've had in the neighborhood.", "type": "review", "business_id": "JhWgmJHXb4avC1-vkpkkYQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "0Sw9sDJy9beVwPX6EfOKeg", "review_id": "t4yMB1B7cyr6eaYCQgg47Q", "stars": 4, "date": "2012-10-01", "text": "Polish food right by RPI, it's perfect when the weather starts to get cold.  \n\nThe pierogis and stuffed cabbage are great, I wasn't too keen on the potato pancakes, a little soggy in my experience.  \n\nReasonable prices as well, a must go in the winter.  And the owners are so nice, it feels like home, and not just because it clearly once was one.", "type": "review", "business_id": "U_wLGkq86qyd8yzpKyFswg"}
{"votes": {"funny": 0, "useful": 0, "cool": 3}, "user_id": "xkmypny5H5-kFJR2LfbRcw", "review_id": "FAMYGmEE8xttJ-RXCzlrdw", "stars": 4, "date": "2010-01-07", "text": "Ok so I'm a grocery store junkie. I like going to a nice clean grocery store that has high quality prepared foods and a good variety of everything else.\n\nHannaford's is clean and well organized. The quality of their food is better than average. I don't know -- it's hard for me to explain it, but I just like being at Hannaford's. \n\nI don't know if all Hannafords have a Redbox but this one does.\n\nUnfortunately, the Albany area doesn't have a Whole Foods Market or Trader Joe's, but I think if I had to live here, I'd be okay because there's Hannaford's.", "type": "review", "business_id": "UZFBK4pU-VcEt1N4IoYCRA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "pWYdUrsN-hOg6Ad_rKQGIw", "review_id": "1eWCnb2DC1D2NzGf-y2LEQ", "stars": 5, "date": "2011-02-10", "text": "Wonderful atmosphere.big portions with no lack of taste. The croutons in the salad and creamy italian dressing of the best in the area", "type": "review", "business_id": "7H9wF_UHLgWPpRCKu8TlJg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AZjMJi1RirpPZp9xFDxY7g", "review_id": "2YD3rLWc0dp1HB6UI1rItw", "stars": 5, "date": "2010-12-02", "text": "Really above-average selection of antiques/beautiful old furniture.  Almost every piece is a keeper.  Don't miss the separate small room next to the main space (it also has a window on the street). If I bought a house, I would love to just order up the contents of this room to furnish it!  Beautiful tables, bowls, mirrors, dressers, chests...", "type": "review", "business_id": "zx1lLUvlRUN5nQlSj3HRDw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "YnsEIg7M93fmYBfjbeP8GQ", "review_id": "eJ2350CvfuDxHwAfSt9sgw", "stars": 5, "date": "2011-10-26", "text": "Pizza in Troy is a glorious thing.  Coming from the vapid void that is Albany, I was stoked to find out Troy has so many good pizza joints.  DeFazio's, Red Front, & I Love are the 3 biggest favs if you ask a Trojan.  Well, Dante's needs to be added to the vocabulary of everyone in the area.  Their crust reminds me of foccacia, its light & airy with a hint of its own seasoning.  Their sauce is the killer ingredient though.  Its got a kick, a little heat, almost like a fra diavolo.  The cheese isn't heaped on, which when you first see the pie and notice how much crust and sauce you can see is a little off putting, but believe me the combination of ingredients is amazing and makes me keep coming back at least once every week or so.  Don't even hesitate and give em a shot!", "type": "review", "business_id": "DfOtgLP1a-a8lQlIvYksDQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1IPak6pw80RX853Fsj4FAg", "review_id": "8DDXnJ-fUm7AGdLZIm8ggg", "stars": 3, "date": "2011-11-26", "text": "So, where's the dairy, Duncan?\n\nI came here with the first group of brave Lame Ass Monthly Breakfast tour attendees. I'd say our group was pretty much in accord in terms of our overall impression of Duncan's, so consider their reviews an addendum to mine.\n\nDuncan's is squeezed uncomfortably between being a diner and a greasy spoon. If they didn't have a good amount of staff, the lack of attention would have been understandable. But with so many people running around at any given time, I was surprised that my coffee cup was empty for as long as it was. But damn, they do have some good coffee. \n\nI initially thought Duncan's would be a great location to have a meetup with more than 4 people, but I was sadly mistaken. There appears to be one table that can comfortably seat more than 4 tucked away in a back corner. We ended up splitting into a group of 4 and 2 taking two tables next to each other. The general noise level made it hard for us to communicate, but we made due. \n\nI ordered the Spanish omelet, which was just ok. Nothing special.\n\nThe true test of a diner/greasy spoon, for me, is the hash browns. On that front, Duncan's gets a solid thumbs down. Seems as though they tossed the potatoes in a generous amount of lard but didn't give them enough time to get crispy, so they were just greasy, tasteless, and unpleasant. \n\nThe coffee is good enough to push them up to a 3. Maybe we'll have better luck coming back on a not so busy day with less people.", "type": "review", "business_id": "bdNTZyrd0-GT5vZ6uOhXsA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4WsCfPXkRy6lOZQeTbIAAQ", "review_id": "mYw8vuBbWCQ_5bxBLh52TA", "stars": 4, "date": "2011-01-22", "text": "I stayed here on a Wed. night and enjoyed my visit.   $67 on Hotwire--a fair value at $90 per night, but I wouldn't spend much more than that, particularly given that it's a good 20 minute drive from downtown Albany. The room was spacious, clean, and comfortable, and I also liked the fact that there was a pool and a free breakfast with lots of choices.  \n\nSuggestion--update the fitness center equipment.  I realize that a fitness center isn't necessary--but if you're going to have one, why not have it come with treadmills that aren't ancient and actual weights, not a tacky all-in-one gym?  Also--transport to Albany proper should be a bit cheaper--the $19 + tip shuttle is pretty expensive.  (I came here w/o a car).", "type": "review", "business_id": "hYLmZXLQP2xOSaopGVzyKw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "VBRzlfNWOQjrk0wqvkoHoQ", "review_id": "vQGO-HGVcEznB7oSCB-f9Q", "stars": 4, "date": "2009-01-17", "text": "Probably the classiest restaurant in Troy, however I like the food at River Street Cafe more.   Whenever my grandparents come to visit we always go here, and the food is very good.  Their halibut entree is really great and I love the lobster risotto that accompanies it.  I also really enjoy their calamari for an appetizer.\n\nThe place has a good atmosphere and it is really well decorated.  I would agree with the last poster that there is a little bit of attitude.  One thing I particularly hate is when they ask you what kind of water you want.  \"Sparkling, bottled, or wonderful Troy City water\".  That is more or less what they ask, and it makes me feel like a bum when I say \"City water\"  because I don't feel like paying for a bottle of flat water.\n\nThey often have someone playing the piano, which is really nice and great background music.  But once or twice they had a band (piano, trumpet, something else) and they were playing ridiculously loud.  We could not even have a conversation at normal volume.\n\nThey also have a Sunday brunch buffet, and it is really well done.  One of the better buffets I have ever been to.  Omellette and carving station, pastas, various meats dishes, etc.  Really great and the price is pretty reasonable (20 bucks??? I'm not quite sure).\n\nSo the food is great, but the slight attitude and annoyingly loud music keep it from getting 5 stars.", "type": "review", "business_id": "-4wyQhCgMdR4LE-Dd1YH_g"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "GwlrUwkULm4ZLN-Kum5nag", "review_id": "f6HfOwkljMq-YpoYdToo4g", "stars": 4, "date": "2010-08-18", "text": "The Fresh Market in Latham is now open! ! My folks and I went to check out the Grand Opening. The place was mobbed due to the newness and being the first store in NYS. I've also shopped at The Fresh Market at Hingham Shipyard, south of Boston, which is a very nice store. \n\nThe parking lot was full, so we had to park across the street. This market looks very nice. It's organized, bright and clean, not as big (sizewise) as the standard suburban supermarket chain (Hannaford & Price Chopper), but similar size as a typical Trader Joe's (which has good prices) and similar concept to the slightly larger Whole Foods Market. \n\nThere are several departments/sections including good selection of fresh produce, freshly prepared foods (sandwiches, entrees, sushi), gourmet salads, meats, deli, cheeses, dairy, seafood, bakery, coffee, snacks, nuts, organic & healthy groceries, flowers, frozen foods, and more. The products sold here tend to be on the pricey side. However, the bakery rocks! I picked up some Almond Croissants and Chocolate Croissants for only $1.29 each and muffins for only 60 cents (regular price $1.09), a great bargain compared to Au Bon Pain where I normally get my sweet treats at double the price. I tried out some free food samples throughout the store including some cheese and BBQ spare ribs cooked on the grill outside, which were dry rubbed, chewy, and salty tasting. \n\nWe will definitely be back to The Fresh Market in Latham since this is a fresh healthy alternative to the other markets in the area, which sell everything else including the inexpensive processed foods. I can also grab a tasty lunch too!", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kiuMLPyCDpzfVR5K0bmDcA", "review_id": "t0GxnuJ3hI1ljSE6iGQkZA", "stars": 5, "date": "2011-06-12", "text": "Amazing Indian, and Thai food!  It's as authentic as it gets!", "type": "review", "business_id": "sCPH5jyB8vYjA9tyaUEsGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AZjMJi1RirpPZp9xFDxY7g", "review_id": "tUd6dKEfrqF2sj0nu22C-w", "stars": 4, "date": "2010-12-16", "text": "If you're having an off-hours pet emergency, see their website above for hours.  They are only open something like 5pm to 8am on weekdays, and 24 hours on weekends.\n\nI don't have a lot to go on -- I only visited them once. It was in the middle of the night, and they were able to help my cat.  I left a happy customer.\n\nHmm... I'm getting an eerie feeling that I researched this place on Yelp before I took my cat there.  Now there's no reviews, at all, for it?  That seems odd.", "type": "review", "business_id": "uep4cDx7Kq3vJTOs2fmLaQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "TVbgXXG6xc78nDms7fUPRQ", "review_id": "jKSEXxV6mTgTlFHS25ZRxQ", "stars": 5, "date": "2011-06-18", "text": "Love this place - great beer and a good vibe, pretty much the best of its kind in the area. Even the food is well done, and not too pricey...its the rare brewpub that has decent vegetarian options, and this place certainly does!", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KJnN3PleykbLaE243XUk1A", "review_id": "XrI8QfpD0PeYZVv63JVq2g", "stars": 5, "date": "2011-07-02", "text": "Best fish fries in the Albany area.", "type": "review", "business_id": "xlCVbr56NU9rFFWPRcRUyA"}
{"votes": {"funny": 13, "useful": 11, "cool": 9}, "user_id": "Qa2tb_kuVoy4S6zUMYgd3A", "review_id": "VK-LWfL1g4ISa9T1XO8bJQ", "stars": 1, "date": "2009-12-01", "text": "I had my 10K service at Cooley and they'd forgotten to reset the \"Service Now!\" alert so I had to go back. Oops!\n\nIt was a bit of a drive for me and I figured I'd kill two birds with one stone. I decided I would have the \"Volk-L\" Bluetooth phone system installed in my car, even though I hate talking to people on the phone.\n\nI made an appointment and reserved a loaner car with them.\n\nWith German promptness I arrived at the dealership first thing in the morning. They informed that they did not have a loaner car for me. Oops!\n\nThey arranged a rental car which I had to wait for, and then sent me on my way. Later in the day they called to inform me that they'd forgotten to reserve the Volk-L part for me and accidentally installed it in someone else's car. There was now no Bluetooth phone system to install in my car. Oops!\n\nThey said they'd ordered a new part, but would have to keep my car an additional day.\n\nThe next day I called to check in. They transferred me to someone. She transferred me to someone. He transferred me to someone. He transferred me to someone else. I kept asking the same question: \"Just wanted to know when I can come and pick up my car.\" Person #4 put me on hold.\n\nEventually Person #4 returned to the phone and told me to come on down! It'd be ready when I got there. I came on down.\n\nIt wasn't ready - because the part was broken and they couldn't get it to work. Oops!\n\nI should add that despite the baffling incompetence they were very, very cheerful. Had they offered me some kind of apology in the form of a discount, I might have given them another chance. But they didn't, so I took advantage of their free WiFi to look for another dealership.\n\nYour mileage may vary, but don't be surprised if it doesn't.", "type": "review", "business_id": "deMySa63_mE3Jy2lWMU1Dg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s_Dg0gNZmh-Vc6yLQ34_lw", "review_id": "SOwXfqwUr6NWmbBS0tx_GA", "stars": 3, "date": "2010-07-09", "text": "This place headlines and really brings a lot of people down to the waterfront in this section of Troy.  And Troy has some good things going for it, which is great to see.  The beer here is worth staying for, but the food is debatable.\n\nI've eaten here twice, and both times, the beer was great.  I usually stick to the brown ale.  I love drinking brews from the brewery.  But the food really lackluster.  One time, there for dinner, I had a burger with fries.  Nothing too great.  The second time, I was there for brunch and ordered a Monte Cristo.  Both meals suffered from the \"Sysco effect\".  The food was just bland and felt like it could have come from a Sysco truck.\n\nI've talked with other people who have experienced the same issues I have.  A great place for beer, but get your meal somewhere else.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 1, "useful": 6, "cool": 4}, "user_id": "PipGc4TdxurGizJ6CKmU7Q", "review_id": "PJsyWM-p7Y8CLAczEErgOA", "stars": 4, "date": "2010-10-02", "text": "I'm now here about once a week.  The Fresh Market has made it into a regular rotation, even though it's out of the way.\n\nIt's not Whole Foods. It's certainly not Trader Joe's. It's not Wegman's.  \n\nI think it's best to approach this store on its own terms.  A lot of items are pricier than similar items one might find elsewhere.  Sometimes this is because they are overpriced.  But other times it is because The Fresh Market products are actually better.  \n\n- Roast chickens that weren't fed antibiotics (when they were alive).\n- Prepackaged sliced cheese made without the use of rBST.\n- Grade B maple syrup (which is surprisingly hard to find here).\n\nThey have tasty challah at the bakery (although they do come frozen for kosher reasons). The bakery even torches creme brulee to order.  Get the pre-stuffed cannoli at your peril.\n\nNot everything is great, and the service especially at the bakery counter and the deli counter can be slow.  The cheese selection is a major personal disappointment.  But this is by far the nicest place to get groceries in the Capital Region.  \n\nAnd if you have kids, they can get a card for the cookie club. Every time we are there, the children get a free cookie from the bakery.  When it's time to get more milk, can you guess where the little one's want to go?", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_kpUOZfSiPU_H1hcXp9Nyg", "review_id": "rCF2iYCNySGTH2CpoIKwaA", "stars": 4, "date": "2011-10-28", "text": "I've been here a couple of times visiting a friend at RPI. Good drip coffee, vintage decor is charming and reminiscent of the space's previous existence as jewelry store. The staff is friendly and the food tasty. Definitely worth checking out.", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NtgXljFEPMAQx7pbgos93Q", "review_id": "c55ERWtlEWiNMVsfLg9RJg", "stars": 2, "date": "2011-12-10", "text": "I attended one of those dreaded work related holiday parties here yesterday.  I was definitely unimpressed. The hors d'oeuvres table was pretty lame, I'm sure the office planners approved the food so I can't fault the facility for the chocolate fountain before lunch but the veggies looked old and tired, the dip was actually just salad dressing, the cheese and crackers were sub par.  Lunch was okay but the service was very disorganized. All the tables around us got their salads while we sat and waited but then we got our entrees before them and were done by the time the table next to us got their food. I had chicken with bland sauce, mashed potatoes and a few green beans. The dessert was either some type of gummy mousse or tiramisu, not really sure.", "type": "review", "business_id": "OpOZH_lGPGOT_s1eeMqeNA"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "-hxUwfo3cMnLTv-CAaP69A", "review_id": "408hwioZ-qUozGrKzoqKqQ", "stars": 4, "date": "2011-09-13", "text": "I had the most amazing wrap here the other day. It was the steak and egg wrap. Soooo delicious...just thinking about it makes my mouth water. Grilled steak, peppers, and onion mixed with scrambled eggs and melted cheese all bundled together in a soft wrap. Yum! I wish I lived closer so I could get one tomorrow morning!\n\nOh and the coffee drinks are not bad either. I highly recommend the iced mocha carmel latte.", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "EpDuT1wxcg30KQxovkdNdA", "review_id": "TNZtUxLGJ1cqUnUwMCqJLg", "stars": 5, "date": "2009-09-04", "text": "I remember this place when I was little.  I loved it when my Grandfather would take us there.  It was a special place, and I have fond memories of my \"Grampa\" and the times we spent there :)  Thinking of Hoffmans makes me miss Grampa and wish he were still around.", "type": "review", "business_id": "VcuMtj_cGyjaa_O1E2xMIA"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "jbme6UoDggF7NtkItZZyhA", "review_id": "W9XBmESNH-nR2JKl4i0QCA", "stars": 1, "date": "2009-04-29", "text": "Me and my boyfriend wanted to treat ourselves out for dinner, and wanted to go to a diner for options. The menu was limited and it's mainly a breakfast place. The service was very slow and there was all of 4 tables there. I got a chicken sandwich, and no joke, it was the size of a white castle burger. The ice tea tasted HORRIBLE. Needless to say we will never be going there again.", "type": "review", "business_id": "VIeqbFdw0gm_hwoL_2NXTg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YnsEIg7M93fmYBfjbeP8GQ", "review_id": "szrije7ZDhkfTgfxKAbk3g", "stars": 2, "date": "2010-01-20", "text": "The beers are ok, but its too expensive to eat here.  The quality doesn't justify the price.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ci4qY928U5Y05QUYI4zYRw", "review_id": "nxo5D3jpC8Sr3FI6Aa9Q9w", "stars": 5, "date": "2012-09-07", "text": "The cajun chicken ceasar salad is amazing!", "type": "review", "business_id": "tGJTMrSWb6wufN3m_yGOvA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b8EF1LE3ioJFH8Yo9iOynQ", "review_id": "7aIcs2yvMVfH5jqBRdnclw", "stars": 4, "date": "2012-09-02", "text": "Great Ice cream as others have noted. While it is just a little bit pricey for ice cream, its definitely worth the price. Very fast too. If you're ordering soft serve it almost feels like someone in the back is making it before you even pay.\n\nThe portions are very large, a \"kids\" size is about the size of a soda can, and for the sundaes you can get several different toppings. \n\nI don't order from the grill often but the food is pretty good there as well.\n\nA tip, if you'ore interested in trying something special like the hot fudge brownie with ice cream, try ordering a sundae instead and asking for what you want as a topping. You can get ice cream with brownie and chocolate syrup (practically the same thing) for half the price. \n\nMake sure to get a punch card when you go! You can turn it in for a free medium after 10 items (not transactions).", "type": "review", "business_id": "YozJ8FCKDT98XRq16XkpWg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_GjOeO0PcVb0gjGUQzUgyA", "review_id": "HLsR8uB5UpkLUNWHzynHzw", "stars": 5, "date": "2009-10-22", "text": "Very good indian food.  I've eaten this type of food in different parts of the world and this rates with the best of them.  ...Upscale with tasty food and good service.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Ej1Q0EeGwx2fQwFxtnsCaA", "review_id": "UU0x17VYU0ltnz7LgLebNg", "stars": 4, "date": "2008-05-22", "text": "One of the few restaurants in the North Greenbush area that is truly delicious and fresh. I've been to Garlic Lovers several times now ever since it opened. If some of you stopped by in the beginning months, it used to be more of a pronounced take out place. Now it is quite fancy if you ask me. I had the pan fried Mahi Mahi, cooked to perfection and served with couscous and fresh veggies. I would also recommend the Pan seared scallops...mmm. Their Moroccan chicken stew over orzo is also a pleasant surprise with a jolt of spice. The falafel sandwich is pretty standard but I think that you should try something nicer since it is available.", "type": "review", "business_id": "hluBhGYt7BOKhCP4M0qDDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k9NYaG1pqyRaMOoixI4LCw", "review_id": "CPQD2G1TDcd09dI0VFLiTA", "stars": 4, "date": "2007-02-07", "text": "This place really raises the bar for Indian restaurants in the area.  The food is high quality, served up by a skilled waitstaff, in a dining room that is clean and elegant.  The spicy dishes such as Vindaloo and Phal are legitimately hot while remaining flavorful.  Some of the other menu items including the Calcutta Jewish specials are unique creations I haven't seen before.  Karavalli also has a liquor license, so you can enjoy a beer or a cocktail with your meal.  The prices are on the higher side, but not unreasonable.  A good addition to the local restaurant scene!", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w3zCR9GgVhiWkHZ2LXI9TQ", "review_id": "W8M8iD6xJj1K9-embqN3ug", "stars": 3, "date": "2011-02-06", "text": "As surprising as it may seem - the pizza here is actually pretty good. \n\nI picked one up on the way home yesterday. The crust has good texture (crispy yet maintaining a certain chewiness). The sauce had nice flavor (just wish there was a little more on the pizza). The toppings were just what you would expect from peperoni and cheese. \n\nThe large was a little small (maybe 14 inches???) but hey -size doesn't matter, right? \n\nOverall a good pizza that hit the spot.", "type": "review", "business_id": "KjMloHECqYkQEJslek8v_A"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "GwlrUwkULm4ZLN-Kum5nag", "review_id": "mLeBBH5-a5hnjU54iyjJFw", "stars": 4, "date": "2009-08-24", "text": "Ted's Fish Fry now has an official website and a Facebook page! Congrats on almost 60 years in business!\n\nThey have some very cool photos on both, hehe :-O\n\nWEBSITE: http://www.tedsfishfry.net\n\nFACEBOOK: http://www.facebook.com/pages/Watervliet-NY/Teds-Fish-Fry/240983270362", "type": "review", "business_id": "4Asa_ZggWWgr5EAuTUY2cQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "cOr0rsJKNcbfYzwj6xCoJA", "review_id": "YPu9WuUntGCGgYbERKd9mA", "stars": 2, "date": "2011-11-23", "text": "I'm new to the area and asked around at work for a local nail salon.  I was in need of a pedicure and a little relaxation, so off I went to City Nail after two people recommended it.  The salon was clean and they were able to get me in right away without an appointment...definitely a plus.  The chairs are comfortable and the pedicure was fine.  That's it...just fine.  I guess I was just spoiled by the attention to detail at my favority spa back home, but I'd prefer more time spent on trimming/cleaning and less on the massage.  Overall, the experience was okay but I'll be looking for another salon next time.", "type": "review", "business_id": "z6Ut4WINzV8aK83c3lZPtw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "V2-96_CAa4MP2yAs9r4ayQ", "review_id": "4KHSRh-pSQMXUx7_aKXFvw", "stars": 5, "date": "2011-10-18", "text": "One word can be used to describe, AWESOME!  From the owner to the cooks, to cleanliness, oh and not to mention the delicious and fresh food!  Beats out any BBQ joint around, Dino doesn't even come close!  Try it's awesomeness and see for yourself!", "type": "review", "business_id": "Idx8xKpOpz7llQS_5qSBbA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AZjMJi1RirpPZp9xFDxY7g", "review_id": "B9U1dJLmpLLmq36NE1l1SA", "stars": 5, "date": "2010-12-02", "text": "I stumbled upon this place during Troy's \"antidote to Black Friday\" shopping night. It's a ceramic studio with a beautiful selection up for sale: it's a great place to find a small gift or a large collector's piece.", "type": "review", "business_id": "lzdwIQbxgIePMoalQvyhew"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qvXYdMgLzuFmr5fAwgSxKg", "review_id": "qSFxIOB6raDLF29unXU-BQ", "stars": 1, "date": "2012-10-01", "text": "Interesting shop to browse but save your money before signing up for a lesson.  The owner ran a special on groupon and said she was too overwhelmed by the response to return calls to schedule a time. Unfortunately I got the lesson as a present, not a groupon cheapie. The instruction was minimal,  owner was distracted, we got barely an hour and a \"special\" day was anything but.  Save your money, even if you get a \"deal\". Not worth the trip to  dead  \"downtown\" Troy.", "type": "review", "business_id": "lzdwIQbxgIePMoalQvyhew"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gxBTJ-2RjdB9mEmYjT7RdA", "review_id": "28Oqs7TxLjsNpASb9mVtDw", "stars": 2, "date": "2009-02-08", "text": "Paesan's was one of the places in my area where I ordered pizza from. The previous reviewer is dead on about the pizza, too much cheese, not enough sauce, and not enough toppings on the whole pies. I say just order the slices which seem to have more toppings and taste decent, especially after going to the bars. I've had better pizza.", "type": "review", "business_id": "hhjYGhB_Le97qh6rFynOQw"}
{"votes": {"funny": 1, "useful": 0, "cool": 3}, "user_id": "TNGWhuRAEp0zleMa-NixmA", "review_id": "jsLWlAngYgZS9mi8i9t0Ug", "stars": 4, "date": "2011-11-26", "text": "\"Brewing Brown Ale is to Believe\"\nby Josh K.\n\nHeaven can best described as sitting out on a deck on the Hudson River with a pint of Brown Ale in hand.\n\nYou may be mad that I equate a Troy brewery with our eternal resting spot in the clouds.\n\nAt first glance, you would be justified.\n\nBrowns Brewing Company does not have great food...it is very average.\n\nWhen it is crowded, the service is horrible.\n\nWhen there is a live band, it is too loud...and crowded.\n\nBut take a sip of any of their beers brewed on premises, and you are an instant believer.\n\nThe Smoked Whiskey Barrel Porter, the Oatmeal Stout, the fresh and fruity Cherry Raspberry Ale, or their signature Brown Ale, all are extremely delicious.\n\nIf you need a little relief from the crowd, the deck out back overlooking the Hudson River is a great place to hangout.\n\nThe cheap sliders on NFL Sunday are also a nice snack to go along with the homemade beer.\n\nBut what it really comes down to is the simple fact that because I love their beer, I can't help but to love this place.\n\nWith Jose Malone's, River Street Cafe, Revolution Hall, Ryan's Wake, and Dinosaur Barbeque all on the same little strip on the Hudson, the River Street neighborhood of Troy is easily my favorite section of the Capital Region.\n\nAnd the Brown Ale is Holier than thou.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kin2sO4sZvIpW_hqQ3wDtg", "review_id": "VQocOCY0rx_WA_H08Vgk5Q", "stars": 4, "date": "2011-05-25", "text": "pretty good food, nice decoration and cheaper than expectation", "type": "review", "business_id": "U_wLGkq86qyd8yzpKyFswg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0Sw9sDJy9beVwPX6EfOKeg", "review_id": "41U746PDr8MFzoAS2dSy2A", "stars": 4, "date": "2010-08-13", "text": "After hearing about The Judge's Inn for some time now, I decided to try it for lunch.\n\nFirst off, the restaurant is beautiful, there is a nice little stage for live music, a game room with a pool table and darts, not to mention to beautiful ceiling- just look at it to glimpse Troy's golden days.  \n\nThis place takes the legal theme and runs with it.  When handing you your subpoena-like menu, the waiter says \"you have been served.\"  Furthermore, all of the items are either named for legal cases, laws, or famous judges or lawyers.  \n\nFor the food, the menu is extensive and there are many unique choices.  Not every pub fries their potato chips to order, makes their own pastrami, or uses chipotle aioli.  I tried the Em O, the fried pickles, and they were delicious- served with a very hot, but cool, chipotle aioli.  I ordered the Oliver Wendell Holmes, a sandwich of 2 crab cakes, garlic aioli, canadian bacon, and the fixings- it was delicious, though my one complaint was the cakes were a tad salty- nothing too bad, though.  My brother got a monster of a burger- cheese, canadian bacon, all on rye bread- it too was very good but a little too brown to truly be medium, still it was very juicy.  My dad ordered the pastrami sandwich with red cabbage slaw- it was delicious.  Although, it got even better with a side of grainy brown mustard, something I think they should include on the plate without having to ask for.  \n\nOverall this was delicious pub food at a reasonable price.  The atmosphere was great and I just dig this place's style.  I know it's picky but I would like a little better presentation for the dishes- there's nothing wrong with the simple presentation I received, but if the presentation matched the taste, this place would be perfect.", "type": "review", "business_id": "KBC-CCXC5oFJLaDfPlXNUA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vZPgYRc3CAgagWmpr79wrA", "review_id": "6bVdiGwdJXeHBI02JDnbHQ", "stars": 4, "date": "2011-07-30", "text": "Another nice hidden gem of Troy. Good food and a nice beer selection. It's small but fun.", "type": "review", "business_id": "Qh-hU4JKEjF4kkSe0IGdSA"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "p5uj3fBVGnGhdZ3RiE93MQ", "review_id": "itazmK_oSvEhIQcAoQQmaQ", "stars": 4, "date": "2010-11-28", "text": "If whole foods got together with trader joes and had a baby bam they'd name it Fresh market.  Love the sashimi grade tuna for 11 bucks a lb . Didn't see any two Buck chuck though", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Mm7yR3DDtIKKZY9vOzFz-w", "review_id": "eDzzyffbblqCXC7ZRAasuw", "stars": 4, "date": "2012-07-21", "text": "On the Farm has great soft serve ice cream.  The kind of soft serve that leaves me wondering \"why doesn't all soft serve taste this good?\"\n\nI wouldn't necessarily eat lunch here, or order any of the fried things, but every time I am in town I try to go by On the Farm, remember 1986 (when they opened) and smile at the fact that the soft serve tastes as good as it did then.", "type": "review", "business_id": "YozJ8FCKDT98XRq16XkpWg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "62xleOvA8A9Zba9RSTA8KQ", "review_id": "oP5agHDvs1v2xYlEv13U3g", "stars": 5, "date": "2011-10-27", "text": "This is my preferred grocery store in the capital region. Their prices are much cheaper than Price Chopper. The store is very clean and well organized and the produce is always fresh and tasty.", "type": "review", "business_id": "UZFBK4pU-VcEt1N4IoYCRA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "YUTTBj8K5RGzdpZogyrHLQ", "review_id": "zHjrEosMDEAnFy3KNxCDsQ", "stars": 5, "date": "2011-08-03", "text": "I had to get my bridesmaids dress altered within a week time frame and this place did a fantastic job! I would recommend this place to anyone that needs a good job done for a great price. Location is also convenient and service extremely nice.", "type": "review", "business_id": "lujEt948SWY9tHACaPHFUQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YN9hBSEEeT0BaZXSMs2XMQ", "review_id": "fejTyfeZXpOedHuHH77BQQ", "stars": 1, "date": "2012-04-14", "text": "Not very good at all would not recommend very thick crust", "type": "review", "business_id": "DfOtgLP1a-a8lQlIvYksDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HZn-bjDaz2gpQtZCdyl75A", "review_id": "DvwMZ3_bxSoWdDuwjw8Avw", "stars": 3, "date": "2012-08-10", "text": "I've eaten here probably 30 times in the last 3 years. The food is always excellent, but the service has gone downhill lately. I will continue to come here because I really like the beer and the fact that we can fill up our growlers. If you want to eat within a reasonable amount of time, do NOT come here during dinner time on a weekend.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "480RsuckR2T8ChcCwg4d6Q", "review_id": "fTzXvffPYQf5XxcRgDGGTA", "stars": 5, "date": "2011-03-14", "text": "I hve been doing business with Langan Audi East for some time. I have always had a good experience in all of my dealings. Staff is always very friendly and willing to help. I am on my third vehicle from Langan and will returning soon to look for a car for my daughter. Great brand and great dealership!", "type": "review", "business_id": "ylVyaq6lEkOvI1bpP6uP1Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "MwEdQEse8fj3QYmtjcFhUg", "review_id": "m7aYSDvYcsQy1KY6a1nOeg", "stars": 4, "date": "2012-05-06", "text": "I've read some pretty bad reviews on this place on other sites, but I wanted to put in my two cents. I've been living here for over 2 years now and I've really enjoyed it. The rent is expensive but for the amenities I think it's a great value. I love my beautiful apartment and don't plan on leaving any time soon. I never hear noise from any neighbors and no one ever bothers us. A couple of things have broken over the years but nothing a work order can't fix. You can definitely tell the stuff is cheap...my fridge had a plastic part that cracked, my lazy susan cracked, and the insulating strip under the front door is always just coming off. We've had it replaced once and we need another one again. That is pretty annoying, bugs start getting in!! Other than that...I love my vaulted ceilings, my huge guest bathroom, my nice big pantry, and the washer/dryer IN OUR UNIT!! I can't tell you what a convenience that is! In the summer time it is so nice to use the pool (but I don't like to go at a time when kids are all home because it gets really overrun by little kids. I also wish you could bring some beers in but you can't drink alcohol in the pool area. oh well.) I also wish there was a younger crowd living here, we don't really know any of our neighbors because they're mostly families or old retired couples. \n\nThe WORST thing about this place is the parking situation. It's a nightmare. I've had to park as far as 2 buildings away from where I actually live, its so terrible. They did not plan this place very well when they built it. I dread looking for a parking space!!", "type": "review", "business_id": "r7l6GHODyZqGu-ZA7-anUQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kLEqGTveSL5XN4zEhN6cAA", "review_id": "esOYPkDhdwZQmRx8z-p4JA", "stars": 4, "date": "2010-02-03", "text": "Good food - cheap price - quick delivery. What more could you as for.", "type": "review", "business_id": "2ubKfUIPF_mWcF5k8KLs-Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8F8PcZawgff7O3mA69go9A", "review_id": "TaY7r1LGehMna9bwwvNsAQ", "stars": 5, "date": "2011-11-14", "text": "They have the best Salmon BLT i've ever had in my life.\nI had their red velvet cake..it was ok, but the sandwich is mind blasting!\nMUST HAVE!", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ldeTSmGQoQDJnt_yCDZ6Ng", "review_id": "GaZE94jTbvqN3C4tcjifOw", "stars": 4, "date": "2010-02-04", "text": "I've been to this yoga studio on several occasions now. The experience has been a bit different each time, but overall very positive. The studio is heated to the mid 90's and keeps your body warm and limber.\n\nI took a class with Susan and she proved herself to be one of the best yoga instructors I've ever had. The class was full of experienced students. I' not a total newbie but I'm not really that good either.  \nShe guided the class through a complex routine. Some of it I had never seen before, and she got us to do things that I didn't dream were possible.\n\nI've taken a class with Emily the owner who pretty much just blew me out of the water. She has a devoted cohort and the class was packed. To say is was challenging is an understatement, and the students loved her for it. These are the people who thrive on a punishing workout.  \n\nThey would have a 5 star review if it were not for the cramped check in area, and no locker room or changing room other than the bathroom. The studio is very popular and the Monday evening I was there hosted so many people that it was hard to move around in the check in area.", "type": "review", "business_id": "P55ryS7ZZq2hQfIOTDb8ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7B3trKyvtX9CBpBdAc5SEg", "review_id": "vFRx85yORT5ycUEQ9KgwdA", "stars": 1, "date": "2012-08-26", "text": "The pizza from here is pretty good (for a chain), their customer service on the other hand... IS HORRIBLE!", "type": "review", "business_id": "KjMloHECqYkQEJslek8v_A"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "1gq25jfibnLBtvze3NyDhA", "review_id": "XI274hvEU5rtwo7wp1427Q", "stars": 3, "date": "2011-01-29", "text": "I'm a fan of Fresh Market, but there a few things that bother me.  I think they could have more organic products and carry more local products.  I think they try to give out the organic vibe, but they fall short.  It is extremely clean and nicely laid out which is nice.  It gives out an upscale vibe both from the outside and when you walk in. \n\nI really like their meats.  My personal favorite is the chimichuri hanger steaks.  Mmmm.  I could easily eat them once a week.  They also have good prepared foods.  I really like their rotisserie chicken salad and actually their rotisserie chickens.  They also have delicious curry chicken salad.  I was a little disappointed to see the same old crappy ingredients in some of their baked sweet goodies, but I think that's almost to be expected in those type of things.  \n\nI think if you stick to the prepared foods and meats you won't be disappointed.  Mostly everything I have gotten has been great.\n\nThe people who work here are definitely friendlier than the employees at your run of the mill supermarket as well.\n\nOverall Fresh Market does a good job.  I do feel the prices are a little high, but the alternatives in this area are pretty awful except for the co-op.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "wlf5k_LT-Iu2Uea4NDtwnw", "review_id": "RDKI5ljMX911qBlClUs9Yg", "stars": 5, "date": "2012-10-08", "text": "I have not bought a car here. So I can speak on that. This dealership is maybe 8 minutes from my house, so I bring my Jetta here for service. Greg and Kelsey are by far the best service people I have dealt with at any dealership. They always find away to squeeze me in, even if its for a simple oil change. Or took 10% off my bill when I didn't have a coupon. They try to go out of their way when and where they can, so be nice to them, and don't be afraid to ask for a discount.", "type": "review", "business_id": "deMySa63_mE3Jy2lWMU1Dg"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "F9A5FN7Hg5NcAvQxMq4b5g", "review_id": "J-x-DOWOInSTOAQV5L3QZw", "stars": 5, "date": "2011-05-02", "text": "This place is perfect for a family with young children on a budget. No admission fees is the key here. Most rides cost 1 ticket and they have a 8 tickets for $11.50 deal. The rides are nothing spectacular but they are perfect for young children. My 2 year old loved this place. They also take credit cards which is a plus. Staff is very friendly and parking is convenient.", "type": "review", "business_id": "VcuMtj_cGyjaa_O1E2xMIA"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "qGSrT9FfUZAgY-Jm2Co9sQ", "review_id": "rZjazNOHQ0KBTfNMYc0AEw", "stars": 4, "date": "2012-10-11", "text": "When your wife calls and says \"I've had a terrible day at work, would you like to go out for a beer,\" you do like I did... turn off whatever you were cooking on the stove, and tell her you'll leave in five minutes to meet her.\n\nAnd so we met at Brown's.  The \"beer of the day\" was an American Wheat Ale ($3.75 /16 oz all day) - 5% abv, crisp, slightly fruity, unfiltered.  The Pumpkin Ale ($5.25 /16 oz every day) - 7% abv, nice mahogany-bronze color, a hint of orange, and in my opinion, NOT sweet and spicy like a pumpkin pie, but slightly sweet, dry and clean tasting.  Those beers kept us satisfied while we ordered and discussed a day at work.\n\nMy wife chose one of the day's specials, the Mushroom, Beef and Swiss Quesadilla ($11.99) - chopped steak, caramelized onions, mushrooms and imported Swiss in a flour tortilla, served with Brown's chipotle ketchup, sour cream and salsa.  Other than a couple pieces of grizzle, this was very good, especially the chipotle ketchup.\n\nI ordered a Hickory Chicken Sandwich ($10.49) - southern fried with cheddar, bacon, cherry raspberry ale BBQ sauce, crispy onions, lettuce, and tomato on a ciabatta roll.  Very tasty, but difficult to eat since the roll was very thick and the BBQ sauce made the chicken slide out of the sandwich.  The accompanying fries were reallllly good dipped in my wife's chipotle ketchup.\n\nAn Oatmeal Stout ($4.75 /16 oz) - 5.5% abv, was its usual flavorful, award-winning self.  Their Oktoberfest ($4.75 /16 oz) - 5.5% abv, was nice, with a slight sweetness, but not as flavorful as one I had recently at Druther's in Saratoga.\n\nService was good, but the upstairs dining area was drafty and cold until they closed an adjacent door and more people sat in the area.  Bottom like, Brown's makes some excellent beers.  Without the beer, I'd probably only go 3 stars, however.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "T9cX5WYnzJhfMenCGxDMLw", "review_id": "DBSF1UcC-gaanxlOgqrnbw", "stars": 4, "date": "2010-10-18", "text": "The potato pancakes were good, and extremely fried. I mean, they were thin, crunchy, and dripping with grease. It was great. I got two things of apple sauce, because the waitress thought I would want some--I didn't ask, she just decided to be extra nice. The staff is extremely friendly; it's all an in-house family operation. Even their website was designed by the owner's son.\n\nI had the Banana crunch, described on their website as:\nTwo Fried Bananas topped with a crunchy Peanut butter, Vanilla cream, & brandy sauce.\nbut described more accurately as an orgasm for your mouth. Eat it. Eat it.", "type": "review", "business_id": "U_wLGkq86qyd8yzpKyFswg"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "vOMSNQLv0uJ9JlGE-IPi-g", "review_id": "zCRNGOTdwamma-truXBoPw", "stars": 5, "date": "2012-09-12", "text": "Not just a place for delicious wood fired neapolitan pizza, but a place for awesome craft brew and a short but decent wine list AND yummy desserts.  \n\nSomething they don't  emphasize enough is how much is made in house: dough, mozzarella, sauces, and desserts and often from local sources. \n\nIn addition to pizza and pasta you can get a salad with any of the toppings generously piled on fresh greens.  \n\nI also had a conversation with the owner one time about some of the earth friendly circumstances of the building itself and the operation.  (I was under the influence of several glasses of wine so I'm a little foggy on details)\n\nThe crust has improved over the years and is still light and crisp and is at its best when the humidity is down.  Sadly, I do not think the pizza, the crust being a delicate as it is, travels well, so it is best to eat it in house.  \n\nDespite Daisy Bakers claiming to be the unofficial after party spot for Troy Night Out, it really is Bacchus Wood-Fired that everyone is hanging out at.", "type": "review", "business_id": "cnSXX4gGaEGy75BElLiSDw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "s1O9Qwdf5xmoNWOsJrJsBA", "review_id": "8Obl8gDv55fDtn34b_8gQw", "stars": 4, "date": "2011-08-23", "text": "We ordered three different lamb curry under the special column and one salmon curry for lunch, though it takes longer time to prepare the food than going directly for the lunch buffet. The food is tasty and We like the naan and roti a lot~\nThe one thing that I dont like is that the mango lessi and shake are soooooo sweat that I just cant finish it...", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "PkBdU_KtSWI6jNTXwCAJZg", "review_id": "YpLGotVfKFf6ci6VsVG_QQ", "stars": 5, "date": "2012-09-11", "text": "I am in love with this place!\n\nFirst, they have the coolest pizza oven ever.  That alone deserves 5 stars. \nThe atmosphere is funky basement brick.\nThe music they play is great.  \n\nNext...the food. Oh, the food!  I love it!\nThe pizza's are thin, crisp, light and very fresh with endless topping \nSame for the pasta.  Huge portions with endless pasta/sauce/ toppings combos.\nWe didn't get pasta but saw what was being served next to us and we will be back to try some of that!\n\nThe libations include a revolving selection of microbrews and wine by the glass.  We ordered  a glass of Carmenere and a pint of Goose Island Harvest.  Both were excellent.  Our serve told us that the draft selection constantly changes to reflect the seasons.\n\nThere was trivia happening in the bar tonight (Tuesday)' so we chose to sit in one of the booths instead of the bar area.  The space is divided into several dining areas.  Bar, Booth area, dining room by the cool pizza oven or outside if you can manage to snag one of those tables.  they also have a funky little hidden room!\n\nWe ate a lot but weren't put into food coma status because of the light freshness of the food.  We ordered the garlic cheese bread to start which was unique and so good. I think it was made with their pizza dough and It came with a side of mixed stuff such as lettuce, spicy peppers and feta cheese.  And it was plentiful when it came to cheese and garlic.  \n\nThen came the pizza.  We ordered two.  WOW!  We asked our server what pizzas are the most popular and we ordered the Mozzabella consisting of home made meatballs, home made fresh mozzarella , baby spinach and fresh garlic and basil.  This was really good.  The next pizza was one with fresh pesto , mixed cheeses and very fresh large shrimp.  We loved both.\n\nAs stuffed as we were we ordered a dessert to split.  We saw our server bring something to the table next to us that looked so good.  She told us it was a lemon raspberry cake.  We asked about the other desserts and chose a chocolate, peanut butter and brownie cake that was also to die for!\n\nThe food was beyond amazing.\nOur server was great.\nOur bill was something like $45 for 2 drinks, an appetizer, 2 pizzas and dessert.\nYES YES YES!", "type": "review", "business_id": "cnSXX4gGaEGy75BElLiSDw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "yexPXtqaRWuBMurl5tvDdQ", "review_id": "_uwIhpDgM_4qb2m8D37Ceg", "stars": 2, "date": "2010-05-30", "text": "Why oh why did you change your menu soooo drastically? No more mozzarella stuffed bread or pasta w/ clams. Also, appears the batter for the o-rings and calamari has changed or it just wasn't cooked right b/c it was certainly sub-par to what I've had before there. Not to mention I don't think that the calamari was even finished cooking as it was just chewy and rubbery.\n\nThe roasted mediterranean sandwich was ok...nothing to blow me over. Good thing for the garlic mayo to make up the flavor. For fresh veggies, no one particular flavor particularly popped in my mouth. Only good thing is that now you can get fries w/ your meal w/o that upcharge. \n\nMy sister said her juicy lucy the burger itself ok, but the cheese not so good. The traditional juicy lucy is made w/ american cheese from my understanding and our experience....if you're going to change it, not something that tastes like blue cheese please.\n\nBeer pretzels though w/ a glass of summer ale....muah, perfecto as usual!\n\nPlease please review the new menu and please make some changes!", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6FP_jF-v6EVEEmVcYKGsNA", "review_id": "q_MZnLTXkaxFsFTjdfQAAw", "stars": 2, "date": "2011-08-29", "text": "The crust is too thick, it was undercooked, and the sauce was bland.  The worst part, however, was the customer service.  I called to order and was told that it would be ready in 25 minutes.  When I walked in the door 25 minutes later, I was told 3 or 4 more minutes.  10 minutes later, when I was finally presented with my pizzas, I mentioned that it had taken longer than I was told - twice - at which point the man behind the counter argued with me that it only takes 3 or 4 minutes to cook a pizza (really?), so it couldn't possibly have been 10 minutes.  Apparently their clock just runs really fast.", "type": "review", "business_id": "bKyng2jcrIrxryyAZwgglA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GwlrUwkULm4ZLN-Kum5nag", "review_id": "k42XZU8J5OGJNUfH81BpWA", "stars": 3, "date": "2008-10-01", "text": "Decent Chinese takeout. When I'm visiting my buddy who lives around the corner, we sometimes order Chinese takeout or delivery ($11 min) from the Golden House located in the Hill Top strip plaza. They offer 39 Luncheon Specials ($4.65-$5.25 plus tax) served with pork fried rice & choice of soup, egg roll, or soda and 26 All Day Combination Platters ($6.25-$7.25 plus tax) served with pork fried rice & egg roll. \n\nWe usually get the Shrimp Lo Mein (mushy noodle texture) and General Tso's Chicken combo deals. The food is on the salty side (MSG) and very filling. The service here is fairly quick (open kitchen) and the prices are pretty good.\n\nNOTE: No credit cards accepted.", "type": "review", "business_id": "2ubKfUIPF_mWcF5k8KLs-Q"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "Jd2MrODQlP9mc809UgjEyg", "review_id": "ys9iotH3FE4k8TXQlTi9sw", "stars": 5, "date": "2012-09-19", "text": "After a friend sent me an online review on The Flying Chicken, my husband and I decided to try it out. Boy, I'm glad that we did! We each got the chicken and waffles (a combination that neither of us had ever tried). We also got an order of hush puppies, mac 'n cheese and a biscuit. \n\nWhere to begin? We live nearby, so got the food to go. The biscuit came out as soon as we got in the car. It was different than most biscuits that I've had before, but in a good way. There was a strong black pepper flavor (not too strong - just right) and definitely buttery. While it was soft and moist on the inside, it was nice and crispy on the outside. Yum!!\n\nThe hush puppies (my husband's choice) were quite good and very flavorful. Also somewhat heavy (as hush puppies are wont to be), but worth it! The chicken was boneless and freaking AMAZING! It was not greasy at all, but the flavor (again quite peppery) was great. It was everything I look for in fried chicken and then some. The waffles were sweet, light and surprisingly tasty with the chicken. I got three of the food groups - sweet, savory and crunchy. \n\nThe only thing that was less than spectacular was the mac 'n cheese. Don't get me wrong - it was good, but not flavorful enough to rate as high as all the other things we tried. \n\nThe restaurant itself is clean, well-lit and has some great chicken themed art on the walls. I HIGHLY recommend checking out this new Troy dining experience. I look forward to going back and trying some other of the yummies on the menu.", "type": "review", "business_id": "tGJTMrSWb6wufN3m_yGOvA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "SuwcP1A7GUOsIdAPHou8tA", "review_id": "AgCfNhAb8T5MdeELzuynvQ", "stars": 1, "date": "2010-05-04", "text": "The pizza sucks, and it is a scam against RPI students. A slice of gourmet now costs $3, while for $5 at I Love's you can get 2 slices and a drink. They also won't take any credit cards on anything less than a $5 order, which I've heard is illegal. Don't go here.", "type": "review", "business_id": "y0J2PrJh2LIDHHtT6DzkJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "BYtz8iBtJKVCqysMrWFn2w", "review_id": "Tiizs5QW6d5iuWIhMuBdtQ", "stars": 5, "date": "2010-03-29", "text": "If you enjoy authentic golumpkies, perogies, and kielbasa, you have to try Muza's \"Polish Feast\"!  I've tried other places that serve Polish in the area, and only Muza has a chef that can make something comparable to Mom's recipe. Nice job!", "type": "review", "business_id": "U_wLGkq86qyd8yzpKyFswg"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "YnsEIg7M93fmYBfjbeP8GQ", "review_id": "pyewocL1hQhlQgaesLtCIA", "stars": 4, "date": "2011-09-16", "text": "I keep wanting to come back here & I'm not 100% sure why. The wings are great, but the menu is pretty average. The clam chowder (which I'm big on recently) is Manhattan style. Maybe its the old school never been updated since the day it opened decor. Maybe its just that I love dark dank hole in the walls. Whatever, I love this place.", "type": "review", "business_id": "Qh-hU4JKEjF4kkSe0IGdSA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9I98w8YzmGGpl_ol8qt0hg", "review_id": "1tWbxMra0lNCSezFMImxRg", "stars": 4, "date": "2011-11-05", "text": "This is the best woodfire pizza around the capital district (and my favorite place to eat in Troy).  I love the character and casual atmosphere.  Excellent beer and wine selection too.  I usually order the margherita or mozze bella pizza, salad, and roasted garlic bulb.  Makes for a great meal to share.", "type": "review", "business_id": "cnSXX4gGaEGy75BElLiSDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_oF29z-f80aus3sBX7XZmQ", "review_id": "Bz7l5-6Gg0bjnMqXS2nUjg", "stars": 3, "date": "2010-05-20", "text": "The beer is good, but to my surprise, the only one that blew me away was the pilsner.  The food is pretty decent.  I had the wings which were lightly breaded and unevenly doused in hot sauce.  They were big and meaty and well-cooked, but I usually like them swimming in buffalo sauce.  It was accompanied by a really delicious bleu cheese dressing with big chunks of bleu cheese in what tasted more like sour cream than a creamy dressing base.  Also had the pulled pork sandwich which was OK, except for that it was covered in cheddar cheese and the BBQ sauce was only added as a condiment, like ketchup on a burger.  Great atmosphere, but the service and clientele leaves something to be desired, but maybe that's just me coming from the midwest...", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "62xleOvA8A9Zba9RSTA8KQ", "review_id": "LNypeR9p2-dtcTQ-GdVSLw", "stars": 4, "date": "2011-09-24", "text": "Somewhat pricier than the competition in the area but the quality and quantity are both there. The Chicken Vindaloo is especially spicy and will make you sweat. The service is friendly and attentive and the decor is a lot classier than other Indian restaurants in the area. The food is well prepared with premium ingredients and the portions are more than enough.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "Jgx1yOFOHQMDESqeXyoKrQ", "review_id": "k5lEw82M_d-gBs-y9pe8vg", "stars": 4, "date": "2012-09-24", "text": "Went in with a small group for dinner 9ish on a Saturday night - was immediately able to be seated at a high-top in the bar area. The waitress / bartender was friendly, attentive, and knowledgeable on the extensive tap selection. The wood-fired pizzas were great - crust cooked to perfection. Be sure to get the shrimp artichoke dip appetizer. And definitely save room for dessert!", "type": "review", "business_id": "cnSXX4gGaEGy75BElLiSDw"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "UcAMgZnFy03ynOjG1eGqFg", "review_id": "9ALDtjyIlZ_POJOYkW7mxQ", "stars": 4, "date": "2007-07-14", "text": "Great little sliders with lots of grease. I can smell the onions into Troy. My wife and I stop here during the summer and get a whole plate of greasy sliders, greasy fries, and some soft drinks and have a feast out on one of the picnic tables. All that grease goes down hard.\n\nWhere are my Rolaids????", "type": "review", "business_id": "Yjm7Lw8_PLPBRwDlaCHvsQ"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "Q6-oT1z6o-pUR3TO0gfTFg", "review_id": "uRFavPIT3KgHIk736T86lw", "stars": 4, "date": "2011-02-24", "text": "4 and half is my actual rating.\n\nThe beer selection is rather pitiful compared to other bars in walking distance (ex: holmes and watsons, the ruck and of course browns) BUT that just means I usually get liquor here. \nThe prices are good.  $8 for a double Jameson and ginger.  The drinks are also STRONG. If you get one, don't drive home anytime soon. I'm not a great liquor holder to begin with but I have been with stonger drinkers than I and they agree.\n\nThe bartenders aren't overly friendly but I haven't had any bad experiences.\n\nThe decor is quite charming as stated before. The bathrooms are quite adorable.   They also have some fun options to play.  SKEEBALL? come on!  AWESOME.  Along with darts, foos ball and pac man and some other games.   Most of them are in separate areas which bodes well with my anti-social tendencies. \n\nThey also have a small back area that's wonderful in the warmer months for a cigarette and lovely conversation. \n\nI do agree with the other reviewers that I'd rather you not come here and spoil the fun but I'd really rather this place stick around. =]", "type": "review", "business_id": "R5tjtiq1YeSAS4MZmjNnWw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tqQ5O_mIV6kL0cJ1XO9mXg", "review_id": "MUiOBVNCLYu2Hw_JT8i5AQ", "stars": 2, "date": "2011-10-15", "text": "Went here on Saturday night with great expectations for a four star yelp review.  I was actually pretty disappointed...\n\nFirst, the bring your own bottle of wine no longer applies (I of course brought my own wine and it just sat on our table), now they sell their own wine $6-10 per glass.\n\nAppetizers:  We had the grape leaves which were just ok.  A little on the bland side and nothing that I would care to have again.\n\nMain course: I had the lamb stew (which I would give 4 stars) it was very tender and delicious.  My husband had the lamb kebab. The waitress warned that this would be served medium, to which he replied \"perfect!\".  They actually came out pretty well done and were fairly tough and not very flavorful.  I feel like there's more flavor on \"fake meat\" from any street cart in Manahattan.  \n\nDessert: We got the baklava to go.  It was made with peanuts!  I'm no expert on greek/mediterranean food, but all the baklava I've ever had in the past contained some combination of gooey chopped walnuts or almonds or pistachio smothered with honey.  This one contained dry chopped peanuts and barely any honey or syrup or whatever the sugary goodness that is usually inside baklava!  Again, greatly disappointing.\n\nAtmosphere: Very cute restaurant, nice ambiance and good service.  \n\nI'm very sorry to say that we probably will not return.  Sadly, I have to agree with Katie V in that the food lacked flavor.  I feel that Athos, although more expensive, is a significantly better representation of greek/mediterranean food and flavors.", "type": "review", "business_id": "hluBhGYt7BOKhCP4M0qDDQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "tAukPln3Ha-ouRj5OYSZ1Q", "review_id": "eYlH6YYCeDZkHfPHa2_0fA", "stars": 4, "date": "2008-06-09", "text": "I think Moxie's is great, but it's also due to a number of variables besides the ice cream. The ice cream is also great - however it's not the best I've had* - but I want to ramble about the general atmosphere for a bit.\n\nFirst of all, I love that Moxie's is named \"Moxie's\", which is adorable. I like that it's hidden about 3 miles from my house, on a street where you think you think you might be lost because how could there possibly be an awesome ice cream shop out *here*? I love the playground for the kids, which consists of swings and other equipment, but also a  wooden train for them to climb in and play in. I confess I can fit inside it too (hey, I barely reach 5'3\").\n\nMoxie's also has a \"we're open, rain or shine\" policy. Cool. When they first open around late May, they have  regular ice cream flavours, but as the summer season kicks in you'll find some wacky and interesting ones including their special of like, 5 different flavours of vanilla (actually - I was less impressed with this. A lot of the vanilla types tasted the same to me). I liked the Horchata or Fig flavour instead. Or Blueberry Cheesecake.\n\nGo and get Moxie's, it's adorable and worth the trip and the ice cream is really darn good.\n\n\n* that would be a tie between Berkshire Hills ginger ice cream (found in Williamstown where I work), and Christina's (found in Inman Square in Boston), for their Kulfi ice cream and followed closely by their Burnt Sugar flavour.", "type": "review", "business_id": "CPkUO2F9VENCaLXf4zj5UA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "AgdkH00YX_-myZD4ktkOQQ", "review_id": "AwB9x0HfddeaKWcfPYTYLw", "stars": 5, "date": "2012-05-20", "text": "Alice's Diner offers homemade, delicious food in a comfortable, friendly atmosphere. But why is it just when you find a great place with great food, and think you could become a regular, you find out it's closing? On May 28, 2012, Alice's Diner will close its doors, and if they don't reopen elsewhere, it will be a loss to the Troy dining scene.\n\nAs the name suggests, Alice's is a true diner. A long counter with chrome stools divides the food prep area from the dining tables. Neon accents, including a really great neon-trimmed clock over the door, give the place a retro feel.\n\nWe were warmly greeted when we entered on a Sunday morning, and invited to sit wherever we liked. My husband ordered eggs over easy, home fries (which were really homemade and delicious!), and corned beef hash, a favorite of his that I don't make, so I'm always glad when he finds it on the menu. I had scrambled eggs, bacon, and French toast. \n\nYou should know that in addition to being kind of a picky eater, I am most particular about my breakfast foods. Eggs have to be scrambled well, even to the point of browning a bit. Any soft/wet spots, and I can't eat them. Bacon has to be well done and crispy. Both were prepared exactly per my requests. \n\nThe best part, though, was the French toast. I grew up eating it with cinnamon sprinkled into the egg mixture, and I rarely find it that way at restaurants. Most places usually opt for just shaking some powdered sugar over the toast, which is way too sweet for me when coupled with syrup. Not only does Alice's Diner use cinnamon, they add a bit of vanilla to the mixture. The result is absolutely delicious. I haven't enjoyed French toast that much away from home in a very long time, if ever.\n\nFor all the food we got, plus juice and coffee, not to mention the excellent service, our bill was less than $18 for two of us. More than reasonable.\n\nAs we ate, we chatted a bit with the owner and the waiter, who also seems to be the owner's business partner (we were the only ones there for a bit until a large family came in). They were very friendly, and explained the reason they were closing is that their landlord has already raised the rent twice in the year the diner has been at its present location, and was planning on raising it yet again. They've decided to close instead, when their lease runs out on May 28, 2012.\n\nIt's a shame because I could easily see us returning for breakfast on a regular basis, and probably trying it out for lunch, too. (I'm not sure if they're open for dinner). They're not sure yet whether they'll reopen in another Troy location.\n\nIf you like simple, delicious, affordable diner food, and friendly, attentive service, make plans to try Alice's Diner before they close. And if you enjoy it as much as we did, ask them to consider opening somewhere else in Troy so we can all continue to enjoy it. Looks like the spot where Uncle Ricky's Bagel Heaven used to be is still available...", "type": "review", "business_id": "0B28Fy2vkAF5sLnUyaAqaA"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "vEWlSdEihyvP3oYyAEBS2A", "review_id": "h11Ma_B4c0u07A94SILhjw", "stars": 4, "date": "2007-09-13", "text": "Duncan's Dairy Bar is so good that the previous owners of a competing diner down the road hired an arsonist to burn it down. Fortunately the arsonist was an undercover cop.\n\nGetting to Duncan's Dairy Bar takes a bit of well-rewarded initiative. It's east of Troy on the stop-and-go traffic of Route 7. They open painfully early and close at two p.m. The building itself is kind of ramshackle with afterthought add-on rooms. Like the majority of places in this area, not a lot of attention is paid to decor, but since moving here I've come to find this absence of any esthetic sensibility almost charming. Anesthetic, maybe? At any rate, Walker Evans would feel at home here.\n\nA tall dining counter stretches across its considerable length, tables are plentiful, and even on weekends there's not too much of a wait. Although they serve lunch, Duncan's is primarily a breakfast place, and the food, while not nearly as innovative, is so good I prefer it by far over the Miss Albany Diner. Not to dismiss MAD, but on occasion one's psyche craves the anonymous dining company of farmers and provincial republicans wearing clothing found two seasons ago at TJMaxx.\n\nAll the breads are baked by the Duncan family. The waffles and blueberry pancakes are, according to my GF, the best she's ever had. My ritual meal consists of their ham and cheese omelette, and no matter how much I try, I cannot duplicate it at home. It's almost perfect. Going here is a great first stop for a day trip into the Berkshires.", "type": "review", "business_id": "bdNTZyrd0-GT5vZ6uOhXsA"}
{"votes": {"funny": 4, "useful": 4, "cool": 2}, "user_id": "Q2T0hWllpq0PJ6vB4wxALg", "review_id": "oxh6uXrQjm0JDUnb3e1s9w", "stars": 4, "date": "2010-04-06", "text": "How do you know a good restaurant? \nA, Its in a shady strip mall \nB. It sits within 20 feet of a tattoo parlor \nC. It's a BYOB and there is a liquor store across the street \nD. It's not another pizza place claiming to have the best pizza in NY \n\nNormally it would be C, hands down. But in the case of Garlic Lovers, I may have to go with....all of the above. \n\nI pre-read the yelp reviews and my expectations were pretty high. I went with two coworkers and we stopped and picked up a nice bottle of wine. We started with the Mediterranean platter which had hummus, baba ganoush, taziki, olives, grape leaves and falafel. It was certainly plenty for three people. The pita's that accompanied were fresh and warm. \n\nFor entrees we got the: \nChicken Kabob - nicely seasoned but paled in comparison to the other amazing dishes \nLamb Stew - Out of this world. Amazing flavor, the lamb was falling apart it was cooked so perfectly and was in a flavorful tomato based sauce with orzo. Mmmmm..... \nShrimp Remoulade - Shrimp were cooked nicely and the sauce was very tasty and hit you with a nice kick. It was flavorful spicy not hot spicy if you know what I mean. \n\nEach entree comes with a salad and I have to agree with another reviewer that it was fresh mixed greens versus other places that give you this limp attempt at a salad. It came with a cucumber vinaigrette. Odd but OK. \n\nWe opted against dessert because we stuffed ourselves on entrees but would return in a heartbeat. Tattoo parlor and all.", "type": "review", "business_id": "hluBhGYt7BOKhCP4M0qDDQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "mai_Ij1XlUS789qHHy6nXg", "stars": 4, "date": "2010-11-04", "text": "Love the decor inside. Lots of kitch, lots of low, warm lighting. \n\nThe story goes that it's named after its owners - a podiatrist and optometrist. Footsy. Magoo. Heh.\n\nSo the bar inside is pretty well stocked, and the bartenders have always been very professional when I've been. They have drink specials, but most of all the customer service has been top notch. I wanted a beer that wasn't chilled yet, so the bartender bought me another drink until it was ready. \n\nFood-wise, they have some sandwiches and chips. They don't have a deep fryer or oven. I think it's one of those building rules - they're don't have a microwave either, and only have a top-down heating surface, kind of like a low-power salamander. Still, what they do make is made well.\nI went with one of my celiac friends. After explaining that he couldn't eat gluten, the bartender went through the menu with him and helped come up with something he could eat. But it was slow and there was time for it, so I don't know how feasible that is when it's busy. Also, you normally order at the kitchen window. Not with the bartender. It was confusing at first, but whatever works, right?\n\nEither way, a nice place to relax with friends. Or lose your husband for half an hour while he plays skee ball because it's only $0.25 a game (9 balls).", "type": "review", "business_id": "R5tjtiq1YeSAS4MZmjNnWw"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "u2Vvz07wzZ6onD7JSqRQ9w", "review_id": "GFh3PfYF4qKdHK9ajX3Y_w", "stars": 4, "date": "2009-10-26", "text": "Gimme that smoked pig!  And gimme a pickle.\n\nA this tiny little Polish Deli in Watervliet, one can not just get various Sausages but  Smoked Hams,  Head Cheese, Smoked Bacon's and various cheeses.  They also have excellent homemade Pierogies and  homemade 3 DOLLAR QUART PICKLES. \n\nAfter a trip here, you can head down the street and get some cider donuts at Schuylers. Worth the trip", "type": "review", "business_id": "aoGjCDs2-_-pejJmv4Ss7Q"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "E6dN1U15l5vaHrfY9vxoYQ", "review_id": "ivP67n5bnGt9jHB1B1sWSQ", "stars": 5, "date": "2008-09-25", "text": "De Fazio's is the best pizza by far in the Capitol Region. The crust is great, both chewy and crunchy.  The sauce is equally good having both hints of sweetness and spiciness. Most Capitol region pizzerias miss both of these marks.\n\nDeFazio's is a reason to head to Troy. It is simply the best.", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 4, "useful": 0, "cool": 0}, "user_id": "zh8yKWN_3LdNvH7Ir5xO6Q", "review_id": "ihwWWix28lPYOHiaTA6QVw", "stars": 2, "date": "2007-07-01", "text": "The only reason why this gets two stars is because we came from Muddy's karaoke night, which was possibly the most depressing thing in the world (arm waving during eclipse of my heart? I don't think so pal).\n\nthis place is next to an OTB, a CVS, and across the street from a Wendy's and an Audi dealership. Not the greatest place for a bar.\n\nSo you walk in. In the city this would probably be close to a dive, but it isn't because of the restaurant portion and the actual tableclothed high tables on one side. It's divided, you have back to back bars in the middle, which is awkward because I thought I was lookin in the mirror but actually you just are looking at whoever is at opposite bar. the right side has a set of booths for people to gather, and the left side, beyond some arcade games, has awkwardly placed tables and a dj booth in the back. This manboob concoction was spinning hardcore rap......in the most bland place ever. the crowd sucked, a lot of has been twentysomethings who for some reason didn't make it down to downtown Albany this night and decided go local, go latham, go depressed. We even bumped into two former co-employees from high school movie theater stint. It was sufficiently awkward. \n\nthere were two women sitting at one of the tables. I'm not sure why they were there, because they looked like they wanted to shoot themselves. Maybe they knew the DJ. Maybe they heard there was treasure here. I don't know.\n\n2 dollar coors light pints though.", "type": "review", "business_id": "I2J9rTN_HKO9q-Y2mkSWpg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "w3zCR9GgVhiWkHZ2LXI9TQ", "review_id": "zWW62rTnNkoenJlczEtNDw", "stars": 4, "date": "2010-06-27", "text": "Falafel - when it is good, it is good, and here it is GOOOOOD! \n\nFamily and I went again Saturday, just as dinner service was starting. The sign on the door actually said closed, but we opened the door and were welcomed in by a professional waitstaff. \n\nIt was our first time for dinner and we started with the falafel and hummus appetizer. Essentially a deconstructed sandwich that got us all excited about dinner here. \n\nMy boys each had the lamb kabobs - tasty, tender, and hot. \n\nI had the eggplant routini - I wasn't sure what that would look like at a Mediterranean restaurant, but it was so good that I had to stop sharing as everyone at the table was eating it. \n\nMy wife had a forgettable chicken dish, but that is her fault for ordering chicken at a restaurant. \n\nThe only downside was the rice - it was just bad. Fortunately there was plenty of food with each dinner that we did not need it. Funny that the server never asked about it as none of us took more than a single bite - but oh well. \n\nIf you have never been, don't let the stipmall turn you off.  And as you walk in/out you can browse the tattoo parlor.  We will be going back, and soon.", "type": "review", "business_id": "hluBhGYt7BOKhCP4M0qDDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "85gkp6gW91o18aecPqE8VQ", "review_id": "CUk1tA9zCEkwKuIDhkoSAw", "stars": 2, "date": "2011-10-26", "text": "This place isn't the best pizza. It's quality is akin to what I remember from your run of the mill sheet pizza when I was a kid. Sweet, saucy, greasy. So, if you're not out to impress, and you want to just get \"a pizza,\" then this is the place to go. I cannot neglect to add that the decor on the inside of the place is absolutely classic 1960s - wood paneling (?) included. This is defintley a to go place.", "type": "review", "business_id": "JhWgmJHXb4avC1-vkpkkYQ"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "UVlm7XdAvJCi-ywfEvbwEg", "review_id": "paysB_hyhVY-l0xQsOaYug", "stars": 4, "date": "2011-09-30", "text": "For ribs, it beats Dinosaur, its just fact. Owner is always there, always pleasant and really is helping out the community too. Its delicious, its a chicken and rib joint,  with an urban appeal. I love the place. Puts you in the mind of an old school Kennedy's. Those who understand my description will understand how awesomely delicious it is. It beats the Pig Pit, Dino, Giffys, and PJ's for ribs, its just that serious", "type": "review", "business_id": "Idx8xKpOpz7llQS_5qSBbA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "L_tYJU8A5g8zrpUoE4V0-Q", "review_id": "B1g5yHouwHSEUynHor0Y1g", "stars": 3, "date": "2011-03-08", "text": "I'm shocked that I'm rating this place so highly.  I waited for nearly two hours on a Friday night for a friend and enjoyed every bit of it.  I was watching the three flat screen tv's and listening to the music.  Great!  I didn't have anything to eat or drink until my friend arrived.  The Hefe-Weizen was delicious.  The chicken pot pie was really good, with lots of flavor, veggies and chicken.  The noise level is low to medium and I highly recommend this as an enjoyable meeting place to both eat and talk.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "prFUj1IJfm3F2qbmfO58Vw", "review_id": "wUaTjMLObE7LMeIlO_Mujg", "stars": 5, "date": "2010-08-18", "text": "Amazing!\nSo many flavors to try. Blue moon, horchata, pistachio-cherry, the vanillas.  Takes me a while to decide which flavor to go with per visit.", "type": "review", "business_id": "CPkUO2F9VENCaLXf4zj5UA"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "kin2sO4sZvIpW_hqQ3wDtg", "review_id": "eEnnF2ONTghhW2IynpB_Sw", "stars": 4, "date": "2012-05-11", "text": "I love this place. I tried lamb curry which is bigger dish compared with Lazze on central ave. I like both though. Oh the Indian ice cream is Soooo good.         They have some especially hot shrimp don't try! My friend just gave a lick and start sweating.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 2, "useful": 3, "cool": 2}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "IyojXwcseVd_fv37lgLUqg", "stars": 5, "date": "2010-11-15", "text": "OMG, get the wings, get the wings, get the wings. Crispy, meaty, moist, and well-sauced. I had the medium or mild wings with a friend, and they were plenty flavorful. JUST GET THEM.\n\nAlso had some of their fries and gravy. The fries were fine, gravy was better than I thought it was going to be. \n\nThey also had Old Speckled Hen on tap! The name alone is enough to get me to order it. It was $5 for a pint.\n\nThe inside is all wood. It's almost like someone converted an old first-floor barn or garage into a bar. Really cool. The walls smell like they've absorbed years of fryer oil smell. It is a good sign. They have practiced years of the fine art of frying here.\n\nFriday and Saturday nights are usually packed with people and live music. Lunch times are much more relaxed. I don't know if they do happy hour or food/drink specials on random nights either. It's a really casual place, so don't feel like you have to dress up. But you wouldn't be out of place in a business suit since there are offices  in the neighborhood as well. The crowd is a mix of people ranging from bikers to yuppies, and bartenders are relaxed and know how to handle a lot at once.", "type": "review", "business_id": "Qh-hU4JKEjF4kkSe0IGdSA"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "Cf_vcpmjCcsiFo_U9g_Xuw", "review_id": "coS-7tFM8jNRkvyMfA83pQ", "stars": 3, "date": "2009-01-11", "text": "Possibly the worst name for a pizza shop. Ever. Really. \n\nAnywho, delicious Greek food can be found here. Great dolmades, hummus, and pita. Big portions, and very fast delivery, too.", "type": "review", "business_id": "Ab7pVtIpinCvULKA3bjNnA"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "fbpjEkaALuGJo_dCYWPYRQ", "review_id": "9-RLjFefxMUNoRPk-i4eaA", "stars": 4, "date": "2010-08-31", "text": "I'm giving it the extra star because it's homemade. I only get chocolate, anywhere, and it was very good. I have other preferences, which I've already reviewed. If you like variety and want to try unique flavors, this could be your spot, but only if you like long country drives.It wasn't really a swealtering day, but the ice cream was still quite drippy, even for the undersized scoops and cone. It's known for being a dog friendly place. I don't get the name (unless it's really their family name), since the Moxie's I'm familiar with is an upscale salon.", "type": "review", "business_id": "CPkUO2F9VENCaLXf4zj5UA"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "cmYfiagdULUiXNtdH6wE3g", "review_id": "Jefk5q4aFHj6G2Bfcfrf3Q", "stars": 2, "date": "2012-02-22", "text": "But... But... I want to like this store! \n\nPros:\nI was on a mission to find organic fruits and vegetables for baby food. They had plenty! Avocados, mangoes, pears, apples, blueberries, and so much more. I also like their chip selection. I'm so sick of garbage chips with all kinds of crap in them. The meat and fish cases looked really yummy. I just didn't have the energy to fight the lines.\n\nCons:\nThis store is so claustrophobic. You're constantly bumping into everything. You can get a cart but there is no room to push them around! Well, maybe if you were the only person in the store but, you won't be. This definitely makes it difficult if you have a baby with you. The store is anything but baby friendly.\n\nThe worst part is the check out! They give you a square foot to put all your groceries on. So check out takes forever and the lines just build up. Also, the cart from the person before you (and the people before them and the people before them...) all accumulate at the end of the check out. I literally couldn't get through. This is something they should address immediately! \n\nI will be holding my breath HOPING they build a whole foods or Trader Joe's in this area soon! Until then... I'll have to get a baby sitter to run out to Fresh Market.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "hXzHaGve9mRcPP30k8iL8g", "review_id": "Zs_qDpp1D5okbWyN4VEyVA", "stars": 5, "date": "2012-03-26", "text": "Found this place not long before closing last week looking for something new. Read the reviews and am glad I did because this is a real gem that has somehow been under the radar in Troy for generations! \n\nThere are two shopfronts adjacent to each other. One is for the deli/store, and the other is for the pizzeria. The pizzeria is staffed by a rabble of friendly and talkative young men who engage all of their customers and come check on them to make sure everything is to their liking. The owner also makes his rounds asking for feedback, and seemed very receptive to the suggestion of adding a couple of ingredients to their tomato sauce! lol. \n\nPizza was quite surprisingly good. Crust was not soggy, held firm and crispy almost until the final slice! The owner with great pride declared that it was made from his grandmother's bread recipe. He is definitely onto something with that! Sausage made on premises seems to be their calling card. Quite delicious with lots of spices and not overcooked. The flavor is a little subtle however, so don't go crazy with the toppings or else you may miss out, and that would be a shame. \n\nThis place is BYOB, so prepare appropriately. Wine and beer are ok when brought from home. \n\nThis is it, best pizza in Troy.", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "XMHAEE56ErtAOgSVJwbH6w", "review_id": "FhFIGRdH5lXpX-XPm3PIuQ", "stars": 5, "date": "2011-04-07", "text": "I am going to keep this ridiculously brief. We just moved down the block from this place, so we walked up there tonight having read all the reviews, ordered a four-cheese with red sauce (it's normally a white pizza.) Everyone was so friendly and sweet to us. We took it home (we couldn't eat in because they were all booked up!) And we ate it.\n\nI had heard all over that the four-cheese is out of this world. I mean it has gorgonzola, that's GENIUS. \n\nYou guys I think I cried. You know the part in Eat Pray Love (the book, you guys, not the movie) where Liz and Sophie go to Naples and get pizza from what (by deduction) must be the best pizza place in the world, and it's so good they cry? \n\nI am sure I was feeling what they were feeling. I mean, we've eaten all the pizza in Troy at this point. This is a completely different echelon of amazing.\nFive. Stars. \nYes, I'm coming back. YES. YES.", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "NEVI5zuXTfGi2VP3krtJvQ", "review_id": "X4nKOG27eJzqTnABsGjtdg", "stars": 5, "date": "2012-06-20", "text": "I'll preface this by saying that I don't really enjoy being touched, had never gotten a massage before this one, and probably won't again. Frankly, if a friend hadn't given me a gift certificate for a one-hour massage for my birthday, I never would have gone. \n\nI was extremely hesitant and frankly nervous before my massage. I explained this to Gretta, the owned of WSM, and she was instantly understanding. She has a warm, professional personality, and reassured me that everything would be fine, that it was normal to be a little nervous, and that she would make sure I was comfortable. \n\nOf course, I have no other experience to compare this to, but I was instantly drawn to Gretta and felt reassured as soon as she began. I had a relaxing, comfortable massage, and it was a great experience overall. After I was finished, she brought me a glass of water and told me I could take my time and relax in a back room until I was ready to leave. \n\nOverall, a great experience, and I may even go back someday. Gretta and WSM is a great place with a comfortable ambiance, classy decor, and a professional setting. \n\nFYI: there is no parking lot as they are located in \"lovely\" downtown Troy. Finding street parking is relatively easy, but be prepared to do so.", "type": "review", "business_id": "RrI8TixksrEf1MhHipvZlQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ZQbxbwegQ_ISit_j22oKdQ", "review_id": "VQu2ZsVePCT7M0yaTLpf_g", "stars": 2, "date": "2011-07-08", "text": "I was not particularly impressed with The Fresh Market. Having been to other upscale and specialty supermarkets, I found this one to be a little cramped and scatterbrained. It's not quite a supermarket -- if you're the thrifty sort, I would not recommend making it your home base super market -- but it's pretty good for prepared foods and specialty items now and again. \n\nI did find the prepared items to be quite good and fresh, and was happy to see such a bounty of candy. It might be a place where I will stop if I don't feel like cooking, but I don't think I'd shop there on a regular basis.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tYDFlCHZ3nE8rFSq3uF9tQ", "review_id": "qw47cr--xSMQCpS2Z_vd7Q", "stars": 4, "date": "2012-07-10", "text": "First visit was on Free Comic Book Day and thought it was great. Went back a week or so later with a friend close to closing time and the owner stayed open for me when I was running late and didn't make me feel rushed. It was awesome! He didn't have to do it, but he did and that made him my first choice for everything. Magic,comics,etc.", "type": "review", "business_id": "qI-JE39ifWGj0gMSuf5szA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "De56P_yheGTh8gYcGYNQ4A", "review_id": "uGlsFHJ2dFcEH9Ku5E12TQ", "stars": 4, "date": "2012-09-19", "text": "Look... they make great pizza. Lots of differnt kinds. Always fresh.\n\n I stop in once/mnth when I go to the bank next door. $5 Lunch deal = 2 giant cheese slices with a 12oz foutain soda.\n\nOnly bad thing... the fruit flies near the fountain soda. Needs cleaning daily guys!\n\nLocated in the shopping plaza next to ABC sports and fitness gym. Across from Latham Ford.", "type": "review", "business_id": "bKyng2jcrIrxryyAZwgglA"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "l1zVjOaMNxH1QcDkzIXmww", "review_id": "lEetvFHwoSBj4VpD28U17g", "stars": 3, "date": "2011-07-18", "text": "Best ice cream in area. Burgers are really good but kind of cheap meat. The owner should know sometimes they shut the grill down 15 minutes early. He told me I can order until 8:30 pm on weekday. Ridiculous of the teen workers! I drive all the way out there and they already shut down the grill. Keep your hours consistent!", "type": "review", "business_id": "YozJ8FCKDT98XRq16XkpWg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P4rlSIuawlYgSeYGAUz2_w", "review_id": "XogMyyJyVvLAg9MruqHAww", "stars": 5, "date": "2010-05-27", "text": "Definitely the place to go in Troy.  Great burgers, sandwiches, and entrees (the fish and chips are my absolute favorite), but the beer is as good as it gets.\n\nNothing better than a Brown's burger, a couple of beers, a few friends, and a relaxing dinner out on the deck overlooking the Hudson (not a great view, but who's complaining?).", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SIxcvxCGImiLebYWLkhMog", "review_id": "2Vddu7Ystoc8IWllID9Hbg", "stars": 4, "date": "2012-06-26", "text": "Golf coarse is in great shape always. The coarse is priced right as well. Only problem is the pub is not consistently open. We plan to eat lunch there and when we show up it may be closed that day? Weird. But coarse is awesome. Great place to golf!!!!!", "type": "review", "business_id": "m4rV34xa02aRrv_EXlDuWQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HQeJMlrPqYPGx0q_VdIdng", "review_id": "RcEq920XOO7wgK5p9ubmaA", "stars": 5, "date": "2010-12-14", "text": "High quality antiques....I mean I literally want about five things in this store.  Low pressure atmosphere, a real gem.  Highly recommend!", "type": "review", "business_id": "zx1lLUvlRUN5nQlSj3HRDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vZPgYRc3CAgagWmpr79wrA", "review_id": "o_hCzn2MUPvKS9DmolK6hg", "stars": 3, "date": "2011-07-30", "text": "Great atmosphere -- especially out on the porch. Solid food and good beer.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ZT104CI2xpMiN17P34hrwg", "review_id": "XsQW2aSbN6eyzPQZ-7rsVA", "stars": 5, "date": "2008-08-07", "text": "Wow.\nAs I wrote in some previous posts, it's pretty likely my husband and I will be relocating to the Albany area -- and I think eating at Karavalli sealed the deal.\nWe always hit up Indian restaurants when we go on vacations, and even in places with huge Indian populations, like L.A. and Chicago, we've never found a Kerala-style restaurant like this. It's amazing!\n\nBeing a little depressed from the selection of apartments on our recent \"apartment-hunting\" trip, we decided to take it easy one night and try this place out. They were really busy, but we nabbed the last open table. For appetizers, we had the potato bonda and the bhagari jhinga, which were both excellent - and really filling.\nMy husband ordered an Indian beer called \"old monk\" that he remembered fondly and hasn't been able to find anywhere in the U.S., and I tried the Indian Shiraz, which, surprisingly, i really liked.\nFor entrees, I had the Kerala Fish Curry, which was a spicy, rich dish with coconut/tamarind sauce. He ordered a prawn dish, but I can't remember what it was called. Both were excellent and we ate way too much of them! But we still decided to stuff ourselves at dessert by sharing a pista kulfi and it was amazingly fresh and delicious.\nYum!\nThe manager here was very friendly, too. \nIf we end up moving to Albany, I'm pretty sure this we will be at this place several times a month...", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "vEWlSdEihyvP3oYyAEBS2A", "review_id": "I_wlyRVusN5uEnP89G0dig", "stars": 5, "date": "2012-03-09", "text": "A restaurant witty enough to present Buffalo Frogs' Legs is in itself worth five stars.\nOkay, I googled. This idea has been floating around for a couple of years, which is still good, because this area is usually six to ten years behind the times. Huzzah!", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0Sw9sDJy9beVwPX6EfOKeg", "review_id": "YRivtdMi-s_yEremmzAHeA", "stars": 3, "date": "2012-10-01", "text": "Probably my favorite straight up coffee shop in Troy.  It's a nice atmosphere with good coffee drinks, decent food, and occasional live music, comedy, etc.  I wish they were open later, though", "type": "review", "business_id": "rIe12fdyMfvJtagDly5QGg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "DxkImzkyTK5EpXXsO_4vZQ", "review_id": "JipoBZNx-dpqgtf1x92hQA", "stars": 4, "date": "2010-07-13", "text": "A place to get lost in!  I love to just hang out there (if I have lots of time!). Best part that the owner is always there and is very helpful. He has often been able to check a book's availability when I called on the phone. Many Shaker High required reading novels, which my kids needed by \"yesterday\"! were easily and inexpensively obtained there.", "type": "review", "business_id": "j_fj6YY5hBe5YW1ucRQrsw"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "dbqwzNAIseUSYnmusg-D5A", "review_id": "2IChNMNhNPq92TX_hUuL0A", "stars": 4, "date": "2010-12-29", "text": "Went a couple months ago when our dog ate a bunch of dark chocolate.\n\nWait was reasonable, staff were friendly. Vet gave good enough advice although he didn't believe us and was skeptical about our claim of how much chocolate the dog had eaten. Services were reasonable enough considering.", "type": "review", "business_id": "uep4cDx7Kq3vJTOs2fmLaQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AS2bAG-npVEnH0_6WBtgow", "review_id": "KXlrNbZirtHnKYB56IL7aw", "stars": 1, "date": "2010-04-27", "text": "Tosca has been closed, out of business, gone since September 2009. The owner/chef has flied for bankruptcy, moved on to work at another restaurant, the equipment has been sold, and the space is offered for rent on Craigslist as we speak.\n\nHere are some related articles about the closing:\n\nhttp://blog.timesunion.com/business/tosca-grille-owner-files-for-bankruptcy/18653/\n\nhttp://www.timesunion.com/AspStories/story.asp?storyID=844517&category=BUSINESS\n\nhttp://www.examiner.com/examiner/x-2256-Upstate-NY-Restaurant-Examiner~y2009m9d21-Taxman-shutters-Tosca-other-Troy-spots", "type": "review", "business_id": "-4wyQhCgMdR4LE-Dd1YH_g"}
{"votes": {"funny": 2, "useful": 4, "cool": 6}, "user_id": "VKNIr0wf6u5526MjlE99tw", "review_id": "sVyKk8FInH1U9dqNTtRftg", "stars": 3, "date": "2009-07-17", "text": "I'm kind of obsessing over Poland right now. I'm actually headed there this fall and decided I should give this place a shot as sort of a jumping off point. \n\nMuza reminds me of someone's Polish grandmother's house. In fact, much of the decor is frightening similar to items left behind by my Polish great-grandmother. The paintings are the same style as one that now hangs in my grandparents' home. So I can only assume that it smacks of authenticity in that area. After my trip to the \"homeland\" this fall, I'll have to report back with observations on the culinary authenticity. \n\nBoyfriend had the meat pierogies, which he enjoyed although he wished there was more of a sauce to go with them. I tried the \"Polish vegetable salad,\" which turned out to be basically a potato salad-type concoction made with diced potatoes and other veggies. We Poles aren't exactly known for our haute cuisine, but as homestyle, comfort food goes, this salad was weirdly tasty. I say this as someone who really doesn't even care for mayo. \n\nI had the golumbkies, which I really loved. The cabbage was perfectly soft and wrap-like with no toughness to speak of. How do they get it that way? Even when I try boiling the crap out of cabbage leaves, I can't get them like this. The meat-and-tomato filling was also really tasty and the portion was large enough that I took one home. Not bad for $8. I think our total bill came to about $20 and we were both stuffed and carrying doggy bags when we left.\n\nAs previously mentioned in another review, the sole waitress is the owner's daughter and she's a doll. I chatted with her about my upcoming trip.  She's never been to P'land herself, but her parents are, in fact, from there. \n\nMuza isn't going to wow you or cause you to experience a mind-blowing foodgasm. That's not what it's trying to do. Think diner food, Polish style. You'll leave full and content, with barely a dent made in your wallet. And really, isn't that what you want sometimes when you go out to dinner? Sometimes I don't need bells and whistles. And apparently, sometimes I just want to feel like I'm in my ancestors' living room.", "type": "review", "business_id": "U_wLGkq86qyd8yzpKyFswg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1tRhFdJgkcVtLg2lpMlN_Q", "review_id": "uFJuc4FDtNC7LOYYJ3Za6A", "stars": 5, "date": "2011-07-27", "text": "I come upstate to Cohoes to help out with family stuff and when I do, Mick's is my quick food goto spot.\n\nGreat pizza. They really get the sauce right and know how to make a well done pie if you ask for it.\n\nTheir salads are good too. They're large and filled with fresh ingredients.\n\nThe subs are fantastic as well. The bread that they use is crusty but not overly tough or chewy. \n\nI\"m really glad that this place is just down the hill.\n\nThe staff is friendly as well.", "type": "review", "business_id": "f0NbIT50Kqqfh9b7T2Zo5Q"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "u-vXcQxgxwjpAxJcSsm03w", "review_id": "GekMtaE1kADBU9d2C42TZQ", "stars": 2, "date": "2012-01-24", "text": "Place is a joke.  Overpriced trendy foods.  Rotisserie chicken same as Hannaford costs twice as much.  Produce?  What produce?? Aisles too small, but trendy shoppers like that.  Better off going to Wallmart's organic food dept.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-NMwSexwsQHVAp8r8uX5-Q", "review_id": "DWJUfWh4Y5_cmlHJHv8TGg", "stars": 5, "date": "2011-09-02", "text": "The best pizza anywhere.  The pesto pizza on the whole weat dough is out of this world.\n\nLet me tell you that I know pizza.  I grew up in New York City, I ate pizza every day for about a year.  I've lived in Italy, had every kind of pizza there.  I love pizza of all kinds, and I can tell you Defazio's makes excellent pizza.\n\nI would rather eat lint than not have a Defazio's pesto pizza.\n\nWhat makes Defazio's so good?  They make their dough fresh from scratch on premises: you can simply taste it.  The sauces, all made next door at the Defazio's deli, which has been around for decades - probably close to 50 years or more - are all made from the best ingredients the old-fashioned way.  And Rocky has a secret ingredient in the pesto sauce that, I think, gives it the perfect taste for pizza.  Ask him about it.\n\n20+ years ago when I tasted the pesto pizza for the first time I was in love, and it has been an enduring relationship.  Whenever I'm in Troy I make sure I stop by.  I sing love songs to my pizza when it arrives, and I weep tears of regret when I'm finished.  The other pizzas are good, too.\n\nThink I'm embellishing???? Try it.", "type": "review", "business_id": "6PdMtDkLAg_kDYCEi6VBwA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-l9giG8TSDBG1jnUBUXp5w", "review_id": "Rr4ks3pNLSuiKioWiurRUg", "stars": 2, "date": "2012-07-11", "text": "The family and I came here for brunch while visiting for a wedding.  The menu options were fairly standard fare, but somewhat limited for breakfast.\n\nI ordered the steak, egg, and cheese wrap - it was ok.  The steak was a bit tough and it was unremarkable.  The husband got eggs Benedict and they were ok, but once again, somewhat just average.  My step-daughter ordered a bagel with cream cheese (not toasted) and it came out toasted.  They fixed that quickly, but it was still a bit frustrating.\n\nThe place was busy since there was a street fair going on, but the service was really kind of disappointing.  I ran out of water, my husband ran out of coffee, the food took a while.  Maybe they're more of a lunch/dinner place.", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 0, "useful": 5, "cool": 3}, "user_id": "GwlrUwkULm4ZLN-Kum5nag", "review_id": "uB5mUqSE4bL1KOeOBh5Dgg", "stars": 4, "date": "2009-09-26", "text": "Big Apple Pizzeria (formerly Empire Pizzeria) is conveniently located at the corner of College Ave and 14th St, across the street from the RPI campus. \n\nThis cozy pizza place offers an impressive selection of regular and specialty pizzas by the slice, about 20 pizzas on hand (Pizza Da Vinci has a similar concept). The specialty slices are $3.00 a slice and are pretty filling. They have cheese, pepperoni, meat lovers, buffalo chicken, ziti alfredo pizza, Greek, Hawaiian, veggies, steak & cheese, and eggplant, chicken parm, and more. The pizza crust is very firm with a pizza bread texture and loaded with tasty toppings. My favorite pizza slice is the breaded eggplant with red peppers. The slices are heated up in the oven and come out quick.\n\nPizza is the ideal food for the hungry college student! I would eat here a lot and try every slice if I were going to school again. Back in the day for me, I had to settle for Hole In The Wall for much of my pizza needs during study time crunches.\n\nBesides pizza, they offer calzones, strombolis, garlic knots, rolls, salads, wings, appetizers, subs, and pasta dinners. See the menu and prices at http://www.bigapplepizzeria.com\n\nThere's seating inside and outside seating along the College Ave side. This place is open pretty late until 3AM (Sun-Thu), 4AM (Fri-Sat) and 2AM during the summer.\n\nRAD is accepted here.", "type": "review", "business_id": "y0J2PrJh2LIDHHtT6DzkJw"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "yTFhD4hgiuadqWhlAFfQMg", "stars": 4, "date": "2008-06-12", "text": "Way better than Northern Lights. Oh, so so so much better.\n\nThey serve Brown's beers on tap. Drink prices are what you'd expect for a music venue, but not the $7 you'd pay for a small well drink at Northern Lights.\n\nAlso, props for holding several Troy Night Out afterparties - the atmosphere is fun and all ages. Really. There are young people, older people, tons of people.\n\nThe balcony is also great - it feels like you get a better view of the stage, almost like you are closer, but also while separated from the mass of bodies downstairs immediately in front of the stage. In one front corner of the balcony is a perch/cubicle-sized area for some kind of control panel. Lights or sound maybe. I dunno. There's a ladder that goes from that to the floor, presumably to make it easier for whoever is up there to get there and down if needed during a busy night. All I know is it really makes me want to climb it every time I see it. \n\nTheir parking is also pretty great. They have plenty of it, and it seems to be pretty easy to find.", "type": "review", "business_id": "9R5M8pvADCjM_0rfZTwb4A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "h9NF04RxYTt3viI_bmoJOQ", "review_id": "mLUERNoXI6lhclptrnrKCw", "stars": 4, "date": "2010-08-20", "text": "Great beer, great outdoor patio with river views :)", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 2, "useful": 0, "cool": 3}, "user_id": "DTMqqEV0BIwVYIhUxThbcg", "review_id": "XYXoSgZ_i-AsRyJ2tt_sTQ", "stars": 4, "date": "2008-02-27", "text": "After seeing Think and D's and Ticia G.'s reviews of Spiaks, which is just down the street from the Purple Pub, I knew I had to review this place.  But first a little back story, most people I know either go to The Purple Pub or Spiaks, but never go to both.  My wife and her family have always been Spiaks people and myself and my family only do the Purple Pub.  Since we've been together, we've had to cross enemy lines a couple times for family's sake, but neither of us has every said the other place was any good.  In fact, I don't recall just the 2 of us ever going to either of these places, we just can never agree on which one to go to.\n\nOtherwise, my review is pretty similar to Andrew J's - I've been going here for years and have always enjoyed the food.  The pizza and wings are good as well as the Italian dishes.  They also have some pub fare, so there are quite a few choices and you can usually satisfy everyone.  Probably one of the main reasons my parents always took me and my sisters there.", "type": "review", "business_id": "7H9wF_UHLgWPpRCKu8TlJg"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "YNTdDwA1f2cu0l2ZZJ1bVA", "stars": 2, "date": "2009-01-14", "text": "I walked into Spring Garden thinking it would be a good fix for some bad-for-you cheap Chinese take out. \n\nIt was your expected greasy fare, but had almost no seasoning. Is it the location? A bad cook? I have no idea, but it looks so clean I really wanted... something. A little more oyster sauce perhaps? Something, anything, really. \n\nThis is just so odd, it  boggles my mind. On a positive note, at least it wasn't super salty...", "type": "review", "business_id": "t1XPSn5O1edDJwhJFYeEIQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vw02Rut7665Sge3ea7yV5w", "review_id": "57IPEgzPqL-1YQRzU-tvqA", "stars": 4, "date": "2012-07-01", "text": "There are a few things here you shouldn't miss:\nthe yeast raised donuts: Ask for a box to put them in\nthe coffee - good stuff\nthe natural rotiserrie wings are about the best I've ever had anywhere\n\nYes, it's cramped and far too expensive to be a regular stop, but it'll stay in rotation until Trader Joes opens in August. Oh, and the wings.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "rls4xC1sFAy6aLAoLtwXPA", "review_id": "lsMCMWdrrUqWzi0dzJBMJw", "stars": 4, "date": "2012-08-09", "text": "I'm going to take Hoffman's as it is, since I don't have the burden of nostalgia to color my impressions of it, but instead am coming here from California where we had a number of really good family-oriented theme parks in reasonable day-tripping distance.\n\nThere are 13 \"kiddie\" rides (if you count the excellent if short train loop) and 5 (or 6? do Bumper Cars count?) \"regular\" rides, and they all pretty much look like they were dumped there by a traveling carnival in 1956 which forgot to come back and pick them up.\n\nWhich to us is a feature. If you buy the 25-ticket book, you pay $28.75, which works out to about $1.15 a ride for the kiddie rides or $2.30 for the \"premium\" rides. I compare this to \"attractions\" at various Family Fun Centers in the area that run $4-$6 for a roughly equivalent amount of entertainment, or the awful mini-golf course adjacent that charges $4.50 for the worst course in creation for kids, or $39 (plus parking, you pay for parking for some reason) per person, adults included, at Six Flags up the Northway, I say, this is a complete bargain. \n\nThe rides themselves don't last that long, but if you're entertaining somebody in that 2-6 year old range, that's a feature. There's enough that you can make two circuits of the park for one 25-ticket book if it's just the kids going, and you don't have to use all your tickets on the same visit (although apparently you can't keep them until the next season, caveat emptor). There's no admission fee and as such you don't pay as an adult for the privilege of standing around watching your kids fly in pretend biplanes or whirl-a-whirls.\n\nThe grounds are small and a bit old-timey - no real places to go stretch out - and dining options are limited to the usual ballpark/carnival fare. But it's all very low commitment - if the kids are getting bored after 15 minutes, why, you can just go without feeling like you have to make a huge admission ticket \"worth it\".\n\nAs far as the vintage of the rides go, I doubt seriously your kid minds if they're all a bit old hat, and there's a certain charm to the old school nature of the place.\n\nHere is your age guide for how things will go - your mileage may vary but I doubt it:\n\nAge 2 : will be scared and probably limited to the train ride and a few others.\n\nAge 3: will want to go on about half the rides, but do them over and over and over again.\n\nAge 4: will want to do every ride but will poop out about 2/3 of the way through, but not before whining to do the Bumper Cars\n\nAge 5: will successfully go through all the rides, insist on buying more tickets, then start getting cranky after you've been on two repeats\n\nAge 6: will start to lobby to go on the \"adult\" sized rides but will consent to ride on the kiddy rides, and will start to stick to regular favorites\n\nAge 7: will start to sneer at some of the rides as kid stuff but once you get them on the ride they will continue to enjoy them as if they were 3 again\n\nAge 8: will be stuck between not being big enough for the bigger rides by themselves but now being too big or above the kiddy rides, and will be stuck awkwardly not sure what they want to do\n\nAge 9: will be in full on dislike of the place, except for the bumper cars", "type": "review", "business_id": "VcuMtj_cGyjaa_O1E2xMIA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3SX5W86Fhv5kQW_eoYMpng", "review_id": "NoZUS-0bfAFqY3X43TgFag", "stars": 4, "date": "2010-09-01", "text": "Best Indian around, compared to Curry house, lazeez, shalimar, and a few others. Difference is you certainly pay for it here. Buffet has a lot of items you won't find at the others but not too big of a fan of the bufffet. Meals though here are top notch but as stated plan on shelling out $20 a person minimum. My opinion the one in saratoga is better too.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "G_Y7oM7650zU4jNaJkVV8Q", "review_id": "76hd-AeHXiZU49rBBN91Nw", "stars": 5, "date": "2011-11-11", "text": "I recently received a massage from Nick - it was so relaxing, exactly what I needed after a hectic day.  After my massage he even gave me tips on how to reduce my back and neck strain. He was very knowledgeable, I look forward to my next massage!", "type": "review", "business_id": "38GVFKqsaX1RjJGWpjVpqQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "y6O493_TsQoPwu7HwDZPvg", "review_id": "g_OUsGXudjZ8o0NYKKOqtA", "stars": 1, "date": "2012-04-29", "text": "The name fits, it's South Troy, what do you expect? Worst burger outside of a prison, assuming they serve burgers in prison.", "type": "review", "business_id": "o4G9cfQQgktHYvYafIpLwg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y1pFN1QQg03JonTuQAG_yg", "review_id": "Y6-ILwZEL2TtPlOTx06xlg", "stars": 3, "date": "2012-01-01", "text": "My ex lived about a block away from this place, and when we were dating we probably came here to eat breakfast once or twice a week.  I have to say, for a coffee shop, their coffee was not very good.  Way too strong, almost with a burnt flavor--I think they aren't using the right ratio of water to beans.  Their breakfast food is pretty good, though they screwed up the order often enough that I began to expect it.  It takes awhile for them to bring it out.  The staff was usually pretty friendly.", "type": "review", "business_id": "AZqsal3nzTkwQqxUol_UjA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tAukPln3Ha-ouRj5OYSZ1Q", "review_id": "-9cukNjHy6eMT1eSc4YvZw", "stars": 2, "date": "2008-06-02", "text": "If the coffee matched up to the great hours, atmosphere, couches and open mic nights this could easily be my favourite coffeehouse in Troy.\n\nSadly the espresso sucks. The staff is mostly unfriendly and they couldn't care less about making a decent latte. I've had much better at Starbucks!\n\nReally, Troy has a bunch of much better coffeehouses if you want good quality coffee.\n\nFor excellent French-press coffee  - go to Oliver's Natural's on Fulton  (and if you want it iced, it comes with coffee ice cubes so as it melts it doesn't get watery - delicious)\n\nFor excellent espresso - go to MochaBlend on Hoosick St up near Walmart.", "type": "review", "business_id": "rIe12fdyMfvJtagDly5QGg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qvc30NwX8KycPtUW3uIdxA", "review_id": "tiS65e-z4VLAdxRbYdRdQQ", "stars": 5, "date": "2011-08-01", "text": "Super clean, generally fresh produce and good selection of meat and baked goods, prices here are generally cheaper here than other stores in the area.  \n\nPeople seem to be friendly and lines tend to be short.  Never have I thought to myself that I would not come back.\n\nCan get some stuff at Wal-Mart cheaper once in a while, but never worth it no matter how many times I have tried.", "type": "review", "business_id": "UZFBK4pU-VcEt1N4IoYCRA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jzH04vzXw5xs4sxAUWFohg", "review_id": "suoMLKYUJgzaaUwpnSZquw", "stars": 3, "date": "2009-09-24", "text": "3 stars is just about right. The fish frys are very good, although I didn't like their chili sauce...it was more like relish, but there were a lot of regular customers ordering it so ymmv. Had a fish fry with cocktail sauce and tartar that was very good. The staff here just yell the food back to the kitchen help and they are always getting it screwed up or miscommunicated...comical, maybe that is part of the charm? I also had a hot dog and the sauce is sort of bland...I prefer hot dog sauce with a lot more flavor and kick. They also had carrot cake and cheesecake available...figured they had to be great...the carrot cake was a little dry. Go eat fish frys, figure out what you like on them and you will be good to go.", "type": "review", "business_id": "4Asa_ZggWWgr5EAuTUY2cQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "-l9giG8TSDBG1jnUBUXp5w", "review_id": "CmJXgv1kpXdNSnUNSiMK9Q", "stars": 4, "date": "2011-07-11", "text": "So on a hot and humid summer afternoon my husband, step-daughter, and I came here to play some mini-golf.  With a little girl who hates bugs and heat, we decided to give their indoor course a go.  \n\nIt's a black-lit area that's designed with lots of wackiness.  The floor is 100% concrete.  The lady who sold the tickets warned us that it was super difficult and we may do better playing outside, but there was no convincing a 7 year-old to do that.\n\nThe course itself was extremely challenging.  Playing mini golf on concrete is not my idea of fun.  It was good way to kill our hot afternoon in some air conditioning, but it definitely wouldn't be my first choice of how to play.  I give them credit for being creative with what they could do with inside holes.  The outside course looked fun and I definitely would come back again.  The extra star is for the friendliness of the staff!", "type": "review", "business_id": "RZmmcTKMDo4UErKn0Ve7gg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "CzrLQ_ktJf5avZO1_1Az0g", "review_id": "TqvvbuxnRqQxZdVjzArcpA", "stars": 4, "date": "2011-04-28", "text": "Agree with the other reviews, except that the garlic they use on their crust is powdered.  I think it would make it loads better if they just fresh garlic it up in their butter and spread it on the crust.\n\nIf you're in the area and deliver to your home, I'm jealous.  I wish I could do that.  This place is comparable to DeFazio's.", "type": "review", "business_id": "f0NbIT50Kqqfh9b7T2Zo5Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "2JBFwseSdI8Kqv5roZjYPg", "stars": 3, "date": "2011-06-16", "text": "When is a bowling alley not a bowling alley? When it's a bar.\n\nThere's a bowling alley that opens at a certain time at night. I think like, 8/9? But otherwise if it's open, it's probably just the bar.", "type": "review", "business_id": "_M7mLNPK6xS805OYFgfaEQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XcoiMds1L2aJJxGhLThE5Q", "review_id": "aEGA9uE4mbykQtMMcCraTA", "stars": 4, "date": "2012-09-16", "text": "The Illium cafe is definitely one of the best restaurants in Troy. I have been there on a couple of occasions during street festivals. . The cafe is a tad cozy but comfortable and welcoming. They have some extraordinary specials and the value is great. The dishes a very creative with a good blend of different flavors. \n\nOn my first visit during the Victorian Stroll, I tried the corned beef macaroni and cheese. That particular dish was unequivocally  the best mac and cheese I have had in Albany. On another visit I tried my first soft shell crab sandwich, which was pretty tasty. The only negative was the slow service. I hope to return for a weekend brunch in the near future.", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "M_-7O5T0UnOl4WeR0JGj3w", "review_id": "rWbE2G0nj-1w6uoYhzQq0g", "stars": 2, "date": "2011-10-20", "text": "If you like sub-par breweries, this could be your place. Fairly bland poorly crafted beer and nothing remarkable about the decor. I would love to say more about this place but it is hard to add to the overall descriptor of 'blah.'\n\nThat said, the staff was friendly, and if I can remember correctly through a beer induced fog I believe there was a view of the water.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 6, "useful": 7, "cool": 4}, "user_id": "CzrLQ_ktJf5avZO1_1Az0g", "review_id": "Ez1fMtJR4M3olyd1TemTrA", "stars": 1, "date": "2011-12-27", "text": "Let's talk some baseball.  I am no pitcher, but if Fresh Market was the opposing team, our team would pull off the perfect game.\n\nToday was my first time trying the place out, and I was highly disappointed.  At first glance, the place looked welcoming and vibrant.  I was drawn to the salmon deal that said buy one get one free for 5.99.  I started to ask a question to the lady that came over about that deal.  \"How much would I need to get to get that deal....\" She cut me off with something along the lines of, I'm helping this customer, you need to get a ticket.  I definitely didn't act as if I was cutting in line, but she definitely made me feel like it.  The answer probably would've take two words: \"any amount.\"  Decided that I'm not having salmon tonight.  Strike 1.\n\nI then went over to try some coffee.  They had some samplings which was nice.  I was pretty satisfied with the pumpkin spice decaff, but not so much on the decaff.  I asked the lady if there was a caffeinated pumpkin spice and she snapped at me saying that all the samplings were out in front of me.  Strike 2\n\nI went to the check out, thinking overall, my first impressions were really bad.  A $3.79, 4.99, 5.99 came out to be 17.49.  I was actually a little preoccupied with figuring out whether the cash register was wirelessly connected to the TV, so I took a look at my receipt as I was walking out.  Now I know tax exists, but I didn't think I needed to tip my cash register.  I wanted to talk to someone about my receipt because it didn't seem right, and I was charged for a 10.99 bulk item.  As I went back to a register, the lady incessantly said, \"I am closed after this customer, please find another register.\"  I was holding my receipt and shopping bag, obviously not looking like I was going to purchase anything.  But that didn't seem to matter to her.  No customer service there.  Foul ball.\n\nSo I finally got someone to help me.  He initially said, the 10.99 was a bulk item. Then he almost tried to convince me that the 10.99 was for the coffee, but I said, no that was 5.99.  I usually don't remember prices, so that might've changed my mind.  And then he came to conclusion that she accidentally pressed the wrong button.  He gave me back the $11 in cash and said, \"we'll call it even.\"  No apologies.  He wasn't rude, but it's nice to hear a simple sorry.  I mean think about it, that was 3 products I bought.  Most people buy a lot more, which makes the mistakes harder to check.  Strike 3, game over.\n\nThe ninth inning was the highlight of the game.  Let me tell you, it was no easy feat, but I have decided, I am not coming back here by choice unless management makes trades for better players or maybe a Joe.  I'll leave on a high note.  In hindsight, I feel like I lowered my standards for buying stuff from them because I don't just buy a product; it's also about the service.  I'm sure if they recruited Wegmans, their team would hit a home run.  That's probably never going to happen, so I guess I'll have to wait on 79 Wolf.  Please make that happen Colonie.  Thanks!", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "LHb_ZaOFaUmk1YqAR-op1w", "review_id": "8RcMWED5CFLjfNH_BSHBMA", "stars": 4, "date": "2011-09-16", "text": "Very good pizza and wings.\n\nWe got take out the other night. I had a coupon (printed out from their website) for a medium cheese pizza and 10 wings for $15.99. \n\nI ended up forgetting the damned coupon and paid $19+ for my take out meal. My mistake. Oh well. \n\nI don't think they deliver. \n\nWe will defintely order from here again.", "type": "review", "business_id": "rh1bJwxoh4-nFQAvZdP3Yw"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "jjDyqPj4d-FZt3ktZrKxbw", "review_id": "loPGhlKr7ZwDYPVKcA4Ehw", "stars": 2, "date": "2012-05-18", "text": "Geared to the 3 year-old and younger crowd, but suitable for parents to watch, I wasn't too thrilled with this place a few years ago.  Although my parents remember this place as being rides for older kids, they were fair depressed when they found out how much things changed, when they took my brothers(9 years old at the time), and I there.  I mean, really...?!  Let the public know in the newspapers that  this place is really meant for those young generation kids.  The seats were small(and so was the admission to get in(FREE), it only costed us a few dollars to buy ticket books.  Each ride only took about one ticket.\n\nThere is a picnic area there(in back section of park), but with a small number of people, we had no one else to talk to...was embarrassed and sure felt bad on our ride home.  \n\nThe only good things with this park was, for those not enticed, there's a ice cream shop just outside(literally park grounds, along with a Subway sandwich shop.  Maybe the advertising from yesterday should have been listened to after-all.  I won't be returning, and neither will my kids(if I should ever have any).", "type": "review", "business_id": "VcuMtj_cGyjaa_O1E2xMIA"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "STiP2iEkw7yycTde1mPdnA", "review_id": "V4Ycbk8JVRLxnlUfBu8O_Q", "stars": 5, "date": "2011-03-15", "text": "Best wings in the capital region?  I'm not sure yet.  I really like Junior's (Albany) wings and I've heard good things about The Ruck (down the way in Troy).  But, I'll tell you what, it doesn't matter.  Eat all their wings.  Simply amazing.  Crispy, large, and reasonably-priced.  \n\nSo now that you've came for the wings, stay for the amazing beer selection.  I'm a Mahar's regular and there were some beers on tap that i haven't tried.  I imagine they keep the selection fresh so I'm not going to bother listing what they had when I was there.\n\nA final note on the location.  They're right across the street from plenty of parking and, while the place doesn't look like more than a neighborhood worker's hole-in-the-wall, it's really sweet looking inside.  Lots of wood, murals in the bathroom, and a classic dining room- bar room split.  \n\nFinally, the service.  I was there about a half hour before closing and figured I deserved at least a small frown or extra foamy beer.  Much to my delight, the staff was very cheerful and inviting, even for a couple of latecomers like my friend and I.", "type": "review", "business_id": "Qh-hU4JKEjF4kkSe0IGdSA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DRLEkc2twT0IRHZiZ1Bk8A", "review_id": "6SbvArBYfg2v_DJIcmurmQ", "stars": 4, "date": "2011-07-06", "text": "Browns has become one of my staples in Troy when I'm looking for decent food at a reasonable price.  I like it because I can come here when I'm not-so-fresh after a softball game or volleyball tournament or come directly from work in my work clothes and it's equally comfortable.  The atmosphere is pretty casual but still pretty nice.  As a result, I come here very often.\n\nMy favorite foods from Browns are their Cherry Raspberry BBQ wings, soft pretzels, steak salad, and even their cheese board.  The food in general is pretty good.  They have a good variety of beers (though once in a while they'll run out of something, but it's not a big deal since there's usually a comparable substitute).  Service is usually pretty good as well.  They used to hold trivia here though I'm not sure if they do any longer.\n\nThey also have outdoor seating when it's warm out which is always nice.  The one thing I will say is that since it's in a popular area (for Troy), they're prone to long waits on a Friday or Saturday night.  But that's normal for a lot of places so I just factor that in when I make plans.\n\nIt's nothing fancy but if you're looking for good food at a resonable price with good service and a casual atmosphere, Browns is a good place if you're in the Troy area.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jbme6UoDggF7NtkItZZyhA", "review_id": "Ja5tsCfttXQ_gl4z4l7a3g", "stars": 4, "date": "2010-06-09", "text": "I went and saw Jason Reeves play here for $12 and the staff was very friendly. They have a balcony with tables lining the railing, and they have 4 long booth seats on the lower level by the sound guy with 2 long coffee tables. They also have a bar where 1 cup off beer was about 4.25. I thought the stage was a little high, but the place reminded me a lot of The Chance in Poughkeepsie which was cool.", "type": "review", "business_id": "9R5M8pvADCjM_0rfZTwb4A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1w_QkIakyV7zvNCCuuyqUQ", "review_id": "c-5ajbGQ3Imuc-q1UhcgFw", "stars": 3, "date": "2011-03-14", "text": "I've been in for coffee a few times before. I've always thought it was on the slightly more expensive side of affordable, but not horribly so. \n\nMy guy likes going here for their unlimited cup of coffee. That + free wifi is a good working lunch/time killer if you're in between enagements in Troy. But when he calls me from here all I can hear are freaking brass instruments in the background. Maybe turn the knob down on the dial a bit. I wouldn't exactly call this a quiet coffee shop.\n\nIt seems like they're not very good with a crowd. The Troy Farmers Market is across the street in the winter (Atrium), and it seems like a lot come over for breakfast here at some point. \n\nI spent about 5 minutes waiting in a line of 3 people this weekend. It didn't move. At all. There were two people on register who kept calling for someone who wasn't picking up their food. Or one would call, and the other would just stand there not taking customers. If they don't come up the first few times you call, let 'em wait and come up to you. There were several other staff members who weren't busy and it made my brain think \"OH MY GOSH, HOW DO YOU NOT HAVE A SENSE OF URGENCY WHEN THERE IS A LINE???? \" over and over. \nThis is one of my service peeves as a customer. I don't care if there is a long wait and a line as long as it looks like there is an effort being made to get things moving. But no moving? No moving at all? I gotta go.\n\nI didn't get the feeling I would be putting an order in any time soon, so I left and went to the Placid Baker around the corner. \n\nIf you're pressed for time, you might want to chose some other place. My guy likes going there for lunch. He says they make a good burger. I'll give them another shot, just not when I'm on any kind of schedule.\n\nAlthough I've gotta say, their slowness made me discover a delicious breakfast sandwich at another business, and now I'm less likely to get food from them as a result of their slow service. I think there could be a bit of streamlining on the operational front, as this is something that is relatively easy to fix for the future so they don't lose any more customers.", "type": "review", "business_id": "AZqsal3nzTkwQqxUol_UjA"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "JDFeEKbR1rubn7VS-Snxvw", "review_id": "FszFOnQwr0bqnDDOrmYdyA", "stars": 4, "date": "2010-09-06", "text": "Great wings, really meaty, 10 are more than enough for 1 person, large selection of tap beer, ambiance leaves something\nTo be desired", "type": "review", "business_id": "Qh-hU4JKEjF4kkSe0IGdSA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "GwlrUwkULm4ZLN-Kum5nag", "review_id": "6y5fKWf28XYJ_06ZPmClqQ", "stars": 3, "date": "2009-01-02", "text": "This review is based on the Lunch Buffet.\n\nBombay Grill is located at Routes 155 & 9 in the former Toyko Sushi and serves up Indian, Pakistani, and Afghani cuisine. The dining room atmosphere is relaxed, fully carpeted with several tables (linen covered tables/plate glass surface) with flowers, curtains in the windows, TV in the corner, and light background music. A Lunch Buffet is offered Tues-Fri 11:30AM-3:00PM ($7.95) and Sat-Sun 12:00PM-3:00PM ($9.95). \n\nI arrived here on a quiet Friday afternoon around 1:15PM and had the Lunch Buffet with a basket of hot naan included. The Buffet had 15 items including the 4 sauces (raita, mint, tamarind, onion chutney), green salad, chana papdi chat (cold chick pea salad), basmati rice, vegetable pakoras, tandoori chicken, chicken tika masala, lamb korma, bhindi masala (okra), chana masala, aloo palak, and a hot sweet rice dessert. \n\nMost of the food was good and hot including the chicken tika masala and the lamb korma. Some of the food was lukewarm including the rice and vegetable pakoras (very dry). The food had the right amount of spiciness and flavors. The hot rice dessert with sliced almonds was pretty good and I had to have seconds! The service was good and my used plates were cleared and the water glass was refilled and topped off between trips to the buffet. \n\nOverall 3.33 STARS for the lunch buffet.", "type": "review", "business_id": "-4ArSF1om4JXNBA8wAnQyA"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "yexPXtqaRWuBMurl5tvDdQ", "review_id": "mwRAWFx4wM56BgF990fOMA", "stars": 4, "date": "2012-04-08", "text": "Fabulous food, fabulous atmosphere, fabulous time!\n\nWent here for the first time since the new ownership and what a great job they've done with the menu. Talk about soups, sammies, and salads with twists...and homemade breads to boot.\n\nHad the beef lentil curry soup and it was delish! Very hearty yet light and well balanced flavors and some thick toasted bread for dunking was very delightful.  After I had the turkey panini sammy on focaccia and it was delish especially with the cranberry orange mayo.\n\nFor coffee had the peppermint coffee which was nicely balanced with that little hint of freshness you can't put your finger on.\n\nINside you can tell that it's an old historical building but they make it a quaint intimate cafe and it gives you that big city feel which is kind of cool\n\nService---very nice people, but not good at waiting. With the exception of the one guy (wish I could remember his name) who was absolutely fabulous, the waitress and the hostess were nice but didn't know the menu very well and they were slow. Don't get me wrong, I liked the not being rushed atmosphere, but the waitress took forever for things and she forgot silverware--twice, and she never checked on us to see how we were doing and i had to ask to hostess to correct my incorrect side order.\n\nHowever, the food was so delish and the people friendly that I will definitely try it again soon.", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 2, "useful": 6, "cool": 5}, "user_id": "vOMSNQLv0uJ9JlGE-IPi-g", "review_id": "ZX339JnnJ-gnCHJHTngRRQ", "stars": 5, "date": "2012-03-29", "text": "I have been coming to Bodywork Professionals for about a year now and there is no place else in the Capital Region that I would consider going to for deep tissue massage and body work.  I have always received professional, courteous, and caring service from my practitioner and the owner.  \n\nI recently referred my boyfriend's daughter here when she was having back pain from her vigorously active life style.  She was originally scheduled with one of the practitioners who is also a doula who had to attend a birth and couldn't keep the appointment.  The owner went through great efforts to make sure that he got her in with another practitioner and that she received the care and treatment that she needed.  My boyfriend's daughter went back for a second appointment and was equally as pleased with her second session.  \n\nThis is one of the few businesses that I recommend without any hesitation or caveat.", "type": "review", "business_id": "qTp9RJpqn8WMuMliov5AuQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "tDSNWC5WKwx52yq6X26kfw", "review_id": "BGIwD00TkTmPUw3K8QXDFg", "stars": 5, "date": "2012-07-20", "text": "Excellent italian food at a local joint!  \n\nI had the chicken parm lunch special and it was delicious!  It was just the right amount of food.  The chicken had the right amount of breading and melted cheese and I loved how the garlic bread was almost half a foot long.  I've been to a bunch of italian restaurants where you usually only get a tiny piece of garlic bread and you run out of bread before you've finished your meal.\n\nFor dessert, I got the buttercream gelato.  I think the buttercream flavor was a little too subtle for me, but overall it was good and satisfied my gelato craving.      \n\nI'll definitely go back if I'm ever in the area.  Go check out this place out and support local food joints!", "type": "review", "business_id": "4VdGntX6dKc-xQ_nFlpdVQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5CkxGsWWnW3xMvzPGWJFLg", "review_id": "VvdIkD_AIyI8l4SqRZGlgw", "stars": 4, "date": "2011-08-06", "text": "I really like this little place!\n\nThere were so many yummy flavors, from Mojito to Cajun Strawberry and Coconut Chocolate Chip. I chose Cajun Chocolate Peanut Butter and my companion chose Cinnamon with Crisps. Mine was very rich chocolate, real, salty peanut butter and a really intense AWESOME spicy kick. Not sure what spices were included, but it was great!\n\nThe Cinnamon ice cream was very subtle and old fashioned-tasting; not too overwhelming. People who like light, elegant flavors will probably enjoy this.\n\nI had to give it 4 stars because the prices were kind of high--I got a kiddie sized cone (one scant scoop) and it was $2.95. However, the ice cream is homemade so I think it was worth the novelty. \n\nI will definitely be back for a taste of the \"Roman Delight\" (a spumoni-inspired flavor) as well as the white wine sangria! \n\nOh, and I'll probably play on the swings, too! ;op", "type": "review", "business_id": "CPkUO2F9VENCaLXf4zj5UA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "vOMSNQLv0uJ9JlGE-IPi-g", "review_id": "5iHo3a3u_MUFBTChCS3SNg", "stars": 4, "date": "2011-11-26", "text": "The only reason they are getting 4 stars is because they actually had the beer I wanted on tap, unlike the usual \"sorry we just ran out\" or \"we've been out of that for a few days\".  With a whiskey barrel porter raised high, Cheers.  \n\nI know they have been trying to beef up their menu from usual pub fare for the last several years, but anything that I have tried has been ho hum.  The burgers and other pub fare are excellent.  Last evening, with my whiskey barrel porter (which was chocolaty, caramelly, a little smoky whiskey delicious smoothness), I had a burger with guac.  I asked for medium rare and I got medium rare (which is a huge improvement from before when burgers were always served a la hockey puck).  The sweet potato fries were nice and crisp but could have been served hotter. Almost $10 for a burger and $2 for the sweet potato fries is a little pricy for what it is.  Stick to the pub fare and avoid the attempts at entrees which they shouldn't even be trying.  \n\nThe waitress was okay.  It was a TNO friday and they were busy but she was not all that attentive and I don't think we would have had here attention at all if it wasn't for us being an assertive 3 top table.  I did not get the extra pickles that I requested and that made me very very very sad.  \n\nI'll keep going back because I like the brew but always set my expectations low for service and know to avoid anything on the menu other than the pub fare.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "UlO8tLOyyXUCt3aRcezxvA", "review_id": "DV2wHd1z8ZBvAcsocxfvtQ", "stars": 3, "date": "2011-10-19", "text": "I moved from a major Metropolitan area and I miss my Whole Foods and Trader Joe's. I notice that the Fresh Market almost stole the lettering font and color from Whole Food and the basic premious of the store...setup etc. \n\nWhen things go on sale they are in the Whole Foods range. \n\nLet me say that I do shop here for some things but other things are overpriced even for Whole Foods standards. I was very disappointed that there meats are so OVERPRICED. They aren't even antibiotic and hormone free minus the chicken which I do buy. I called to ask them questions about their meat and clearly they have NO CLUE what they sell. \n\nThey can improve I hope because I really want to love it there. THey have some really unique fun things there such as their bulk,coffee and candy section. But they have a way to go.", "type": "review", "business_id": "n5s4xjB2jwwDHKE2Rj6tXw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "SgjI2nVT8scqeZuqueqOSQ", "review_id": "UsDxc8CRnJcLzqYPJkPbLw", "stars": 5, "date": "2011-07-18", "text": "Sure, they changed their name to \"Big Apple\" - but anyone who is anyone still calls the place \"Bella.\"\n\nThis is the first place I want to go when I go to Troy.\n\nPro tip: best when coming home from a party.", "type": "review", "business_id": "y0J2PrJh2LIDHHtT6DzkJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DmMsNSliqtrQN1wRNDu4Pg", "review_id": "t5lam4Y-1B3EhGJv2SYJpg", "stars": 3, "date": "2011-07-08", "text": "Good authentic middle eastern food. Prices are reasonable, unfortunately the service is VERY slow. Call ahead or plan for at least 75 minutes.\n\nThe lamb is fantastic as is the hummus.", "type": "review", "business_id": "hluBhGYt7BOKhCP4M0qDDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rVQB8z74KaxoKyFsPuJyAA", "review_id": "GG-DK4rYl8m9cNM2oGLdVw", "stars": 5, "date": "2010-08-06", "text": "This place is awesome. It's actually called footsy magoos. They have skee ball which I haven't played in years for 25 cents a game. Haven't tried the food but I have heard good things. The interior of the bar is decorated quite uniquely and is definitely worth checking out.", "type": "review", "business_id": "R5tjtiq1YeSAS4MZmjNnWw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UwX29v5nKFTbXIrGyCK-wQ", "review_id": "mg-PHG4wSZ4aIxJdemDq6A", "stars": 4, "date": "2011-02-27", "text": "I agree with all the great things said about Footsy's, and some of  the not so great, like the unfriendly bartenders, and one is the co-owner. Still the place is amazing, and feels like home, but one big problem... What happened to the great live music? The band that used to play there a few times a month has not been there in ages, they are so great and the main reason my friends and I went there, so come on you guys, be nice to the paying customers and get Chris Busone and his band back there!", "type": "review", "business_id": "R5tjtiq1YeSAS4MZmjNnWw"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "7XvUlAuIRF9IhWAvlr5U7Q", "review_id": "Ml7tVEnXpZ4RaQeb1dxcBA", "stars": 5, "date": "2006-12-17", "text": "This little dive is on a quiet residential street in Troy.  You'll probably drive by and and not even notice that it's there.\n\nBut the Ale House has the best wings in the United States, and probably the world.\n\nThis is coming from a chicken wing FANATIC!\n\nTry a small order of their Award-Hot wings.  They're \"holy shit\" hot, but still have such an awesome flavor.  If you're within 100 miles, swing by for these crispy AMAZING wings.", "type": "review", "business_id": "Qh-hU4JKEjF4kkSe0IGdSA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KJnN3PleykbLaE243XUk1A", "review_id": "ceiltPiOAEi9HAVzmXDKDQ", "stars": 5, "date": "2011-07-02", "text": "Excellent food, free Internet, and friendly environment make this cafe a must stop when your in or around Troy.", "type": "review", "business_id": "7GIS7jdPI0WwHYO6S_Grtg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4Xk9ISeTPUpxe9twUSWg4g", "review_id": "9Uw4O4cx1HFmMxOjxxW1qA", "stars": 4, "date": "2011-09-08", "text": "Dinner tonight was mushroom pierogi from this place.  Yummy, yummy, for under 400 calories for a big bowl.\n\nAlso got some fantastic little Kinder chocolate bars for when those cravings strike.  \n\nIt's a nice mix of some hard to find items and the staff is very friendly.  I'll be stopping by regularly.", "type": "review", "business_id": "SA4Qag0p91VQhXAIQt5RfQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VKNIr0wf6u5526MjlE99tw", "review_id": "dXUPpySFOVvmen2R9cflVA", "stars": 4, "date": "2008-03-07", "text": "Although I'm a frequent patron of the Albany Daily Grind, I'd never been to the Troy location until last weekend. After attending our friend's art opening as part of Troy Night Out, we gave up on trekking to the other shows because of the increasingly heavy snow fall. We decided to warm up with some hot drinks.\n\nSame coffee, same drinks, but the locaion is a far cry from the beloved Albany basement location. The Troy DG is spacious and well-arranged, and they frequently have live music. I wish I could somehow take this location and stick it on Lark Street. Now that would be ideal...", "type": "review", "business_id": "rIe12fdyMfvJtagDly5QGg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "1gq25jfibnLBtvze3NyDhA", "review_id": "Ph6Jo_hIN2lSPoLKEFh7ig", "stars": 4, "date": "2011-01-21", "text": "Went here last night and was very impressed.  My boyfriend and I don't know a lot about Indian cuisine and the waiter was very friendly and helpful, offering many suggestions and being honest about what we'd enjoy and what were the best picks for us.\n\nWe both enjoyed our meals.  Everything was flavorful and ample.  The portion sizes are just right--not super huge, but not skimpy either.  My boyfriend ate his entire plate, but I had a good amount of leftovers.\n\nThe location is not the best, it is kind of out of the way in a little plaza, but not awful.  The restaurant itself is small, but clean and welcoming.  Prices are fair, maybe a little on the higher side compared to other Indian restaurants, but fair with the quality of the dishes.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "IP6aa9MZ0DXANYuC9SbStQ", "review_id": "8ryIZTvPS2DOlaktz1xNdg", "stars": 5, "date": "2012-06-16", "text": "I went to this restaurant based on the reviews. True to the reviews, this is really the best in this area. Their Malabar Goat Curry and Goat Biriyani are really good. The buffet on weekends is also good, but is pricey compared to restaurant in Texas. \n\nI would definitely recommend this restaurant if you are in the Albany Capital region.", "type": "review", "business_id": "SmLJWc73PcL3gox-LiVAaQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "UcAMgZnFy03ynOjG1eGqFg", "review_id": "KFu-mcE8DWQgI8LCdkmxkA", "stars": 5, "date": "2007-07-28", "text": "This is my one stop shop for most of my basic hardware and home and garden needs because I'm in and out of here in no time. There's enough parking around the building, which is close to the front door. Country True Value is not the cheapest pricewise, but most items are convenient for me to find. The employees are easy to track down and are very helpful in locating items in the store when I need them. \n\nEarlier this month, I ended up buying my grass seed here instead of at Home Depot because I couldn't wait around for the Home Depot  employee to use the forklift while it was pouring rain outside. Of course, I paid a little more here for the convenience.\n\nSometimes smaller is better!", "type": "review", "business_id": "5BM0cmJvxaFlFuh0L-b4Ow"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "PoAc1N3GaOeWdBVSFsleig", "review_id": "hAXEu1kkzfUdkgdd5A2S_w", "stars": 4, "date": "2009-07-21", "text": "I'm not much of a beer drinker but the Troy Pub (which I will reluctantly call Brown's for the sake of this review) was a very frequent hangout during my RPI days. I still go back on occasion when I'm back in Troy.\n\nThe food is pretty decent, they have a tasty vegan bean burger and their fries are awesome.", "type": "review", "business_id": "o0WYo6-P0PRdShWYGDazZQ"}
